[
  {
    "title": "Environmental Leadership Fellowship",
    "organization": "Virginia Conservation Network (Private)",
    "location": "remote work allowed",
    "salary": "$20 per hour",
    "starting_date": "after 6/1/2026",
    "published_date": "01/20/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112570",
    "description": "Environmental Leadership Fellowship\nVirginia Conservation Network (Private) | http://vcnva.org\nDetails\nPosting:\nhttps://vcnva.org/fellowship/\nApplication Deadline:\n02/11/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 6/1/2026\nEnding Date:\nbefore 8/7/2026\nHours per Week:\n30\nSalary:\n$20 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nremote work allowed\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nABOUT OUR ENVIRONMENTAL LEADERSHIP FELLOWSHIP\n\nThe Virginia Conservation Network (VCN) is an environmental non-profit organization working statewide to advance climate action, restore the health of our rivers and streams, increase access to parks and trails, ensure environmental justice for all, and more. \n\nStarting in the summer of 2022, the Environmental Leadership Fellowship was established to develop a pipeline for a more racially diverse group of environmentalists to join our conservation movement. It also serves as an opportunity for individuals aspiring to launch their careers in the environmental sector, particularly those who may not have had the means to pursue an unpaid internship.\n\nEnvironmental Leadership Fellows will work alongside an assigned VCN staff mentor, and spend time supporting one of VCN's partner organizations working on environmental issues in Virginia, working on projects such as:\n\nVolunteering in grassroots advocacy with non-profit organizations who are a Partner of the Virginia Conservation Network\nEngaging in policy research in VCN’s major issue areas: climate & energy, land use & transportation, clean water, and land & wildlife conservation\nDeveloping virtual events for interns working with our Network to build long-term relationships and form connections with the future leaders of tomorrow!\n \n\nAPPLY FOR THE FELLOWSHIP\n\nTIMELINE\n\nWe’re looking to hire up to five full-time, paid fellows from June 1st to August 7th. The deadline to apply is February 11th, at 11:59 PM EST. Interviews will occur in February & March and offers will be sent out in April.\n\nCOMPENSATION AND BENEFITS\n\nVCN offers a comprehensive list of compensation & benefits for our Fellows, such as:\n\nShort-term, hourly position paid at $20 an hour\nPaid time off and sick days\nUse of a VCN-provided work laptop, if needed\nOpportunity to work from VCN’s office in downtown Richmond or remotely from other parts of the state\nTravel reimbursements for work-related events throughout the state based on VCN’s standard travel reimbursement policy\n\nQUALIFICATIONS & EXPECTATIONS\n\nThese positions are open to all undergraduate students with at least 2 years of study completed (rising juniors and above), master's students, and recent graduates within the past two years.\n\nWe encourage you to apply if you:\n\nshow commitment to advancing climate and environmental justice policy\nexpress interest in outreach within the environmental and conservation sphere\nseek professional and networking support from Virginia’s environmental leaders\naim to launch a career in the environmental movement with a passion for inclusivity and justice\n\nAdditionally, we acknowledge that those in the environmental community all bring a variety of knowledge and backgrounds to their work. As a result, we also encourage those who have a background not directly related to the environment, to apply for the fellowship. As long as you have a desire to work in the environmental field, we would love to receive your application!\n\nFellows must commit 10 weeks during the months of June– August in Summer 2026. The fellowship is 30 hours per week, hours are standard office hours (9am – 5pm) with some limited flexibility to match schedules. Fellows must be based in Virginia during the summer and have access to high speed wireless internet and a quiet place to work. Fellows based in or near Richmond are welcome to work from VCN’s office in person. Fellows not based in Richmond must have the flexibility to travel to VCN’s main office in Richmond at least once during the summer (with travel costs covered).\n\nHOW TO APPLY\n\nFill out the application and attach your resume and cover letter. The deadline to apply is February 11, 2026, at 11:59 PM EST. Interviews will occur in February & March and acceptances will be sent out in April. For any questions about the fellowship or application process, please email fellowship@vcnva.org.\n\nThe Environmental Leadership Fellowship aims to build up the next generation of environmental leaders with focus on increasing the racial diversity of experienced candidates looking to break into the non-profit environmental field. We highly encourage current students and recent graduates of color to apply.\n\nWe are proud to be an equal opportunity employer. It is the policy of Virginia Conservation Network to consider all candidates equally without regard to age, race, gender, religion, sexual orientation, national origin, disability, or other non-merit factors.\n\nContact\nJaime Trejo-Angeles\nfellowship@vcnva.org (preferred contact method)",
    "requirements": "Hours per Week:\n30\nSalary:\n$20 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "Environmental Leadership Fellows will work alongside an assigned VCN staff mentor, and spend time supporting one of VCN's partner organizations working on environmental issues in Virginia, working on projects such as:\n\nVolunteering in grassroots advocacy with non-profit organizations who are a Partner of the Virginia Conservation Network\nEngaging in policy research in VCN’s major issue areas: climate & energy, land use & transportation, clean water, and land & wildlife conservation\nDeveloping virtual events for interns working with our Network to build long-term relationships and form connections with the future leaders of tomorrow",
    "contact_info": "",
    "application_deadline": "02/11/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 6/1/2026\nEnding Date:\nbefore 8/7/2026\nHours per Week:\n30\nSalary:\n$20 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nremote work allowed\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nABOUT OUR ENVIRONMENTAL LEADERSHIP FELLOWSHIP\n\nThe Virginia Conservation Network (VCN) is an environmental non-profit organization working statewide to advance climate action, restore the health of our rivers and streams, increase access to parks and trails, ensure environmental justice for all, and more",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:41.353391+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "MS Assistantship: Understanding how cattle foraging behavior influences weight gain in Central Arizona",
    "organization": "University of Arizona (State)",
    "location": "multiple",
    "salary": "starting at $27,500 per year",
    "starting_date": "after 8/1/2026",
    "published_date": "01/20/2026",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112645",
    "description": "MS Assistantship: Understanding how cattle foraging behavior influences weight gain in Central Arizona\nUniversity of Arizona (State) | https://www.arizona.edu/\nDetails\nApplication Deadline:\n04/30/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 8/1/2026\nHours per Week:\nat least 40\nSalary:\nstarting at $27,500 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocations:\nTucson, Arizona\nRimrock, Arizona\nTags:\nGraduate Opportunities\nDescription\nProject Background: \n\nWe are hiring an MS student to examine whether foraging behavior metrics, like grazing bout duration and velocity while grazing, predict diet quality and average daily weight gain of beef cows on central Arizona rangelands. This region contains a wealth of native biodiversity with ecosystems ranging from mixed desert scrub, pinyon-juniper woodlands, and high-elevation ponderosa pine forest. The student will be co-advised by Drs. Jacob Hennig and Flavie Audoin and will be enrolled in the Ecology, Management, and Restoration of Rangelands program within the School of Natural Resources & the Environment (https://snre.arizona.edu/). Funding is available for 2 years and includes salary, tuition, and health insurance. The student will be based in Tucson, AZ but will conduct field work at the University of Arizona V-V Ranch near Rimrock, AZ. Tasks will consist of attaching GPS ear tags to cattle, conducting field behavioral observations, collecting fecal samples, and analysis of movement data. \n\nThe University of Arizona is the state’s land grant university, located in Tucson, Arizona. The University of Arizona is on the land and territories of many Indigenous peoples; today, Arizona is home to 22 federally recognized tribes, with Tucson being home to the O’odham and the Yaqui.\n\nRequired Qualifications: \n·       B.S. in rangeland ecology, animal science, ecology, or a related discipline \n·       A valid US driver’s license \n·       Proficiency in English \n\nPreferred Qualifications: \n·       Prior experience with livestock handling \n·       Ability to operate 4x4 vehicles \n·       Experience driving and navigating in rugged and remote terrain \n·       Demonstrated written, verbal, and quantitative skills \n·       Field data collection experience \n·       Experience with data management, statistical analysis, and the R programming language \n·       Strong interpersonal skills, with demonstrated ability to work long hours independently and in teams under challenging conditions \n·       Willingness for frequent travel \n\nTo apply, please submit application materials (CV, contact information for 3 professional references, unofficial transcripts, and a cover letter describing interest in the project and career goals) to jhennig@arizona.edu and faudoin@arizona.edu. The GRE is not required for admission or to work with our team, but applicants may also include GRE scores if they think it will improve their packet.  \n\nContact\nJacob Hennig\njhennig@arizona.edu (preferred contact method)",
    "requirements": "Required Qualifications: \n·       B.S. in rangeland ecology, animal science, ecology, or a related discipline",
    "project_details": "edu/\nDetails\nApplication Deadline:\n04/30/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 8/1/2026\nHours per Week:\nat least 40\nSalary:\nstarting at $27,500 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocations:\nTucson, Arizona\nRimrock, Arizona\nTags:\nGraduate Opportunities\nDescription\nProject Background: \n\nWe are hiring an MS student to examine whether foraging behavior metrics, like grazing bout duration and velocity while grazing, predict diet quality and average daily weight gain of beef cows on central Arizona rangelands. in rangeland ecology, animal science, ecology, or a related discipline \n·       A valid US driver’s license \n·       Proficiency in English \n\nPreferred Qualifications: \n·       Prior experience with livestock handling \n·       Ability to operate 4x4 vehicles \n·       Experience driving and navigating in rugged and remote terrain \n·       Demonstrated written, verbal, and quantitative skills \n·       Field data collection experience \n·       Experience with data management, statistical analysis, and the R programming language \n·       Strong interpersonal skills, with demonstrated ability to work long hours independently and in teams under challenging conditions \n·       Willingness for frequent travel \n\nTo apply, please submit application materials (CV, contact information for 3 professional references, unofficial transcripts, and a cover letter describing interest in the project and career goals) to jhennig@arizona",
    "contact_info": "",
    "application_deadline": "04/30/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 8/1/2026\nHours per Week:\nat least 40\nSalary:\nstarting at $27,500 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocations:\nTucson, Arizona\nRimrock, Arizona\nTags:\nGraduate Opportunities\nDescription\nProject Background: \n\nWe are hiring an MS student to examine whether foraging behavior metrics, like grazing bout duration and velocity while grazing, predict diet quality and average daily weight gain of beef cows on central Arizona rangelands",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:41.735002+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Adaptation/Hydrology/Construction Management Fellowship",
    "organization": "MobilizeGreen (Private)",
    "location": "Washington, D.C.",
    "salary": "$800 per week",
    "starting_date": "after 6/22/2026",
    "published_date": "01/22/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=111819",
    "description": "Adaptation/Hydrology/Construction Management Fellowship\nMobilizeGreen (Private) | http://mobilizegreen.org\nDetails\nPosting:\nhttps://mobilizegreen.bamboohr.com/careers/910\nApplication Deadline:\n05/31/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 6/22/2026\nEnding Date:\nafter 12/18/2026\nHours per Week:\n40\nSalary:\n$800 per week\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\nWashington, D.C.\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nJoin us. Do work that matters!\n\nIn partnership with the US Fish & Wildlife Service, MobilizeGreen seeks Adaptation Fellows working on adaptation, hydrology, and/or construction management for the U.S. Fish & Wildlife Service. In general, Adaptation Fellows will support the Service’s goal of adapting to and mitigating contemporary ecological change by working collaboratively with partners, integrating nature-based solutions, and helping to infuse adaptation and resilience throughout management of Service trust resources.\n\nThis fellowship will be focused on adaptation, hydrology, and/or construction management. As a fellow, you will support efforts to adapt to rapid ecological change, restore habitat and hydrology, and maintain infrastructure on National Wildlife Refuge System lands. You will visit beautiful settings and engage in nature-based restoration projects, hydrologic and geomorphologic data collection and analysis, contract administration, construction oversight, and stakeholder collaboration.\n\nFellows will assist with infrastructure planning and inspection, technical engineering, and creating communication tools to promote adaptation and infrastructure maintenance. This position provides a unique opportunity to collaborate with multiple USFWS programs, including Refuges, Ecological Services, Science Applications, Fisheries, and the Partners for Fish and Wildlife Program. As a fellow, you will develop skills in hydrology, project management, and restoration science. This fellowship is designed for early-career professionals interested in adaptation and resilience, hydrology, construction management, and infrastructure maintenance.\n\nDuty Station and Location: Positions for the 2026 Maintenance and Infrastructure Fellowship Program (MIFP) cohort will be located at FWS refuges and offices across the country:\nSan Luis Valley NWR Complex - Alamosa, CO\nCheck out all open fellowship positions here\n\nTerm: 26 weeks (6 months), full-time (40 hours per week), on-site position. The fellowship is eligible for extension up to 3 years (36 months).\n\nAnticipated Start Date: June 2026\n\nBenefits:\nHands on learning and job training experience\nPaid orientation and travel to orientation\nMentorship for career and professional development\nWeekly living allowance ($800 per week)\nHousing\nRelocation assistance (if applicable)\nHealth insurance option\nPublic Lands Corps hiring eligibility (with successful completion of fellowship). Other authorities may apply.\n\nPosition Duties:\n\nSpecific Tasks Required May Include:\nFieldwork and Hydrology:\nInstalling and maintaining hydrologic monitoring equipment (e.g., staff gages, shallow groundwater wells, and water level recorders).\nConduct water quality sampling\nConducting topographic and bathymetric surveys\nMonitoring vegetation, elevation, and hydrology using established protocols and synthesizing data to assess project success\nAdaptation:\nWork as part of a Team to restore hydrology to salt marsh, freshwater wetlands, or other habitats depending on location.\nFacilitating cross-programmatic coordination to advance priority resiliency projects.\nDeveloping communication materials, and demonstration case studies to disseminate restoration methodology, and assist other projects.\nPreparing briefing materials and innovative content to communicate adaptation success stories.\nSupporting feasibility, design, and implementation of conservation projects that enhance ecological resilience.\nConstruction and Engineering Support:\nConducting site condition analyses, data collection, and instrumentation data analysis.\nPerforming limited engineering schematics or architectural designs for developmental assignments.\nParticipating in inspections, reviews, and evaluations of facilities and infrastructure.\nAssisting with project management, contract administration, compliance checks, and database operations.\nUsing remote sensing tools and data analysis software, to support project designs.\nPreparing drawings, permits, material testing, and documentation for projects.\n\nSpecific Tasks and Learning Goals:\nGain skills in hydrology, geomorphology, and nature-based restoration design, including data collection, analysis, and project design.\nDevelop expertise in surface water and groundwater monitoring, surveying, and tidal flow assessment.\nAcquire knowledge of construction management techniques, project management of in-house and contracted crew, and compliance reporting for a large-scale, multiple year restoration project.\nUnderstand how to integrate adaptation and nature-based engineering principles into wildlife conservation and infrastructure projects.\nBuild professional networks across USFWS, working with various stakeholders including contractors, States, Tribes, NGOs, and local governments.\nDevelop case studies, communication materials, intranet content, and other shared learning materials to promote the operationalization of science-based action.\nExperience cross-programmatic collaboration, project management, and collaborative team-based field operations.\n\nQualifications/Skills and Knowledge:\n\nRequired:\nDegree or coursework in environmental science, natural resources, environmental or adaptation science, hydrology, engineering, geoscience, biology, construction management, or related fields.\nStrong analytical, organizational, interpersonal, and problem-solving skills.\nEffective communication, teamwork, and independent work skills.\nWillingness to work outdoors in varying conditions and conduct physical tasks.\nAges 18-30 (or up to 35 for veterans).\nValid driver’s license.\nU.S. Citizen or Permanent Resident.\n\n\nPreferred:\nKnowledge of hydrologic monitoring, land surveying techniques, and construction management tools. \nExperience with GIS, data analysis, and nature-based solutions.\nFamiliarity with public lands management, environmental policy, and engineering practices.\nDemonstrated ability to develop case studies, technical materials, and success stories for different kinds of audiences.\nEffective written and verbal communication skills.\nDesire to drive adaptation and engineering solutions collaboratively.\nKnowledge and proficiency in operating and maintaining small-engine equipment.\n\nSpecific Requirements/Preferences:\nPhysical Requirements: Work involves both office and field tasks, with activities such as walking on rough terrain, carrying equipment (up to 40 lbs) over long distances, and working in variable weather conditions.\nPosition Environment: Duties are performed indoors and outdoors, often requiring travel to remote sites and exposure to temperature extremes, biting insects, ticks, and poison ivy.\n\nFor more information on MobilizeGreen go to: www.mobilizegreen.org\nContact\nMobilizeGreen\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Hours per Week:\n40\nSalary:\n$800 per week\nEducation Required:\nBachelors\nExperience Required:\nnone",
    "project_details": "You will visit beautiful settings and engage in nature-based restoration projects, hydrologic and geomorphologic data collection and analysis, contract administration, construction oversight, and stakeholder collaboration. As a fellow, you will develop skills in hydrology, project management, and restoration science. Conduct water quality sampling\nConducting topographic and bathymetric surveys\nMonitoring vegetation, elevation, and hydrology using established protocols and synthesizing data to assess project success\nAdaptation:\nWork as part of a Team to restore hydrology to salt marsh, freshwater wetlands, or other habitats depending on location",
    "contact_info": "",
    "application_deadline": "05/31/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 6/22/2026\nEnding Date:\nafter 12/18/2026\nHours per Week:\n40\nSalary:\n$800 per week\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\nWashington, D",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Fisheries & Aquatic Science",
    "discipline_confidence": 0.168,
    "discipline_keywords": [
      "fish",
      "fisheries",
      "freshwater",
      "river",
      "hydrology"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:42.347776+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Computational Plant Biology Fellowship",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Ames, Iowa",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 3/1/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112641",
    "description": "USDA-ARS Computational Plant Biology Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-MWA-2026-0012\nApplication Deadline:\n03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nAmes, Iowa\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Ames, Iowa.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: Many crop species have relatives that have also been domesticated, with selection independently being applied in the various species to modify traits such as seed size, dormancy, reduction of seed dispersal, changes in taste or toxic compounds, or changes in photoperiod sensitivity or plant architecture. Within the legume family, more than two dozen species have been domesticated, including plants such as pea, soybean, peanut, and common bean. The many related but independently domesticated species offer an opportunity to determine in which cases the domestications have occurred through modification of genetically corresponding (orthologous) genes, or via distinct, non-corresponding loci. This project will use a combination of analyses utilizing gene families, synteny relationships, genetic association results, and published gene functional information, to catalog and evaluate the genes involved in domestication in crops within the legume plant family. This research has applied value, through identification of genes that are likely to modify important domestication-related traits across many species. The research also addresses basic questions, such as whether domestication has preferentially operated on genes that have unusually high amounts of standing variation within wild populations.\n\nUnder the guidance of a mentor, this opportunity will involve: developing and applying methods in computational biology and artificial intelligence to gather information about gene function in the legume family; using the results to identify gene correspondences at several taxonomic levels – in particular, across genera, typically spanning several species of agronomic importance such as beans or chickpeas and also across the plant family as a whole; and to identify correspondences among agronomically important genes across many crop and model species in this large plant family. After identifying corresponding genes, genomic regions will be evaluated for features such as signatures of selection or diversifying or purifying selection, around genes and regions of agricultural importance.\n\nLearning Objectives: The participant will learn and apply methods in computational biology, genetics, and artificial intelligence, including statistical methods of marker-trait association, methods for determining syntenic relationships and for calculating and representing pan-genome relationships, methods for inferring gene families, and methods for inferring evolutionary events from large collections of gene families. The participant will also have the opportunity to read, evaluate, and participate in writing scientific manuscripts in these areas of focus.\n\nMentor(s): The mentor for this opportunity is Steven Cannon (Steven.Cannon@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: March 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $5,185 - $6,273 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Midwest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields. Degree must have been received within the past five years or anticipated to be received near start of appointment.\n\nPreferred skills:\n\nGraduate training in genetics and biology or computer science\nCoursework in statistics and computer science\nExperience with computer scripting languages and Unix command-line tools\nComputer programming and computational biology experience\nTraining or experience in plant biology\n  Contact\nUSDA-ARS-MWA-2026-0012\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Ames, Iowa. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nAmes, Iowa\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:42.558045+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postgraduate Fellowship in Rice Utilization and Cancer Prevention",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "New Orleans, Louisiana",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/1/2026",
    "published_date": "01/20/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112640",
    "description": "USDA-ARS Postgraduate Fellowship in Rice Utilization and Cancer Prevention\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-SEA-2026-0025\nApplication Deadline:\n03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\nNew Orleans, Louisiana\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location:  A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in New Orleans, Louisiana.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The participant will conduct research on the anticancer properties of rice and other plant-derived bioactive compounds. The project integrates analytical chemistry, natural products isolation, and cell-based bioassays to identify and characterize compounds that inhibit breast cancer cell growth and reduce reactive oxygen species (ROS) generation.\n\nThe participant will:\n\nAssess cytotoxicity and anticancer potential of plant extracts and purified compounds derived from rice, soybean, and sugarcane using breast cancer cell lines.\nEvaluate the ability of extracts and isolated bioactives to inhibit ROS formation and other stress-related pathways in cell-based models.\nCollaborate with chemists to perform bioassay-guided fractionation to isolate, purify, and characterize active compounds.\nThe participant’s research will directly support efforts to identify novel phytochemicals from rice and rice by-products. Current extracts from whole rice, rice bran, and rice hulls will be evaluated for biological activity, followed by purification and structural characterization of active components. This research also includes screening individual phytochemicals and extracts from additional plant materials to determine their anticancer and antioxidant activities.\n\nLearning Objectives: The participant will receive extensive training in cell-based methods relevant to evaluating anticancer properties of natural products. Collaborating as part of a multidisciplinary team, the participant will gain experience in:\n\nMammalian cell culture and viability assays, including maintenance of cancer cell lines, execution of cytotoxicity assays, and quantification of growth inhibition.\nMechanistic cell-based assays, including measurement of oxidative stress, reactive oxygen species (ROS) modulation, apoptosis markers, and other pathways affected by bioactive compounds.\nAnalytical chemistry techniques for screening and characterizing phytochemicals, including extract preparation, chromatography, and bioassay-guided fractionation in collaboration with chemists.\nData analysis and interpretation, including statistical evaluation of dose–response effects, comparison of extract fractions, and integration of biological and chemical datasets.\nScientific communication and collaboration, including preparation of manuscripts, presentation of research findings, and coordination with researchers at Tulane University’s cancer biology laboratories.\nThis training will prepare the participant for independent research careers in natural products chemistry, cancer biology, molecular pharmacology, or related biomedical fields.\n\nMentor(s): The mentor for this opportunity is Stephen Boue (steve.boue@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: February 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $36,000 - $43,000 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Southeast@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received a bachelor's or master's degree in one of the relevant fields. Degree must have been received within the past four years.\n\nPreferred Skills:\n\nKnowledge of basic biochemistry and molecular biology lab techniques\nBackground in mammalian cell culture, including maintaining breast cancer cell lines and performing cell viability, cytotoxicity, and oxidative stress assays.\nExperience with biochemical and molecular biology techniques, such as qPCR, Western blotting, colony formation assay, cell imaging, and apoptosis/ROS assays.\nFamiliarity with natural products chemistry or phytochemical analysis, including extract preparation, chromatographic separation, or bioassay-guided fractionation.\nExperience analyzing complex biological data, including dose–response modeling, statistical comparisons of treatment effects, and integration of chemical and biological datasets.\nNote: This project is highly multidisciplinary and involves cancer cell biology, analytical chemistry, and natural products research. Expertise in all preferred skills is not expected. Candidates with strong foundational training in any relevant area such as cell biology, biochemistry, molecular biology, pharmacology, or phytochemical analysis are encouraged to apply. Training will be provided in specialized methods. \n\nContact\nUSDA-ARS-SEA-2026-0025\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location:  A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in New Orleans, Louisiana. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\nNew Orleans, Louisiana\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:42.663668+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Hemp Genetics Research Fellowship",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Geneva, New York",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 5/4/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments, Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112636",
    "description": "USDA-ARS Hemp Genetics Research Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-NEA-2026-0024\nApplication Deadline:\n03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 5/4/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nGeneva, New York\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Geneva, New York.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nThe USDA - ARS, Plant Genetic Resources Unit (PGRU), located on the Geneva, NY Campus of Cornell University, is a component of the National Plant Germplasm System (NPGS). The PGRU was formed in 1986 by merging the Northeast Regional Plant Introduction Station (NERPIS) and the National Clonal Germplasm Repository for Apple, Tart Cherry and Grape (NGR). The two missions of the PGRU are the preservation of germplasm of selected crop plants and the breeding and improvement of apples.  Specific activities include acquisition, documentation, maintenance, characterization, breeding, enhancement and distribution of the assigned crops.  PGRU maintains approximately 20,000 different accessions, representing over 300 species. \n\nhttps://www.ars.usda.gov/northeast-area/geneva-ny/plant-genetic-resources-unit-pgru/docs/about-pgru/\n\nResearch Project: Participants will have the opportunity to explore genetic variation and investigate the mechanisms underlying key agronomic and disease-related traits across multiple crop species. Research will focus on hemp, onion, tomato, squash, apples, cherries, and grapes, with evaluations conducted in laboratory, greenhouse, and field environments. One project will investigate the collection and storage of hemp pollen. \n\nLearning Objectives: Throughout the project, participants will gain hands-on experience and foundational knowledge in:\n\nUSDA plant germplasm collections\nPlant phenomics and genomics\nAnalytical chemistry techniques\nPlant propagation and tissue culture techniques\nMentor(s): The mentors for this opportunity are Zach Stansell (zachary.stansell@usda.gov), and Tyler Gordon (tyler.gordon@usda.gov). If you have questions about the nature of the research, please contact the mentors.\n\nAnticipated Appointment Start Date: May 4, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $41,021 - $75,202 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Northeast@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received or be currently pursuing a bachelor's, master's, or doctoral degree in the one of the relevant fields.\n\nPreferred skills:\n\nPrevious experience with plants in a lab, greenhouse, and field would be beneficial.\n  Contact\nUSDA-ARS-NEA-2026-0024\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Hemp Genetics Research Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Geneva, New York",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 5/4/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nGeneva, New York\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:42.782091+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Food Animal Metabolism Research Unit Fellowship",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Fargo, North Dakota",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 6/1/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112635",
    "description": "USDA-ARS Food Animal Metabolism Research Unit Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0010\nApplication Deadline:\n03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 6/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nFargo, North Dakota\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Fargo, North Dakota.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The fellow will be in in the Food Animal Metabolism Research Unit (FAMRU), Edward T. Schafer Agricultural Research Center, Fargo, ND. The mission of FAMRU is to investigate the fate of chemicals in food animals or food animal systems and to apply this knowledge to maintain a safer food supply. The fellow's research supports the mission and goals of ARS National Program 108, Food Safety (100%).\n\nThe candidate will be a part of development of sustainable technologies that solve perfluorinated alkyl substances (PFAS) contamination in complex environmental and food animal matrices. The candidate will also be a part of identification of drug metabolites in food animals and synthesize and characterize labeled/unlabeled compounds. The fellow will collaborate with the team members on the development of high throughput analytical methods for target compounds and investigation of the fate of target chemicals in vitro and live food animals. \n\nLearning Objectives: The candidate will receive comprehensive, multidisciplinary training in analytical, environmental, and synthetic chemistry, with a focus on PFAS remediation and the identification of drug metabolites in biological samples—a critical area of research supported by industrial, governmental, and academic laboratories worldwide. The candidate will have opportunities for scientific writing and publishing ARS research in peer-reviewed journals. This role will help advance knowledge and expertise in addressing real-world challenges in the US agricultural field. \n\nMentor(s): The mentor for this opportunity is Anu Singh (Anuradha.Singh@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: June 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend is $89,508 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields (e.g. chemistry [inorganic/organic/medicinal/analytical], biochemistry, pharmacology or a closely related field). Degree must have been received within the past four years, or anticipated to be received by 5/15/2026.\n\nPreferred skills:\n\nKnowledge of catalysis with synthetic and purification skills including but not limited to crystallization, distillation, and chromatography, qualitative and quantitative mass spectrometry, 1D and 2D NMR, and various other spectroscopies/methods are highly desirable.\nCandidates with experience handling biological samples are preferred\n  Contact\nUSDA-ARS-HQ-2026-0010\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Food Animal Metabolism Research Unit Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Fargo, North Dakota",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 6/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nFargo, North Dakota\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:42.881837+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postharvest Research Fellowship",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Parlier, California",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/1/2026",
    "published_date": "01/20/2026",
    "tags": "Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112632",
    "description": "USDA-ARS Postharvest Research Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-PWA-2026-0011\nApplication Deadline:\n03/13/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nParlier, California\nTags:\nUndergraduate Opportunities\nDescription\n*Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Parlier, California.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The selectee will participate in research to identify and quantify agrochemicals, including postharvest fumigants, pesticides and chemical markers of quality, in horticultural commodities and the environment using advanced analytical chemistry techniques such as chromatography (gas, liquid and ion), mass spectrometry, and capillary electrophoresis.\n\nLearning Objectives: \n\nBecome familiar with the collection, extraction and analysis of horticultural samples\nDevelop skills in the following techniques: QuEChERs, SPE, and SPME.\nBe trained in the following analytical technologies: LC-MS, GC-MS, CE and TXRF\nLearn how to perform basic statistical analyses and summarize data sets\nLearn about conducting research on the post-harvest of horticultural commodities\nMentor(s): The mentor for this opportunity is Wiley Hall IV (wiley.hall@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $3,109 monthly. A health insurance supplement will be included.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.PacificWest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a bachelor's degree in the one of the relevant fields. \n\nContact\nUSDA-ARS-PWA-2026-0011\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Postharvest Research Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Parlier, California",
    "contact_info": "",
    "application_deadline": "03/13/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nParlier, California\nTags:\nUndergraduate Opportunities\nDescription\n*Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.082827+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postdoctoral Fellowship in Insect Molecular Biology",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Maricopa, Arizona",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/30/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112628",
    "description": "USDA-ARS Postdoctoral Fellowship in Insect Molecular Biology\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-PWA-2026-0007\nApplication Deadline:\n03/13/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 4/30/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nMaricopa, Arizona\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Maricopa, Arizona.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: A research opportunity is available for a motivated postdoctoral fellow interested in applying contemporary functional genomics approaches (CRISPR, RNAi, transgenics, omics, etc.) in cotton insect pests. Projects are focused on genetic-based sterilization techniques and elucidating the molecular factors critical for resistance to Bacillus thuringiensis (Bt) toxins/crops. In both cases, an interest in the potential application of arthropod gene-drive systems and their application in agricultural pest systems is highly desirable.\n\nLearning Objectives: The overall research goal of the group is to develop new pest management strategies that can augment and enhance current approaches. As such, we seek applicants interested in contributing to an environment that values creative thinking and finding innovative solutions to unconventional problems. By collaborating closely with members of our interdisciplinary research team, the successful applicant will gain invaluable hands-on experience to all phases of the research process. This includes opportunities in:\n\nElucidating molecular mechanisms/pathways driving biology in non-model insect pests\nExpanding skills and practical knowledge of experimental design and data analysis\nRefining micro- and nano-injection systems for specific developmental stages\nDesigning and constructing vectors, guide RNAs, and double-stranded RNAs  \nApplying and adapting genetic manipulation methodologies and/or methods from published literature to new insect systems\nManaging and interpreting experimental data\nPreparing manuscripts and presenting at professional meetings\nThis comprehensive training opportunity will prepare the successful applicant for future research opportunities and careers in the research field. Previous postdoctoral fellows have matriculated to positions within private industry and government research.\n\nMentor(s): The mentor for this opportunity is Jimmy Hull (joe.hull@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: April 30, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $60,000 - $65,000 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.PacificWest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields, preferably anticipated to be received by spring 2026.\n\nPreferred skills:\n\nExperience with insect transgenesis, embryonic microinjections, CRISPR/Cas9 gene editing, and/or insect sex differentiation\n  Contact\nUSDA-ARS-PWA-2026-0007\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Maricopa, Arizona. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/13/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 4/30/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nMaricopa, Arizona\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.182775+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postdoctoral Fellow in Honey Bee Health and Biotechnology",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Davis, California",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 3/1/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112634",
    "description": "USDA-ARS Postdoctoral Fellow in Honey Bee Health and Biotechnology\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0014\nApplication Deadline:\n03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nDavis, California\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Davis, California.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The Pollinator Health Research Unit is seeking a highly motivated postdoctoral fellow to apply biotechnological approaches to improve the health and resilience of managed honey bees. The successful candidate will contribute to research projects focused on the development of novel therapeutics and the discovery of bioactive compounds that mitigate major stressors affecting honey bees, including parasites and pathogens.\n\nResearch activities will involve the application of molecular and cellular biology, biotechnology, and chemical biology to honey bee health challenges. Projects include therapeutic development and mechanistic studies to understand host–pathogen interactions. The fellowship will include laboratory-based research using modern molecular and biochemical techniques. Some field research may be required and will involve handling managed honey bee colonies.\n\nThe postdoctoral fellow will perform both independently and collaboratively within a multidisciplinary research team, contribute to experimental design and data analysis, publish findings in peer-reviewed journals, and participate in the communication of results to scientific and stakeholder audiences. \n\nLearning Objectives: This fellowship provides opportunities to develop an independent research profile while contributing to applied solutions for improving pollinator health. Through this fellowship, the successful applicant will gain hands-on experience and develop expertise in both laboratory and applied beekeeping research. The participant will have the opportunity to learn and refine skills in the following areas:\n\nField and Laboratory Study Setup and Maintenance: The fellow will learn how to design, set up, and maintain field and laboratory experiments, gaining practical experience in managing research projects.\nHoney Bee Sample Collection and Analysis: The participant will be trained in the collection, processing, and analysis of honey bee samples using microbiological, molecular biological, and chemical methods. This includes characterizing and quantification of pathogens and beneficial microbes, which are critical components of honey bee health research.\nPreparation of Laboratory Materials: The fellow will learn to prepare test solutions, culture media, and reagents, ensuring proper laboratory protocols and procedures are followed.\nSafe Handling of Laboratory Materials: Training will include proper labeling, handling, storage, use, and disposal of solutions, biohazard and hazardous waste, and microbiological cultures, emphasizing laboratory safety and compliance.\nData Documentation and Record-Keeping: The participant will develop skills in maintaining accurate records using a laboratory notebook, learning best practices for data documentation and management.\nSummarizing and Interpreting Research Results: The fellow will gain experience in analyzing and interpreting research findings, contributing to scientific understanding and advancing their ability to communicate results effectively.\nThrough these activities, the fellow will expand their knowledge and skill set in honey bee biology, biotechnology, microbiology, molecular biology, and data collection and analysis. This comprehensive training will prepare them for future research opportunities and careers in honey bee research and agricultural sciences.\nMentor(s): The mentor for this opportunity is Vincent Ricigliano (vincent.ricigliano@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: Preferably March 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend is $98,236 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received or be currently pursuing a doctoral degree in one of the relevant fields.\n\nPreferred skills:\n\nExperience in at least one of the following areas: biotechnology, molecular biology, microbiology, apiculture, biochemistry \n\nContact\nUSDA-ARS-HQ-2026-0014\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Davis, California. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nDavis, California\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.471131+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Assistant Professor in Wildlife Ecology & Management",
    "organization": "Utah State University (State)",
    "location": "320 N. Aggie Blvd (vernal, Utah)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 8/1/2026",
    "published_date": "01/22/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112720",
    "description": "Assistant Professor in Wildlife Ecology & Management\nUtah State University (State) | https://careers-usu.icims.com/jobs/9834/assistant-professor-in-wildlife-ecology-%26-management/job\nDetails\nPosting:\nhttps://careers-usu.icims.com/jobs/9834/assistant-professor-in-wildlife-ecology-%26-management/job\nApplication Deadline:\n04/01/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 8/1/2026\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\n320 N. Aggie Blvd (vernal, Utah)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nOverview\n\nThe Department of Wildland Resources at Utah State University seeks applicants for a full-time, nine-month tenure track faculty position as an Assistant Professor in Wildlife Ecology and Management. We are seeking a scholar dedicated to educating undergraduate students in wildlife science and related natural resource fields. The position will be 90% teaching and 10% service, and will be located at Utah State University’s Uintah Basin Regional Campus located in Vernal, Utah. The anticipated (negotiable) start date is August 1, 2026.\n The incumbent will be a member of USU’s Department of Wildland Resources (WILD), which is part of the S.J. and Jessie E. Quinney College of Agriculture & Natural Resources. WILD is home to the Berryman Institute, which is dedicated to improving human-wildlife interactions, and is the administrative home of the Utah USGS Cooperative Fish & Wildlife Research Unit. The department collaborates closely with the Utah Division of Wildlife Resources, the USDA-APHIS National Wildlife Research Center’s Utah Station, USU’s Ecology Center, and other agencies and organizations.\n Applications received by the initial screening date of February 3, 2026 will receive priority consideration; the position will remain open until filled.\n Potential applicants with specific questions are welcome to contact the search committee chair, Sunshine Brosi at sunshine.brosi@usu.edu.\n\nResponsibilities\n\nThe incumbent will teach a variety of wildlife science courses. Courses taught are expected to be mostly at the undergraduate level, but graduate courses may occasionally be needed. Courses may be taught face-to-face, online, broadcast, or in a hybrid format. Courses will primarily serve students living and working in the Uintah Basin campus, but some courses will also serve students at USU’s main campus in Logan. The candidate will coordinate course offerings with faculty at the USU Eastern campus in Price, Utah, where our Wildlife Ecology & Management degree is also offered. If desired, it may be possible to teach classes in the summer for additional compensation.\n The successful candidate will serve as the department's representative at the Uintah Basin Regional Campus, teaching, coordinating, and advocating for our Wildlife Ecology & Management major and Wildlife Science minor, while also contributing to our other programs as needed. This individual will mentor and advise undergraduate students from diverse backgrounds. They will interact with administrators, faculty, staff, and others at their home campus in Vernal, with our faculty member at USU Eastern in Price, and at the main campus in Logan to continue our established and successful program by coordinating the provision of courses needed by local students and coordinating the financial, scholarship, and other resources available for the wildlife program and other programs in the Uintah Basin. They will maintain and cultivate existing contacts with local offices of land management agencies such as the Utah Division of Wildlife Resources, the Bureau of Land Management, the U.S. Forest Service, and the Bureau of Indian Affairs, for enrichment activities like field trips for students, for possible internships while the students are in school, and eventually for career positions for graduates.\n Although research is not officially part of this position, some research opportunities exist, particularly by working with the local land management agencies and during the summer. If desired, and if funding is available, the candidate may advise a graduate student. The candidate may serve on graduate student committees.\n\nQualifications\n\nMinimum Qualifications\nPh.D. in a wildlife-related field; individuals will be considered to have met this requirement if they have successfully defended their dissertation, with just editorial work remaining.\nEvidence of successful college or university teaching experience.\nDemonstrated ability to articulate natural resource science within and outside the classroom to broad audiences.\nPreferred Qualifications\nHave prepared and taught entire courses on their own.\nPossess teaching experience using more than one delivery method.\nDemonstrate the ability to work productively with land management agencies and various stakeholder groups.\nHave postdoctoral experience, especially with teaching experience included.\n\nRequired Documents\n\nAlong with the online application, please attach:\n1. Resume/CV to be uploaded at the beginning of your application in the Candidate Profile under “Resume/CV\" \n2. Teaching statement that covers teaching experience and philosophy (3-page maximum) to be uploaded at the beginning of your application in the Candidate Profile under “Documents 1-10” \n3. Name and contact information for 3 professional references to be entered into Candidate Profile\n4. Cover letter to be typed/pasted at the end of your application \n **Document size may not exceed 10 MB.**\n\nAdvertised Salary\n\nCommensurate with experience, plus excellent benefits\nContact\nSunshine Brosi\n435-613-5016\nsunshine.brosi@usu.edu (preferred contact method)",
    "requirements": "Hours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone",
    "project_details": "WILD is home to the Berryman Institute, which is dedicated to improving human-wildlife interactions, and is the administrative home of the Utah USGS Cooperative Fish & Wildlife Research Unit. The department collaborates closely with the Utah Division of Wildlife Resources, the USDA-APHIS National Wildlife Research Center’s Utah Station, USU’s Ecology Center, and other agencies and organizations. Although research is not officially part of this position, some research opportunities exist, particularly by working with the local land management agencies and during the summer",
    "contact_info": "",
    "application_deadline": "04/01/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 8/1/2026\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\n320 N",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.34,
    "discipline_keywords": [
      "natural resources",
      "land management",
      "bureau of land management",
      "forest service",
      "agriculture"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.572967+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Research Associate Position in Soil Science and Microbiology",
    "organization": "University of Texas at San Antonio (State)",
    "location": "1 UTSA Circle (San Antonio, Texas)",
    "salary": "$40,000 to $50,000 per year",
    "starting_date": "after 5/1/2026",
    "published_date": "01/23/2026",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112805",
    "description": "Research Associate Position in Soil Science and Microbiology\nUniversity of Texas at San Antonio (State)\nDetails\nPosting:\nhttps://www.veachlaboratory.com\nApplication Deadline:\n03/31/2026\nPublished:\n01/23/2026\nStarting Date:\nafter 5/1/2026\nEnding Date:\nafter 12/31/2027\nHours per Week:\nat least 40\nSalary:\n$40,000 to $50,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\n1 UTSA Circle (San Antonio, Texas)\nDescription\nThe Microbial Ecology Lab at the University of Texas at San Antonio is accepting applications for a post-gradate research associate to join our group in the Department of Biology, Health, and the Environment. The position start date is summer 2026.\n The applicant will be working with Dr. Allison Veach and other collaborators through the United States Department of Agriculture Natural Resources Conservation Service (USDA-NRCS) in San Antonio, Texas USA with field sites spanning urban - rangeland - grasslands in central Texas. Project goals are to use novel, field-based methods to identify fungal and bacterial biomass across soils and relate field counts to validated laboratory estimates. The applicant will lead microscopy research to estimate fungal hyphae in soil, collaborate with other graduate and undergraduate researchers, and provide oversight in laboratory maintenance. This position includes 20% time lab management and 80% research.\n This position is funded for 1 year and can be extended into 2 years based on performance. Health care and benefits are included. UTSA is a public research university and a Hispanic-Serving Institution located in northwest San Antonio. The main campus, where this position will be housed, enrolls ~35,000 students, has a diverse set of faculty and students in environmental science, microbiology and microbial ecology, geosciences, and ecology.\n Qualifications: \n·       Master’s degree in Biology, Ecology, or similar discipline. PhD is preferred but not required.\n·       Experience with microscopy and working with soils\n·       Additional laboratory experience in molecular biology\n·       Strong writing and communication skills\n Application Process: Please email a compiled PDF that includes (1) a cover letter highlighting applicants interest and experiences, (2) CV and (3) three names of profession references to Dr. Allison Veach at allison.veach@utsa.edu. Review of applications will begin immediately and remain open until the position is filled. Please contact Dr. Veach with any questions pertaining to this position.\nContact\nAllison Veach\nallison.veach@utsa.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat least 40\nSalary:\n$40,000 to $50,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years",
    "project_details": "Research Associate Position in Soil Science and Microbiology\nUniversity of Texas at San Antonio (State)\nDetails\nPosting:\nhttps://www. com\nApplication Deadline:\n03/31/2026\nPublished:\n01/23/2026\nStarting Date:\nafter 5/1/2026\nEnding Date:\nafter 12/31/2027\nHours per Week:\nat least 40\nSalary:\n$40,000 to $50,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\n1 UTSA Circle (San Antonio, Texas)\nDescription\nThe Microbial Ecology Lab at the University of Texas at San Antonio is accepting applications for a post-gradate research associate to join our group in the Department of Biology, Health, and the Environment. The applicant will lead microscopy research to estimate fungal hyphae in soil, collaborate with other graduate and undergraduate researchers, and provide oversight in laboratory maintenance",
    "contact_info": "",
    "application_deadline": "03/31/2026\nPublished:\n01/23/2026\nStarting Date:\nafter 5/1/2026\nEnding Date:\nafter 12/31/2027\nHours per Week:\nat least 40\nSalary:\n$40,000 to $50,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\n1 UTSA Circle (San Antonio, Texas)\nDescription\nThe Microbial Ecology Lab at the University of Texas at San Antonio is accepting applications for a post-gradate research associate to join our group in the Department of Biology, Health, and the Environment",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.867090+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Wildlife Lecturer",
    "organization": "Cal Poly Humboldt (State)",
    "location": "Cal Poly Humboldt (Arcata, California)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 8/17/2026",
    "published_date": "01/23/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=109287",
    "description": "Wildlife Lecturer\nCal Poly Humboldt (State)\nDetails\nPosting:\nhttps://hum.link/Z6A\nApplication Deadline:\n05/01/2026\nPublished:\n01/23/2026\nStarting Date:\nafter 8/17/2026\nEnding Date:\nafter 12/18/2026\nHours per Week:\nat most 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nCal Poly Humboldt (Arcata, California)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nLecturer Positions in Wildlife Program\n\nThe Department of Wildlife Management at Cal Poly Humboldt invites applicants to our temporary faculty (lecturer) pool. Initial appointment will be for the Fall 2026 semester. Subsequent reappointments will be contingent upon satisfactory performance evaluations, budget, and programmatic need for Spring 2027. Dependent upon the qualifications, course assignments may be up to full-time base. Potential course topics include: conservation biology, management of vertebrate species, management of habitats, wildlife diseases, animal behavior, spatial ecology, senior seminar, or senior project (capstone).  To learn more about the department, please visit our website and to see full listing of course offerings see here to identify all courses of interest as there is some flexibility with currently covered teaching assignments. \n QUALIFICATIONS: PhD (or ABD) in Wildlife or a related field from an accredited college. Candidates must have demonstrated topical expertise in the subject area and/or demonstrated teaching experience at the university or collegial level.\n\nSALARY: See information on website\n\nAPPLICATION: Qualified candidates should submit the following materials through PageUp application portal: \n\nLetter of Application; \nCurriculum Vitae; \nTeaching Evaluations, if available; and \nNames and Contact Information for Three (3) Professional References. \n\nQuestions may be directed to: Barbara Clucas – barbara.clucas@humboldt.edu\n\nAPPLICATION DEADLINE: These positions are open as needed. Early response is encouraged. \n\n\n\nContact\nBarbara Clucas\n707-826-5651\nbarbara.clucas@humboldt.edu (preferred contact method)",
    "requirements": "Lecturer Positions in Wildlife Program\n\nThe Department of Wildlife Management at Cal Poly Humboldt invites applicants to our temporary faculty (lecturer) pool. Initial appointment will be for the Fall 2026 semester. Subsequent reappointments will be contingent upon satisfactory performance evaluations, budget, and programmatic need for Spring 2027. Dependent upon the qualifications, course assignments may be up to full-time base. Potential course topics include: conservation biology, management of vertebrate species, management of habitats, wildlife diseases, animal behavior, spatial ecology, senior seminar, or senior project (capstone).  To learn more about the department, please visit our website and to see full listing of course offerings see here to identify all courses of interest as there is some flexibility with currently covered teaching assignments. \n QUALIFICATIONS: PhD (or ABD) in Wildlife or a related field from an accredited college. Candidates must have demonstrated topical expertise in the subject area and/or demonstrated teaching experience at the university or collegial level.\n\nSALARY: See information on website\n\nAPPLICATION: Qualified candidates should submit the following materials through PageUp application portal: \n\nLetter of Application; \nCurriculum Vitae; \nTeaching Evaluations, if available; and \nNames and Contact Information for Three (3) Professional References. \n\nQuestions may be directed to: Barbara Clucas – barbara.clucas@humboldt.edu\n\nAPPLICATION DEADLINE: These positions are open as needed. Early response is encouraged.",
    "project_details": "Potential course topics include: conservation biology, management of vertebrate species, management of habitats, wildlife diseases, animal behavior, spatial ecology, senior seminar, or senior project (capstone)",
    "contact_info": "",
    "application_deadline": "05/01/2026\nPublished:\n01/23/2026\nStarting Date:\nafter 8/17/2026\nEnding Date:\nafter 12/18/2026\nHours per Week:\nat most 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nCal Poly Humboldt (Arcata, California)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nLecturer Positions in Wildlife Program\n\nThe Department of Wildlife Management at Cal Poly Humboldt invites applicants to our temporary faculty (lecturer) pool",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.306,
    "discipline_keywords": [
      "wildlife",
      "wildlife management",
      "behavior",
      "animal behavior",
      "wildlife disease"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:43.963111+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Student Contractors: Biological Science Technicians",
    "organization": "USGS (Federal)",
    "location": "Sequoia Kings Canyon Field Station (Three Rivers, California)",
    "salary": "$16.73 to $26.03 per hour",
    "starting_date": "after 4/20/2026",
    "published_date": "01/22/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112717",
    "description": "Student Contractors: Biological Science Technicians\nUSGS (Federal)\nDetails\nApplication Deadline:\n03/30/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 4/20/2026\nEnding Date:\nafter 9/30/2026\nHours per Week:\nat least 40\nSalary:\n$16.73 to $26.03 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nSequoia Kings Canyon Field Station (Three Rivers, California)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n \n\nStudent Contractors \nBiological Science Technicians \n \nThe Western Ecological Research Center (WERC) of the USGS has an immediate opening for eight student interns or recent graduates (within the past year) to work as part of a team collecting forest data in the Sierra Nevada. Six students will be crew members and two will be crew leaders. \n\nThe students will be participating in a team effort to collect forest health, fire, and fuels data. Duties include measuring tree diameters and heights, recording fuels, mapping trees, and identifying insects and diseases in order to conduct tree mortality assessments. An interest in natural resources, experience hiking (backpacking experience strongly preferred), strong interpersonal and communication skills, and the ability to collect forest health, fire, and fuels data are required. Crew lead positions will require prior leadership experience and will have the additional responsibilities of crew safety, protocol training, field logistics, and compiling/processing data.  \n\nWork will primarily be performed in the field. Locations include Sequoia National Park, Yosemite National Park, and surrounding National Forest Service land. Elevations range from approximately 5,000 – 12,000 feet. Crews will typically work four 10-hour days per week, although they may be required to work as many as eight days consecutively to accommodate trips into the wilderness. Field sites are in front country and back country locations with off trail travel and some backpacking required. Conditions will be variable, and crews will work in challenging conditions including burn areas, heat, cold, shrub fields, biting insects, and high elevation. Work will be conducted from May through September with the potential for flexibility based on students’ schedules.  \n These are paid student contractor positions. The level of education required is at least 1 year of college. Compensation is commensurate with the role and level of responsibility of the position on the team, ranging from approximately $16.73 (1 year of college) for basic crew work to $26.03 (recent BA/BS or MA/MS graduates) for an independent crew lead.  \n Duration of work will be for up to one year, with an estimated starting date of 5/18/2026 for crew members and 4/20/2026 for crew leads.  \n The people selected will be based out of the Sequoia Kings Canyon Field station in Three Rivers, CA.  \n Please send cover letter, resume, transcripts and list of relevant courses by February 15, 2026 to: \n Nicholas Ampersee \nUSGS WERC \nSequoia Kings Canyon Field Station \n47050 Generals Hwy \nThree Rivers, CA 93271 \nnampersee@usgs.gov \n\nContact\nNick Ampersee\n5595653175\nnampersee@usgs.gov (preferred contact method)",
    "requirements": "Hours per Week:\nat least 40\nSalary:\n$16.73 to $26.03 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "03 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nSequoia Kings Canyon Field Station (Three Rivers, California)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n \n\nStudent Contractors \nBiological Science Technicians \n \nThe Western Ecological Research Center (WERC) of the USGS has an immediate opening for eight student interns or recent graduates (within the past year) to work as part of a team collecting forest data in the Sierra Nevada",
    "contact_info": "",
    "application_deadline": "03/30/2026\nPublished:\n01/22/2026\nStarting Date:\nafter 4/20/2026\nEnding Date:\nafter 9/30/2026\nHours per Week:\nat least 40\nSalary:\n$16",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.185,
    "discipline_keywords": [
      "natural resources",
      "national forest",
      "forest service"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:44.165928+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "Spatial Analyst Postdoctoral Scholar",
    "organization": "New Mexico Highlands University (State)",
    "location": "remote work allowed",
    "salary": "$65,000 to $75,000 per year",
    "starting_date": "after 2/27/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112644",
    "description": "Spatial Analyst Postdoctoral Scholar\nNew Mexico Highlands University (State) | https://www.nmhu.edu/\nDetails\nPosting:\nhttps://www.paycomonline.net/v4/ats/web.php/portal/2881FFE43C19E2921F626A9C2B366153/jobs/192067\nApplication Deadline:\n01/30/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/27/2026\nEnding Date:\nafter 2/25/2028\nHours per Week:\n40\nSalary:\n$65,000 to $75,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nremote work allowed\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe New Mexico Forest and Watershed Restoration Institute at NM Highlands University is seeking a Spatial Analyst Postdoctoral Scholar with expertise in fire modeling and remote sensing to support the collaborative ReSHAPE project (http://reshapewildfire.org/). This critical research will improve our understanding of how fuel treatments affect wildfire behavior.\n \nThis is a 2-year, grant-funded position with hybrid/remote work options. You will be mentored by experienced GIS professionals and have ample opportunities for professional development.\n\nSalary: $65,000 – $75,000 dependent on qualifications\n\n\n Key Responsibilities:\n\n·        Big Data Analytics: Process large-scale remote sensing datasets (Landsat, Sentinel-2) utilizing R, Python, and Google Earth Engine.\n\n·        Modeling: Machine learning (e.g., Random Forest, CART), structural causal modeling, and Bayesian multilevel modeling to derive ecological insights from big data sets.\n\n·        Innovation: Develop reproducible, scalable methodologies that bridge the gap between data and land management decisions.\n\n·        Dissemination: Publish findings in peer-reviewed journals and present at national conferences.\n\n·        Collaboration: Travel to project meetings, collaborate with SWERI (https://sweri.org/) team members in support of the broader ReSHAPE mission.\n\nQualifications & Requirements\n\n·        PhD in Geospatial Science, Ecology, Forestry, or a related field.\n\n·        Expertise in fire modeling and remote sensing.\n\n·        Proficiency in coding for spatial analysis (GEE, R, or Python).\n\n·        Cloud Computing experience\n\nFor more information and to apply visit: https://www.paycomonline.net/v4/ats/web.php/portal/2881FFE43C19E2921F626A9C2B366153/jobs/192067\n\nContact\nPatti Dappen\nprdappen@nmhu.edu (preferred contact method)",
    "requirements": "The New Mexico Forest and Watershed Restoration Institute at NM Highlands University is seeking a Spatial Analyst Postdoctoral Scholar with expertise in fire modeling and remote sensing to support the collaborative ReSHAPE project (http://reshapewildfire.org/). This critical research will improve our understanding of how fuel treatments affect wildfire behavior.\n \nThis is a 2-year, grant-funded position with hybrid/remote work options. You will be mentored by experienced GIS professionals and have ample opportunities for professional development.\n\nSalary: $65,000 – $75,000 dependent on qualifications\n\n\n Key Responsibilities:\n\n·        Big Data Analytics: Process large-scale remote sensing datasets (Landsat, Sentinel-2) utilizing R, Python, and Google Earth Engine.\n\n·        Modeling: Machine learning (e.g., Random Forest, CART), structural causal modeling, and Bayesian multilevel modeling to derive ecological insights from big data sets.\n\n·        Innovation: Develop reproducible, scalable methodologies that bridge the gap between data and land management decisions.\n\n·        Dissemination: Publish findings in peer-reviewed journals and present at national conferences.\n\n·        Collaboration: Travel to project meetings, collaborate with SWERI (https://sweri.org/) team members in support of the broader ReSHAPE mission.\n\nQualifications & Requirements\n\n·        PhD in Geospatial Science, Ecology, Forestry, or a related field.\n\n·        Expertise in fire modeling and remote sensing.\n\n·        Proficiency in coding for spatial analysis (GEE, R, or Python).\n\n·        Cloud Computing experience\n\nFor more information and to apply visit: https://www.paycomonline.net/v4/ats/web.php/portal/2881FFE43C19E2921F626A9C2B366153/jobs/192067",
    "project_details": "This critical research will improve our understanding of how fuel treatments affect wildfire behavior",
    "contact_info": "",
    "application_deadline": "01/30/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/27/2026\nEnding Date:\nafter 2/25/2028\nHours per Week:\n40\nSalary:\n$65,000 to $75,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nremote work allowed\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe New Mexico Forest and Watershed Restoration Institute at NM Highlands University is seeking a Spatial Analyst Postdoctoral Scholar with expertise in fire modeling and remote sensing to support the collaborative ReSHAPE project (http://reshapewildfire",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:44.262003+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Seasonal Student Trainee Measuring Plant Response to Abiotic Production Factors",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Beltsville, Maryland",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 5/1/2026",
    "published_date": "01/20/2026",
    "tags": "Faculty / Post-Doc Appointments, Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112638",
    "description": "USDA-ARS Seasonal Student Trainee Measuring Plant Response to Abiotic Production Factors\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-NEA-2026-0018\nApplication Deadline:\n04/24/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 5/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nBeltsville, Maryland\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n*Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Beltsville, Maryland.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nThe Adaptive Cropping Systems Laboratory (ACSL) at the USDA-ARS Beltsville Agricultural Research Center (BARC) in Beltsville, Maryland conducts integrated experimental and modeling research to understand how crops respond to key abiotic factors such as weather, soil conditions, and management practices. Our team designs and carries out controlled experiments and develops, validates, and applies advanced mathematical models to investigate a wide range of agricultural challenges, including the impacts of extreme weather on crop production, land suitability assessment, food security, on-farm resource management, and farmer competitiveness.\n\nResearch Project: Students will participate in seasonal controlled-environment experiments (e.g., greenhouses and growth chambers) aimed at improving our understanding of how crop production responds to environmental conditions. Data generated from these studies supports scientists in identifying management strategies that enhance farm profitability and strengthen food security. Students will gain hands-on experience across multiple stages of seasonal experimental research.\n\nStudents will collaborate closely with laboratory scientist mentors and technical staff on a variety of seasonal experimental activities. Opportunities may include helping with low-voltage sensor calibration, testing, and operation; contributing to the design of plant experiments; caring for and harvesting plant materials; collecting and recording measurements; entering and organizing data; and performing basic statistical analyses using a range of software tools.\n\nLearning Objectives: They will learn how plants and soils respond to genetic, environmental, and management inputs, and why understanding these interactions is essential for improving food security and promoting sustainable farming systems. Participants will also gain hands-on experience with low-voltage environmental sensing technologies and data-collection devices.\n\nParticipants will develop new professional skills in experimental design, operation of scientific instruments, data measurement and record keeping, basic statistical analysis, and plant husbandry. They will collaborate closely with established scientists, benefiting from daily mentorship that often includes informal, big-picture discussions about agricultural systems, environmental sustainability, and food security. Students will also gain valuable insight into the day-to-day experience of academic research.\n\nMentor(s): The mentors for this opportunity are Christine Chang (christine.chang@usda.gov) and David Fleisher (david.fleisher@usda.gov). If you have questions about the nature of the research, please contact the mentors.\n\nAnticipated Appointment Start Date: May 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full-time for the summer and have the potential for reduced hours during the off-season as well.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $760 - $1,000 weekly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Northeast@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received or be currently pursuing an associate's, bachelor's, master's, or doctoral degree in the one of the relevant fields.\n\nPreferred skills:\n\nComfortable performing outside or in greenhouses, and on their feet, for up to several hours a day.\n  Contact\nUSDA-ARS-NEA-2026-0018\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Beltsville, Maryland. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "04/24/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 5/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nBeltsville, Maryland\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n*Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.154,
    "discipline_keywords": [
      "natural resources",
      "resource management",
      "agriculture"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:45.206116+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  },
  {
    "title": "USGS Thermal Disease Dynamics in Wildlife Hosts",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Madison, Wisconsin",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/1/2026",
    "published_date": "01/20/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112626",
    "description": "USGS Thermal Disease Dynamics in Wildlife Hosts\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/DOI-USGS-2025-21\nApplication Deadline:\n02/22/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nMadison, Wisconsin\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications will be reviewed on a rolling-basis.\n\nUSGS Office/Lab and Location: A research opportunity is currently available with the U.S. Geological Survey (USGS) located in Madison, Wisconsin.\n\nThe USGS mission is to monitor, analyze, and predict current and evolving dynamics of complex human and natural Earth-system interactions and to deliver actionable intelligence at scales and timeframes relevant to decision makers. As the Nation's largest water, earth, and biological science and civilian mapping agency, USGS collects, monitors, analyzes, and provides science about natural resource conditions, issues, and problems. \n\nResearch Project: This project studies the relationship between disease dynamics and temperature in wildlife. The objective of this is to measure the infection dynamics and functional immunity of amphibians to a fungal skin pathogen. The dynamic outcomes include measuring the growth rate of the pathogen on the host, the ability of the host to resist infection, and the consequences of infection on host populations. The research combines controlled animal systems and natural wild systems to examine infection dynamics using molecular and microbiological approaches.\n\nLearning Objectives: Under the guidance of a mentor, you will gain hands-on experience to complement your education and support your academic and professional goals. During your appointment, you will engage in activities and research in several areas. These include, but are not limited to: \n\nDetection and quantification of micro-organisms using quantitative and conventional PCR\nCulture media and growth of microorganisms\nin vivo research techniques using wild animals\nBioinformatic data processing \nStudy design\nThroughout your participation, you will have the opportunity to advance your general molecular biology skills, scientific communication, methods development, presentation and communication skills. In addition, you will collaborate with a diverse team of researchers with the common goal of advancing wildlife health science for the benefit of animals, humans, and the environment at the USGS National Wildlife Health Center\n\nMentor: The mentor for this opportunity is Daniel Grear (dgrear@usgs.gov). If you have questions about the nature of the research please contact the mentor(s). \n\nAnticipated Appointment Start Date: As soon as possible. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of DOI and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: Stipend rates may vary based on numerous factors, including opportunity, location, education, and experience. If you are interviewed, you can inquire about the exact stipend rate at that time and if selected, your appointment offer will include the monthly stipend rate. The anticipated stipend range is $5,000  -$5,500 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens and Lawful Permanent Residents (LPR) only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USGS. Participants do not become employees of USGS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: If you have questions about the application process please email USGS@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a bachelor's or master's degree in the one of the relevant fields. Degree must have been received within the past one year and six months, or anticipated to be received by 5/1/2026.\n\nPreferred skills:\n\nGood organizational and communication skills\nAbility to perform independently and in a team\nBA/BS degree or MS degree in Zoology, Biology, Ecology, Wildlife or suitable equivalent or current enrollment\nPrevious laboratory experience with microbiology and molecular biology\nComfortable with live animals\nMS Word, Excel, Powerpoint (experience with databases or R language for statistical computing a plus)\nValid US driver’s license\n  Contact\nDOI-USGS-2025-21\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens and Lawful Permanent Residents (LPR) only.",
    "project_details": "USGS Office/Lab and Location: A research opportunity is currently available with the U. Research Project: This project studies the relationship between disease dynamics and temperature in wildlife. The research combines controlled animal systems and natural wild systems to examine infection dynamics using molecular and microbiological approaches",
    "contact_info": "",
    "application_deadline": "02/22/2026\nPublished:\n01/20/2026\nStarting Date:\nafter 2/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nMadison, Wisconsin\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications will be reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-01-26T19:01:45.310950+00:00",
    "scrape_run_id": "scrape_20260126_190117_92a6d672",
    "scraper_version": "2.0"
  }
]