[
  {
    "title": "Graduate Assistantship at WVU: Aquatic Species Responses to Changing River Conditions",
    "organization": "Aquatic lab- West Virginia University (Private)",
    "location": "West Virginia University (Morgantown, West Virginia)",
    "salary": "$21,000 to $27,000 per year",
    "starting_date": "8/17/2026",
    "published_date": "02/13/2026",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113704",
    "description": "Graduate Assistantship at WVU: Aquatic Species Responses to Changing River Conditions\nAquatic lab- West Virginia University (Private)\nDetails\nApplication Deadline:\n04/01/2026\nPublished:\n02/13/2026\nStarting Date:\n8/17/2026\nHours per Week:\nat least 40\nSalary:\n$21,000 to $27,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nWest Virginia University (Morgantown, West Virginia)\nTags:\nGraduate Opportunities\nDescription\nThe Davis College of Agriculture, Natural Resources, and Design at West Virginia University, through Dr. Carol Arantes’s lab, is recruiting a Master’s or PhD student to begin in Fall 2026 to study how changes in river conditions affect aquatic ecosystems and biodiversity. \n\nThe student will be part of a collaborative, interdisciplinary project examining how global hydraulic infrastructure and river management over the past century have altered river discharge regimes and aquatic ecosystems, and how uncertainty in reconstructed historical records affects confidence in global assessments of river change. Working within a multi-institutional research team, the student will collaborate closely with a modeling group to develop and apply new models and indicators of river processes that integrate hydrologic alteration, river fragmentation, sediment transport, river temperature, and patterns of fish diversity and abundance. \n\nThe student will work closely with the PI, postdoctoral researchers, and a multi-institutional team of project partners to integrate ecological data with large-scale environmental and infrastructure datasets. Expected outcomes include peer-reviewed publications, technical reports, and presentations for both scientific and non-scientific audiences. The position offers strong training opportunities in quantitative analysis, interdisciplinary research, and professional development. \n\nQualifications \nApplicants must hold a B.S. or M.S. degree in ecology, fisheries, zoology, aquatic sciences, or a closely related field, with a minimum GPA of 3.0/4.0. Successful candidates will demonstrate strong written and oral communication skills, solid analytical abilities, and the capacity to work independently and collaboratively. Experience or strong interest in fish and aquatic ecology is required. Experience with or interest in computer modeling, statistical analysis (Bayesian and/or frequentist approaches), and GIS is highly desirable. \n\n Funding:\nThe selected student will be supported through a combination of Teaching Assistantships (TAships) and Research Assistantships (RAships), for a total of three years of funding.\n\nM.S. students will receive a stipend of $21,000 per year plus a full tuition waiver.\n\nPh.D. students will receive 9 months of funding per year plus a full tuition waiver, with opportunities for additional summer salary contingent upon successful completion of stream surveys and project fieldwork.\n\n How to Apply\nInterested students should email the following materials as a single PDF directly to:\nDr. Carol Arantes\ncaroline.arantes@mail.wvu.edu \n\nApplication materials should include: \n\nA brief cover letter describing research background, interests, career goals, and motivation for pursuing an MS or PhD\nA current CV or résumé\nNames and contact information for three professional references\nUnofficial transcripts and GRE scores (if available)\n\n Please do not submit materials to the WVU Graduate School at this stage.\n\nAdditional Information\n Davis College of Agriculture, Natural Resources, and Design\n https://www.davis.wvu.edu/\nSchool of Natural Resources and the Environment\nhttps://www.davis.wvu.edu/schools/natural-resources-and-the-environment\nDr. Arantes’s lab\nhttps://www.davis.wvu.edu/faculty-staff/directory/carol-arantes\nhttps://aranteslab.weebly.com/ \n\n \n\n\n  Contact\nCaroline C. Arantes\ncaroline.arantes@mail.wvu.edu (preferred contact method)",
    "requirements": "Qualifications \nApplicants must hold a B.S. or M.S. degree in ecology, fisheries, zoology, aquatic sciences, or a closely related field, with a minimum GPA of 3.0/4.0. Successful candidates will demonstrate strong written and oral communication skills, solid analytical abilities, and the capacity to work independently and collaboratively. Experience or strong interest in fish and aquatic ecology is required. Experience with or interest in computer modeling, statistical analysis (Bayesian and/or frequentist approaches), and GIS is highly desirable.",
    "project_details": "Working within a multi-institutional research team, the student will collaborate closely with a modeling group to develop and apply new models and indicators of river processes that integrate hydrologic alteration, river fragmentation, sediment transport, river temperature, and patterns of fish diversity and abundance. The student will work closely with the PI, postdoctoral researchers, and a multi-institutional team of project partners to integrate ecological data with large-scale environmental and infrastructure datasets. The position offers strong training opportunities in quantitative analysis, interdisciplinary research, and professional development",
    "contact_info": "",
    "application_deadline": "04/01/2026\nPublished:\n02/13/2026\nStarting Date:\n8/17/2026\nHours per Week:\nat least 40\nSalary:\n$21,000 to $27,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nWest Virginia University (Morgantown, West Virginia)\nTags:\nGraduate Opportunities\nDescription\nThe Davis College of Agriculture, Natural Resources, and Design at West Virginia University, through Dr",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Fisheries & Aquatic Science",
    "discipline_confidence": 0.21,
    "discipline_keywords": [
      "fish",
      "fisheries",
      "aquatic",
      "stream",
      "river"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:30.322713+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Sensors for Crops Mortality and Soil Quality in Agriculture Fellowship",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Ames, Iowa",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/28/2026",
    "published_date": "02/10/2026",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113604",
    "description": "USDA-ARS Sensors for Crops Mortality and Soil Quality in Agriculture Fellowship\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-MWA-2026-0061\nApplication Deadline:\n04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 2/28/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\nAmes, Iowa\nTags:\nGraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Ames, Iowa.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nThe National Laboratory for Agriculture and the Environment (NLAE) generates information addressing critical problems in agriculture and watershed management to develop innovative solutions which increase the efficiency of agriculture systems and reduce environmental risk. Transdisciplinary teams address this through coordinated research in abiotic and biotic systems.\n\nResearch Project:  Under the guidance of a mentor, the fellow will have the opportunity to participate in a project that address the challenges crop producers in the US Midwest region face with associated losses of nutrients and nutrient use efficiency all of which affect crop productivity and mortality. This research will help close the nitrogen balance through careful measurements of N inputs and N outputs under different treatments and weather conditions. The research will utilize graphene sensors to measure N losses through the soil for the different treatments.  Complementary measurements of crop leaf area index during the lifecycle of the crop will be taken.\n\nLearning Objectives: \n\nLearn about nitrogen inputs\nLearn about fertilizer input/outputs\nLearn on how to draft technical articles\nLearn skills in collaboration\nMentor(s): The mentor for this opportunity is Thanos Papanicolaou (thanos.papanicolaou@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: February 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $3,500 - $3,800 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Midwest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing a master's or doctoral degree in the one of the relevant fields. Degree must be anticipated to be receive by 6/1/2026.\n\nPreferred skills:\n\nExperience in developing ion-selective electrode (ISE) sensors for real-time nutrient monitoring\n  Contact\nUSDA-ARS-MWA-2026-0061\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Ames, Iowa. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 2/28/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\nAmes, Iowa\nTags:\nGraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:30.714320+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Research Fellowship in Grazing Beef Cattle Physiology and Behavior",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Lexington, Kentucky",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113602",
    "description": "USDA-ARS Research Fellowship in Grazing Beef Cattle Physiology and Behavior\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-MWA-2026-0052\nApplication Deadline:\n03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nLexington, Kentucky\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location:  A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), Forage-Animal Production Research Unit located in Lexington, Kentucky.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The educational opportunity involves performing research, under the mentorship of Dr. Brittany Davis at the USDA-ARS, FAPRU, focused on grazing beef cattle physiology and behavior.  The primary research project is a multi-state beef cattle grazing collaborative study.  The fellow will have the opportunity to participate on a project that focuses on determining the impacts of adaptation to different grazing management systems and environments (KY vs. MT) on the performance and physiology of beef heifers, specifically as it relates to fescue toxicosis and heat stress susceptibility.  This study utilizes a combination of measures including reproductive, rumen microbiology (combination of molecular and anaerobic microbiological approaches), animal physiology (vascular Doppler ultrasound, rumen temperature, RNA sequencing, markers of inflammation and stress), behavior (grazing behavior halters, accelerometer-based ear tags, chute velocity measures), environmental monitoring, and pasture measures. \n\nLearning Objectives: Under the mentor's guidance, the participant will learn to compile, analyze, interpret, and report collected data (microbiome, feeding behavior, precision activity monitoring, rumen temperature and pH bolus, environmental data, etc.) from past and ongoing grazing and pen beef cattle research. Overall, the fellow will have the opportunity to gain experience in grazing research, pen research, nutrition, physiology, gut microbiology, bioinformatics, precision technologies, agronomy, and reproductive physiology in beef cattle, as well as opportunities for collaboration and networking.\n\nMentor(s): The mentor for this opportunity is Brittany Davis (brittany.davis@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: April 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend is $74,678 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Midwest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields.\n\nPreferred skills:\n\nExperience in analyzing, interpreting, and publishing large datasets including computation, coding, and bioinformatics with an emphasis on conducting correlative analyses between data sets and with other collected performance and physiological data is preferred.\nExperience in animal science research with an interest or previous experience in grazing beef cattle preferred. \nExperience utilizing molecular techniques for studying microbial communities.\nExperience or interest implementing and evaluating precision technologies. \nExperience in the use of scripting languages (e.g. python, R, etc.)\nExperience performing multivariate statistical analyses and using statistical analyses software for data processing and interpretation. \nExcellent written and verbal communication skills.\nStrong organizational and project management skills. \nAbility to perform collaboratively in interdisciplinary research teams.\n  Contact\nUSDA-ARS-MWA-2026-0052\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Research Fellowship in Grazing Beef Cattle Physiology and Behavior\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location:  A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), Forage-Animal Production Research Unit located in Lexington, Kentucky",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nLexington, Kentucky\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.154,
    "discipline_keywords": [
      "natural resources",
      "grazing",
      "agriculture",
      "interpretation"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:30.812776+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postdoctoral Research Fellowship in Avian Virology, Immunology and Synthetic Biology",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Athens, Georgia",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113626",
    "description": "USDA-ARS Postdoctoral Research Fellowship in Avian Virology, Immunology and Synthetic Biology\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0070\nApplication Deadline:\n04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nAthens, Georgia\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Athens, Georgia.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The US National Poultry Research Center (USNPRC) is seeking a postdoctoral fellow to investigate the complex molecular interactions between Infectious Laryngotracheitis Virus (ILTV) and the host immune system. As an alphaherpesvirus, ILTV causes significant economic losses worldwide through respiratory distress and decreased production in poultry. This research specifically focuses on the characterization of virus-encoded immunoregulatory proteins, known as virokines, which serve as evolved mechanisms allowing the virus to subvert or evade the host’s innate and adaptive immune responses. By utilizing synthetic biology and reverse genetics, the participant will dissect the function of these proteins to identify targets for attenuation, ultimately leveraging these insights to engineer next-generation vaccine candidates using viral-vector platforms to bridge the gap between fundamental virology and applied veterinary medicine.\n\nResearch activities will include the characterization of novel ILTV-encoded virokines to determine their specific cellular targets within the avian immune system and develop novel vaccines. The fellow will determine the role of these immunomodulatory proteins in viral replication and pathogenesis using both in vitro and in vivo models. Furthermore, the project involves utilizing CRISPR/Cas9 and recombineering to generate mutant viruses lacking specific virokines to assess their potential as live-attenuated vaccine candidates. To ensure rigorous evaluation, the participant will establish standardized immunological assays to define the correlates of protection, focusing on both mucosal and systemic cellular responses. Finally, the project culminates in the evaluation of the safety and efficacy of these candidate vaccines within BSL-2 animal facilities.\n\nLearning Objectives: \n\nThe participant will gain advanced technical expertise in synthetic biology and the genetic manipulation of large DNA viruses.\nThe fellow will receive hands-on training in cutting-edge vaccine development\nThe program offers unique experience in conducting high-containment research within BSL-2 laboratory environments.\nParticipants will develop proficiency in multi-parameter flow cytometry and specialized immunological assays to measure avian-specific immune correlates.\nThe fellow will benefit from professional mentorship in scientific reasoning, manuscript preparation, and presenting data at virology conferences.\nThe fellowship provides exposure to a multidisciplinary federal research environment, fostering collaborations with USDA experts in molecular virology, immunology, bioinformatics and genomics.\nMentor(s): The mentor for this opportunity is Stephen Spatz (stephen.spatz@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: April 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $70,000 annually. \n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields (infectious disease, immunology, virology, or a related field). Degree must have been received within the past four years or be currently pursuing.\n\nPreferred skills:\n\nAdvanced Molecular Virology: Direct experience with synthetic biology, reverse genetics systems, or recombineering to manipulate large DNA viral genomes\nGene Editing Expertise: Hands-on proficiency with CRISPR/Cas9-based approaches for generating mutant viruses.\nImmunological Profiling: Advanced skills in multi-parameter flow cytometry (FACS), immune cell isolation, and ELISA development.\nAnimal Research (BSL-2): Previous experience handling animal models (ideally poultry) within high-containment (BSL-2) environments, including conducting vaccine safety and efficacy trials.\nBioinformatics: Familiarity with computational tools for NGS sequence analysis, transcriptomics (RNA-seq), or data interpretation to bridge molecular and systems biology.\nPreferred candidates will have experience in molecular biology. virology, flow cytometry, bioinformatics, and animal model handling.\n  Contact\nUSDA-ARS-HQ-2026-0070\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Postdoctoral Research Fellowship in Avian Virology, Immunology and Synthetic Biology\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Athens, Georgia",
    "contact_info": "",
    "application_deadline": "04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nAthens, Georgia\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:31.244160+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Fellowship in Molecular Genetics of Insect & Microbe Interactions",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Wapato, Washington",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113625",
    "description": "USDA-ARS Fellowship in Molecular Genetics of Insect & Microbe Interactions\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0048\nApplication Deadline:\n03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nWapato, Washington\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Wapato, Washington.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The postdoctoral fellow will engage in basic and applied research on RNA interference (RNAi) in hemipteran leafhopper insects that vector phytoplasma bacteria plant pathogens. The study system involves the Colladonus leafhoppers and X-disease phytoplasma, Candidatus Phytoplasma pruni, which is currently afflicting cherry and other stone fruit. The aim is to explore and develop methods for RNA interference as an applied approach to insect pest and plant disease management while addressing fundamental questions of the biology of the X-disease pathosystem. Transcriptomic datasets will be examined to identify candidate target genes. Bioassays will be conducted with RNAi effector molecules to assess phenotypic effects of RNAi-mediated gene knockdown on insect mortality and phytoplasma life-cycle manifestation. This research addresses challenges related to plant health and sustainable agriculture.\n\nUnder the guidance of a mentor, the fellow will design and conduct experiments in laboratory and greenhouse settings, analyze data, and contribute to collaborative projects within and across USDA-ARS Research Units and partner institutions. The fellow will have opportunities to present findings at scientific conferences and stakeholder meetings, publish results in peer-reviewed journals and engage with multidisciplinary teams to advance research towards solutions for agricultural threats.\n\nLearning Objectives: This fellowship affords the ability to develop expertise at the interface of molecular genetics, bioinformatics, and insect/microbe ecology while contributing to technological innovations that protect global food security. Under the guidance of a mentor, the postdoctoral fellow will learn about and gain experience in:\n\nStudy and analysis of transcriptomic datasets\nDesign, conduct, and analysis of insect bioassay greenhouse experiments\nMolecular aspects of RNA interference\nBiology and behavior of insect vectors of plant pathogens\nMolecular diagnosis of insect-vectored and phloem-limited plant pathogens, including Candidatus Phytoplasma pruni\nCollaborating effectively within a multidisciplinary research team\nPreparing and submitting manuscripts to peer-reviewed journals\nPreparing and presenting presentations at scientific and stakeholder meetings\nMentor(s): The mentor for this opportunity is William Walker (william.walker@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: April 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $7,000 - $8,000 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received a doctoral degree in entomology, plant biology, molecular biology, or related field. Degree must have been received within the past four years or is anticipated to be received by August 31, 2026.\n\nPreferred skills\n\nFoundational background in insect-pathogen interactions\nFamiliarity with basic molecular biology techniques\n  Contact\nUSDA-ARS-HQ-2026-0048\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Wapato, Washington. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nWapato, Washington\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:31.349352+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Research Fellowship: Animal Bioinformatics",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Moscow, Idaho",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 6/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113624",
    "description": "USDA-ARS Research Fellowship: Animal Bioinformatics\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0047\nApplication Deadline:\n03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 6/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nMoscow, Idaho\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Moscow, Idaho.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: The participant will be stationed at the Range Sheep Production Efficiency Research Unit (RSPER) in Dubois, Idaho and will be located at the University of Idaho in Moscow, ID. The RSPER is home to 2,500 breeding ewes and rams made up of five breeds and one new composite line. The fellow will conduct research aimed at the development of genomic reference populations for U.S. sheep breeds. The objective of the research is utilize ARS genetic resources to develop reference panels to transform low-cost SNP data to whole genome sequencing, which can then be used by researchers and industry for a wide variety of genetic and genomic applications. The participant will disseminate research results at scientific meetings and in peer-reviewed scientific publications.\n\nThe broad goal of the research is to develop U.S. genomic resource populations to enable imputation from SNP data to whole genome sequencing (WGS). The specific goals are to:\n\nEstablish and maintain data processing pipelines associated with WGS mapping and variant calling;\nEvaluate the accuracy of imputation from SNP data to WGS in order to optimize the procedures prior to providing these tools to industry; and\nUtilize WGS data to perform genetic analyses using RSPER data (e.g., genome-wide association studies).\nLearning Objectives: Under the guidance of the mentor, the fellow will learn about:\n\nAdvancing technical expertise in high-throughput data analysis\nDeveloping independent research capabilities\nEnhancing professional skills for a career in research or industry\nStrengthening collaborative, communication, and project management abilities\nMentor(s): The mentor for this opportunity is Carrie Wilson (carrie.wilson@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: June 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend is $6,223 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received a doctoral degree in one of the relevant fields (Animal Science, Bioinformatics, Computational Biology, Genetics, Biology, Molecular Biology, Microbiology, or a related field of study). Degree must have been received within the past four years.\n\nPreferred skills:\n\nKnowledge of whole genome sequencing mapping and variant calling as well as programming skills, such as Python and R. \nA working knowledge of animal science (preferably sheep), and statistics.\n  Contact\nUSDA-ARS-HQ-2026-0047\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Research Fellowship: Animal Bioinformatics\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Moscow, Idaho",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 6/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nMoscow, Idaho\nTags:\nFaculty / Post-Doc Appointments\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:31.451295+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postdoctoral Fellowship in Plant-Pathogen-Vector Interactions",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Wapato, Washington",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113617",
    "description": "USDA-ARS Postdoctoral Fellowship in Plant-Pathogen-Vector Interactions\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-HQ-2026-0044\nApplication Deadline:\n03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nWapato, Washington\nTags:\nFaculty / Post-Doc Appointments\nDescription\n*Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Wapato, Washington.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nThe selected participant will be hosted at the Temperate Tree Fruit and Vegetable Research Unit (TTFVRU).  The TTFVRU conducts research in three areas: 1) biology and management of pests and pathogens of tree fruits, 2) biology and management of pests and pathogens of potato, and 3) potato germplasm improvement.  The Research Unit maintains strong collaborations with Washington State University, Oregon State University, and University of Idaho.  https://www.ars.usda.gov/pacific-west-area/wapato-wa/temperate-tree-fruit-and-vegetable-research/.\n\nResearch Project: The postdoctoral fellow will engage in innovative research on symbiont technology—a cutting-edge approach that uses Agrobacterium to deliver antimicrobial peptides (AMPs) into plant phloem, aiming to combat fastidious phloem-limited pathogens such as ‘Candidatus Liberibacter solanacearum.’  This research addresses critical challenges in plant health and sustainable agriculture.  Research will span multiple disciplines, including plant pathology, entomology, plant biology, and molecular biology.  The fellow will design and execute experiments in both laboratory and greenhouse settings, analyze complex datasets, and contribute to collaborative projects involving USDA-ARS Research Units and partner institutions.  In addition to hands-on research, the fellow will have opportunities to present findings at regional and national scientific conferences and stakeholder meetings, publish results in high-impact, peer-reviewed journals, and engage with a multidisciplinary team to learn about solutions for major agricultural threats.  This fellowship offers a unique chance to develop expertise at the intersection of molecular biology and applied plant science while contributing to innovations for global food security.\n\nLearning Objectives: Under the guidance of a mentor, the postdoctoral fellow will learn about and gain experience in:\n\nDesigning, conducting, and analyzing greenhouse experiments\nMolecular engineering of Agrobacterium-induced galls\nBiology and behavior of insect vectors of plant pathogens\nMolecular diagnosis of fastidious insect-vectored and phloem-limited plant pathogens, including Candidatus Liberibacter solanacearum and Ca. Phytoplasma pruni\nCollaborating effectively within a multidisciplinary and multi-institutional team\nPreparing and submitting manuscripts to peer-reviewed journals\nPreparing and presenting presentations at scientific and stakeholder meetings\nMentor(s): The mentor for this opportunity is Rodney Cooper (rodney.cooper@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: April 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will be for two years.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $6,000 - $7,000 monthly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.HQPostdoc@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should have received a doctoral degree in entomology, plant pathology, plant biology, molecular biology, or related field.  Degree must have been received within the past four years or is anticipated to be received by April 1, 2026.\n\nPreferred skills\n\nFoundational background in plant-insect-pathogen interactions\nFamiliarity with basic molecular biology techniques\nContact\nUSDA-ARS-HQ-2026-0044\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), located in Wapato, Washington. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "03/27/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nWapato, Washington\nTags:\nFaculty / Post-Doc Appointments\nDescription\n*Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:31.865105+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Postdoctoral Research Associate",
    "organization": "University of Montana (State)",
    "location": "Missoula, Montana",
    "salary": "$70,000 per year",
    "starting_date": "after 5/1/2026",
    "published_date": "02/12/2026",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113718",
    "description": "Postdoctoral Research Associate\nUniversity of Montana (State)\nDetails\nPosting:\nhttps://www.schooljobs.com/careers/ummissoula/jobs/5222387/postdoctoral-research-associate-mtcwru\nApplication Deadline:\n03/10/2026\nPublished:\n02/12/2026\nStarting Date:\nafter 5/1/2026\nHours per Week:\n40\nSalary:\n$70,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nMissoula, Montana\nDescription\n\nOverview\n\nApplications are welcome for a postdoctoral research opportunity on large mammal monitoring in northwest Montana, US. The position is part of a collaborative project between the University of Montana and Montana Fish, Wildlife, and Parks (FWP). The project addresses a multitude of methodological and ecological questions related to wildlife population dynamics to inform management. Data are collected, including camera trap images, fecal DNA samples, and GPS tracking, and we are seeking an enthusiastic researcher with a good publication record to lead some of the data analyses. The focus of this project is to refine population size estimation for elk and deer using multiple data sources and to quantify population dynamics in space.\n\nMinimum Qualifications\n\nApplicants must have a PhD (or have a defense date scheduled for Spring 2026) in statistical ecology or related fields with demonstrated strong quantitative skills and proficiency in programming (preferably R)\n\nAnd at least three of the following qualifications:\nDemonstrated experience in spatial population modeling\nDemonstrated knowledge of hierarchical ecological models\nDemonstrated experience in managing and analyzing wildlife population data\nPeer-reviewed publications of at least three PhD dissertation chapters\nDefended PhD dissertation within the past three years\n\n\nAdditional Information\n\nPosition is full-time, 1.0 FTE, Letter of Appointment and includes a comprehensive and competitive benefits package including insurance package, mandatory retirement plan, partial tuition waiver, and wellness program.\n\n\nPlease submit your application here, including:\nLetter of Interest – addressing the stated required skills for the position\nDetailed resume  – listing education and describing work experience\nThree (3) professional references- Names and contact information\nTranscripts\n\nScreening of applications will begin after the closing date, however, applications will continue to be accepted until an adequate applicant pool has been established.\nContact\nDr. Mahdieh Tourani\nmahdieh.tourani@umontana.edu (preferred contact method)",
    "requirements": "Hours per Week:\n40\nSalary:\n$70,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone",
    "project_details": "Postdoctoral Research Associate\nUniversity of Montana (State)\nDetails\nPosting:\nhttps://www. com/careers/ummissoula/jobs/5222387/postdoctoral-research-associate-mtcwru\nApplication Deadline:\n03/10/2026\nPublished:\n02/12/2026\nStarting Date:\nafter 5/1/2026\nHours per Week:\n40\nSalary:\n$70,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nMissoula, Montana\nDescription\n\nOverview\n\nApplications are welcome for a postdoctoral research opportunity on large mammal monitoring in northwest Montana, US. Data are collected, including camera trap images, fecal DNA samples, and GPS tracking, and we are seeking an enthusiastic researcher with a good publication record to lead some of the data analyses",
    "contact_info": "",
    "application_deadline": "03/10/2026\nPublished:\n02/12/2026\nStarting Date:\nafter 5/1/2026\nHours per Week:\n40\nSalary:\n$70,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nMissoula, Montana\nDescription\n\nOverview\n\nApplications are welcome for a postdoctoral research opportunity on large mammal monitoring in northwest Montana, US",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.167,
    "discipline_keywords": [
      "wildlife",
      "deer",
      "elk",
      "mammal",
      "population dynamics"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:31.951506+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Dakota Skipper (butterfly) Technician - Student Contractor in North Dakota",
    "organization": "United States Geological Survey (Federal)",
    "location": "Towner, ND, North Dakota",
    "salary": "$18.78 to $21.01 per hour",
    "starting_date": "between 5/7/2026 and 5/21/2026",
    "published_date": "02/09/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113492",
    "description": "Dakota Skipper (butterfly) Technician - Student Contractor in North Dakota\nUnited States Geological Survey (Federal)\nDetails\nApplication Deadline:\n02/23/2026\nPublished:\n02/09/2026\nStarting Date:\nbetween 5/7/2026 and 5/21/2026\nEnding Date:\nbetween 8/21/2026 and 8/31/2026\nHours per Week:\n40 - 50\nSalary:\n$18.78 to $21.01 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nTowner, ND, North Dakota\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nNorthern Prairie Wildlife Research Center is seeking 1 student contractor technician for the 2026 summer field season for research on the Dakota skipper, a Federally listed butterfly. Research will focus on questions concerning site occupancy and skipper detectability. The technician will be responsible for surveying for Dakota skippers and performing vegetation surveys in grassland sites in North and/or South Dakota, exact location(s) TBD. The technician will be trained in data-collection methods at the beginning of the field season. Skipper surveys will mostly occur in June and July while vegetation surveys at the same sites will occur in August. Start date is somewhat flexible centered around mid-May, while the end date is also likely flexible (~ end of August).\n\nField work is extensive and requires long hours walking in prairie sites, in uneven terrain and off trail, sometimes in challenging weather conditions. Field work will involve exposure to a wide variety of weather conditions including cold, mud, intense heat, and humidity. Exposure to biting insects and ticks is possible. At the end of each field day, when out of the field, the technician will likely be expected to do data entry/management tasks. Housing will be provided and is likely to be in campers, and it is possible that technicians will be asked to move housing (camper) locations during the field season. For this reason, trailering experience or experience living in and maintaining campers would be considered a bonus, but is not required for the position.\n\nThis position is only open to students or recent graduates (graduated less than 1 year from start date)\n(Ex. If graduated in June 2025, you qualify for our start date in mid-May 2026). Interested applicants should submit an updated resume, a recent copy of their academic transcripts, and a copy of diploma if applicable. Selections may be made as resumes come in.\n\nStart Date: mid-May 2026 but somewhat flexible\n\nLocation: central North Dakota\n\nSalary: $18.78-21.01 depending on experience and education. Housing included. Generally working 40-50hr/week\n\nQualifications: Selectees will be hired as Student Service Contractors.\nThis position is only open to current students or recent graduates (graduated less than 1 year ago from start date), including graduate degrees.\nCurrent students (not yet graduated) must be in good academic standing and enrolled in a degree program at a recognized educational institution.\nApplicants should have a B.S. or B.A. degree in wildlife, natural resources, or in a related field or will have a B.S. or B.A. by the time of their start date for the position. Applicants with 2+ years of college experience are also encouraged to apply.\nMust be able to follow an established survey protocol and accurately record data. Applicants must be in good physical condition and be able to work long hours in variable weather conditions with little supervision. Technicians may be required to lift objects weighing up to 40 pounds in the performance of assigned duties. Attention to detail and the ability to focus on minute differences in butterfly appearance/identification and behavior is required. Experience using DSLR cameras is a bonus. Applicants with a working knowledge of pollinators (especially butterflies) and butterfly identification are especially encouraged to apply, but previous pollinator experience is not required. Birding experience is not required, but birding skillsets often translate well to work with pollinators/butterflies.\nYou will be required to operate a government-owned vehicle in the performance of your official duties. Applicants for this position must meet the following requirements: (1) possession of a valid State driver’s license, and (2) documentation of a safe driving record. If selected, you will be required to provide proof of a valid State driver's license and a copy of your driving record.\n\nTo the contact person listed below, please provide a 1-2 page resume including:\n• Student’s full legal name (including middle name)\n• Mailing address\n• Telephone number\n• Email address\n• Date of birth\n• Place of birth\n• Citizenship and, if not a US citizen, immigration/VISA status\n• Education, including descriptions of relevant classes\n• Work or volunteer experience related to the scientific field\n\nInclude the following attachments:\nA copy of your most recent academic transcript, listing courses taken and overall GPA. This does not need to be official transcripts for your application. If selected, you will need to provide an official transcript.\nA copy of your diploma or letter from registrar or advisor (if applicable)\n**Please make sure your Last and First name is included in the filename for any documents submitted.\n**Do NOT include a Social Security Number (SSN) on your resume.\nStudents will be working as independent contractors and do not receive a premium rate for work beyond 8 hours/day or 40hours/week. Additionally, students are paid only for hours worked.\n\nLast Date to Apply: Applications will be reviewed as submitted; announcement open until February 23rd, 2026.\n\nContact Person: Garrett MacDonald; gmacdonald@usgs.gov\nContact\nGarrett MacDonald\ngmacdonald@usgs.gov (preferred contact method)",
    "requirements": "Hours per Week:\n40 - 50\nSalary:\n$18.78 to $21.01 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "01 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nTowner, ND, North Dakota\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nNorthern Prairie Wildlife Research Center is seeking 1 student contractor technician for the 2026 summer field season for research on the Dakota skipper, a Federally listed butterfly. Research will focus on questions concerning site occupancy and skipper detectability",
    "contact_info": "",
    "application_deadline": "02/23/2026\nPublished:\n02/09/2026\nStarting Date:\nbetween 5/7/2026 and 5/21/2026\nEnding Date:\nbetween 8/21/2026 and 8/31/2026\nHours per Week:\n40 - 50\nSalary:\n$18",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.167,
    "discipline_keywords": [
      "wildlife",
      "bird",
      "migration",
      "behavior",
      "grassland"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:32.060682+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Bee/Botany/Soil Technician (Student Service Contractor) - Wisconsin Summer 2026",
    "organization": "United States Geological Survey (Federal)",
    "location": "multiple",
    "salary": "$18.78 to $25.77 per hour",
    "starting_date": "between 6/8/2026 and 6/15/2026",
    "published_date": "02/09/2026",
    "tags": "Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=111509",
    "description": "Bee/Botany/Soil Technician (Student Service Contractor) - Wisconsin Summer 2026\nUnited States Geological Survey (Federal) | https://www.usgs.gov/\nDetails\nPosting:\nhttps://www.usgs.gov/centers/northern-prairie-wildlife-research-center\nApplication Deadline:\n02/16/2026\nPublished:\n02/09/2026\nStarting Date:\nbetween 6/8/2026 and 6/15/2026\nEnding Date:\nbetween 9/25/2026 and 10/2/2026\nHours per Week:\n40 - 50\nSalary:\n$18.78 to $25.77 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocations:\nLaCrosse, Wisconsin\nMadison, Wisconsin\nGreen Bay, Wisconsin\nJamestown, North Dakota\nTags:\nUndergraduate Opportunities\nDescription\nNorthern Prairie Wildlife Research Center is seeking 1 student contractor technician for the 2026 summer field season of a study of pollinator habitat establishment, soil health, and use by bees on private lands enrolled in USDA Farm Bill land conservation programs using the CRP, EQIP, and CSP conservation cover practices. Housing provided. We are hiring 1 technician to be part of a 6-7 person field team for 4 months from June to September.\n Technician will be conducting flowering plant transect surveys, bumblebee and honeybee surveys, broader native bee surveys, and soil sampling with a field partner as part of a six-person team at field sites in SE Wisconsin throughout the Driftless region. Field work is extensive and requires long hours in sunny, hot, and humid conditions in occasionally rugged terrain. Exposure to biting insects and ticks is likely, exposure to stinging insects guaranteed. The incumbent may be required to lift coolers weighing up to 40 lbs in the performance of assigned duties. \nTechnician will gain extensive field experience in Midwest flowering plant identification, bumblebee identification to species, and native bee identification to genus. Crew lead will gain additional experience in managing and training field crews, field planning to meet sampling deadlines, and coordinating with project biologist on data delivery with data entry, proofing, and native bee specimen identification and curation. \n\nField housing will be provided in the Driftless region between LaCrosse and Madison, WI, and may be a bunkhouse setting, a field house, camper, and/or apartments. Overnight trips to additional field sites in Green Bay, WI may also be required, and housing will be provided during overnight trips. \n\nContact:\nAlma Schrage, Biologist, Northern Prairie Wildlife Research Center \naschrage@usgs.gov (preferred contact method) \n This position is only open to students or recent graduates (who have graduated on May 1st, 2025 or later) from an undergraduate or graduate program. Interested applicants should submit a brief cover letter, resume, two professional references, recent copy of transcript, and copy of diploma if applicable. Selections may be made as resumes come in. \n Start Date: June 8th - June 15th, 2026 \n Locations: \nLaCrosse, WI \nMadison, WI \nGreen Bay, WI \nJamestown, ND \n Qualifications: Selectees will be hired as Student Service Contractors. This position is only open to students or recent graduates (graduated less than 1 year ago from start date, including graduate degrees). Students must be in good academic standing and enrolled in a degree program at a recognized educational institution. \nApplicants should have a B.S. or B.A. degree in wildlife, natural resources, or related field or will have a B.S. or B.A. by the time of their start date for the position. Applicants with 2+ years of college experience are also encouraged to apply. \nMust be able to follow an established monitoring protocol and accurately record data. Applicants must be in good physical condition and possess good communication and organizational skills. The ability to work both independently and with others is essential. Applicants with a working knowledge of GPS units, plant identification, and bumble bee or native bee identification/survey experience are especially encouraged to apply. \nYou will be required to operate a government-owned or leased vehicle in the performance of your duties. Applicants for this position must meet the following requirements: (1) possession of a valid State driver’s license, and (2) possess a safe driving record. If you are selected, you will be required to provide proof of a valid State license and a copy of your driving record. \n **Please make sure your Last and First name is included in the filename for any documents submitted \n **Do NOT include a Social Security Number (SSN) on your resume. \n Students will be working as independent contractors and do not receive a premium rate for work beyond 8 hours/day or 40 hours/week. Additionally, students are paid only for hours worked. Students do earn 1 hour of sick leave for every 30 hours worked. Pay rates for students include the cost of self-employment taxes for social security and Medicare. \n \nContact\nAlma Schrage\naschrage@usgs.gov (preferred contact method)",
    "requirements": "Northern Prairie Wildlife Research Center is seeking 1 student contractor technician for the 2026 summer field season of a study of pollinator habitat establishment, soil health, and use by bees on private lands enrolled in USDA Farm Bill land conservation programs using the CRP, EQIP, and CSP conservation cover practices. Housing provided. We are hiring 1 technician to be part of a 6-7 person field team for 4 months from June to September.\n Technician will be conducting flowering plant transect surveys, bumblebee and honeybee surveys, broader native bee surveys, and soil sampling with a field partner as part of a six-person team at field sites in SE Wisconsin throughout the Driftless region. Field work is extensive and requires long hours in sunny, hot, and humid conditions in occasionally rugged terrain. Exposure to biting insects and ticks is likely, exposure to stinging insects guaranteed. The incumbent may be required to lift coolers weighing up to 40 lbs in the performance of assigned duties. \nTechnician will gain extensive field experience in Midwest flowering plant identification, bumblebee identification to species, and native bee identification to genus. Crew lead will gain additional experience in managing and training field crews, field planning to meet sampling deadlines, and coordinating with project biologist on data delivery with data entry, proofing, and native bee specimen identification and curation. \n\nField housing will be provided in the Driftless region between LaCrosse and Madison, WI, and may be a bunkhouse setting, a field house, camper, and/or apartments. Overnight trips to additional field sites in Green Bay, WI may also be required, and housing will be provided during overnight trips. \n\nContact:\nAlma Schrage, Biologist, Northern Prairie Wildlife Research Center \naschrage@usgs.gov (preferred contact method) \n This position is only open to students or recent graduates (who have graduated on May 1st, 2025 or later) from an undergraduate or graduate program. Interested applicants should submit a brief cover letter, resume, two professional references, recent copy of transcript, and copy of diploma if applicable. Selections may be made as resumes come in. \n Start Date: June 8th - June 15th, 2026 \n Locations: \nLaCrosse, WI \nMadison, WI \nGreen Bay, WI \nJamestown, ND \n Qualifications: Selectees will be hired as Student Service Contractors. This position is only open to students or recent graduates (graduated less than 1 year ago from start date, including graduate degrees). Students must be in good academic standing and enrolled in a degree program at a recognized educational institution. \nApplicants should have a B.S. or B.A. degree in wildlife, natural resources, or related field or will have a B.S. or B.A. by the time of their start date for the position. Applicants with 2+ years of college experience are also encouraged to apply. \nMust be able to follow an established monitoring protocol and accurately record data. Applicants must be in good physical condition and possess good communication and organizational skills. The ability to work both independently and with others is essential. Applicants with a working knowledge of GPS units, plant identification, and bumble bee or native bee identification/survey experience are especially encouraged to apply. \nYou will be required to operate a government-owned or leased vehicle in the performance of your duties. Applicants for this position must meet the following requirements: (1) possession of a valid State driver’s license, and (2) possess a safe driving record. If you are selected, you will be required to provide proof of a valid State license and a copy of your driving record. \n **Please make sure your Last and First name is included in the filename for any documents submitted \n **Do NOT include a Social Security Number (SSN) on your resume. \n Students will be working as independent contractors and do not receive a premium rate for work beyond 8 hours/day or 40 hours/week. Additionally, students are paid only for hours worked. Students do earn 1 hour of sick leave for every 30 hours worked. Pay rates for students include the cost of self-employment taxes for social security and Medicare.",
    "project_details": "gov/centers/northern-prairie-wildlife-research-center\nApplication Deadline:\n02/16/2026\nPublished:\n02/09/2026\nStarting Date:\nbetween 6/8/2026 and 6/15/2026\nEnding Date:\nbetween 9/25/2026 and 10/2/2026\nHours per Week:\n40 - 50\nSalary:\n$18. 77 per hour\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocations:\nLaCrosse, Wisconsin\nMadison, Wisconsin\nGreen Bay, Wisconsin\nJamestown, North Dakota\nTags:\nUndergraduate Opportunities\nDescription\nNorthern Prairie Wildlife Research Center is seeking 1 student contractor technician for the 2026 summer field season of a study of pollinator habitat establishment, soil health, and use by bees on private lands enrolled in USDA Farm Bill land conservation programs using the CRP, EQIP, and CSP conservation cover practices. Contact:\nAlma Schrage, Biologist, Northern Prairie Wildlife Research Center \naschrage@usgs",
    "contact_info": "",
    "application_deadline": "02/16/2026\nPublished:\n02/09/2026\nStarting Date:\nbetween 6/8/2026 and 6/15/2026\nEnding Date:\nbetween 9/25/2026 and 10/2/2026\nHours per Week:\n40 - 50\nSalary:\n$18",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:32.158534+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Postdoctoral Fellowship: Investigating the Genetics, Mechanisms, and Utility of Potato Disease Resistance from Wild Potato Relatives",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Ithaca, New York",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 3/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments, Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113600",
    "description": "USDA-ARS Postdoctoral Fellowship: Investigating the Genetics, Mechanisms, and Utility of Potato Disease Resistance from Wild Potato Relatives\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-NEA-2026-0021A\nApplication Deadline:\n04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\nIthaca, New York\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), Emerging Pests and Pathogens Research Unit, located in Ithaca, New York, on the campus of Cornell University.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nhttps://www.ars.usda.gov/northeast-area/ithaca-ny/robert-w-holley-center-for-agriculture-health/emerging-pests-and-pathogens-research/\n\nResearch Project: The Emerging Pests and Pathogens Research Unit (EPPRU) is seeking a motivated Post Doctoral fellow to participate in a multi-disciplinary research program focused on the molecular biology of plant pathogenic bacteria. Projects within this research unit are generally aimed at solving questions related to the biology of plant pathogens and cover a range of applied and fundamental research topics. The research opportunities for this postdoc will be centered around investigating a new source of genetic disease resistance in potatoes. This resistance trait was identified and mapped in Solanum microdontum (Mcd) by its ability to protect tubers from bacterial soft rot disease.  There are three important questions that need to be addressed to prepare the germplasm for use in applied breeding programs:\n\nDoes Mcd resistance provide protection from other potato pathogens;\nDoes Mcd resistance provide protection to stems, leaves, and other tissues;\nWhat genes are responsible for Mcd resistance. \nFor additional background about this project see: doi: 10.1094/PHYTO-05-23-0158-R and doi: 10.1007/s12230-021-09859-8.  \n\nLearning Objectives: The postdoc will have the opportunity to learn advanced bacterial molecular genetics, biochemistry, next-generation sequencing methods and functional genomics, fluorescence microscopy, plant pathology, molecular plant-microbe interactions, and other skills related to developing an independent research program. The postdoc will be encouraged to attend professional conferences to present research results, participate in grant writing, and contribute to writing manuscripts. The research will take place in a USDA-ARS lab located in the Plant Pathology and Plant-Microbe Biology Section of Cornell University’s School of Integrative Plant Science, providing a dynamic and inspiring environment with a range of programs to support their professional development.\n\nMentor(s): The mentor for this opportunity is Bryan Swingle (bryan.swingle@usda.gov). If you have questions about the nature of the research, please contact the mentor(s).\n\nAnticipated Appointment Start Date: 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year, but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend is $73,000 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Northeast@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a doctoral degree in the one of the relevant fields (e.g. (Biochemistry, Cellular and Molecular Biology, Plant Pathology, Microbiology, Evolutionary Biology, Genetics, or similar)). Degree must have been received within the past five years or is anticipated to be received by 6/1/2026.\n\nPreferred skills:\n\nCandidates with a track record of publication in peer-reviewed journals, grant writing, and delivering oral presentations are highly desirable.\n  Contact\nUSDA-ARS-NEA-2026-0021\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), Emerging Pests and Pathogens Research Unit, located in Ithaca, New York, on the campus of Cornell University. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\nIthaca, New York\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:32.266590+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Assistant Professor – Crop Plant Pathology",
    "organization": "University of Arkansas (State)",
    "location": "495 N Campus Walk (Fayetteville, Arkansas)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/10/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113580",
    "description": "Assistant Professor – Crop Plant Pathology\nUniversity of Arkansas (State) | https://enpl.uark.edu/\nDetails\nPosting:\nhttps://uasys.wd5.myworkdayjobs.com/en-US/UADA_External_Career_Site/job/Fayetteville-AR/Assistant-Professor---Crop-Plant-Pathology_R0081916\nApplication Deadline:\n03/13/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 2/10/2026\nEnding Date:\nafter 3/13/2026\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years\nLocation:\n495 N Campus Walk (Fayetteville, Arkansas)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe Department of Entomology and Plant Pathology of the University of Arkansas System Division of Agriculture and the University of Arkansas, Fayetteville invites applications to fill a 12-month, tenure-track faculty position (80% research, 20% teaching) with an emphasis on pathogens and diseases affecting crop plants. The University of Arkansas, Fayetteville is a land-grant institution and the flagship university of the University of Arkansas System. \n Responsibilities: The successful candidate is expected to develop a robust, extramurally funded research program focused on managing and understanding plant pathogens that impact food or fiber crops of importance to Arkansas. Preferred areas of research specialization could include, but are not limited to epidemiology, population biology, etiology, remote sensing, diagnostics and methods of disease management. The incumbent will focus on pathogens and diseases in agricultural products of economic importance in Arkansas, such as soybeans, rice, corn, cotton, and other crops (e.g., peanuts, fruits, vegetables) where appropriate. However, research specialization is not limited to a specific commodity. The candidate is expected to demonstrate excellence in grantsmanship, report research results in peer-reviewed publications, present research at national and regional meetings, and teach graduate and undergraduate courses. They will be expected to develop and teach undergraduate and graduate level courses related to plant pathology. The candidate is expected to mentor graduate students, provide service to the institution and state as appropriate, and collaborate effectively with institutional research and extension faculty, and colleagues in related disciplines. \n\nQualifications: A Ph.D. in plant pathology or a related field is required, with expertise in pathogens and diseases impacting crop plant systems. Postdoctoral experience and previous experience in a land-grant institution is preferred. Strong oral and written communication skills and the ability to conduct independent and collaborative research are required. Preference will be given to candidates with a demonstrated ability to work effectively across disciplines in the fields of plant pathology, disease management, data analytics, and epidemiology. The position is located at the University of Arkansas main campus in Fayetteville, located in the Ozark Mountains in northwest Arkansas. Fayetteville consistently ranks as one of the best college towns in the U.S. \n Candidates must apply online at https://uasys.wd5.myworkdayjobs.com/en-US/UADA_External_Career_Site/job/Fayetteville-AR/Assistant-Professor---Crop-Plant-Pathology_R0081916 and include: 1) a cover letter; 2) statement of research interests; 3) statement of teaching philosophy and interests; 4) curriculum vitae; and; 5) names and addresses of three professional references. Potential candidates are encouraged to contact Dr. Yannis Tzanetakis itzaneta@uark.edu with questions about the position. \n Applications received by March 13, 2026, are assured full consideration. However, applications will be accepted until the position is filled. Information regarding the Department of Entomology and Plant Pathology is available online at https://enpl.uark.edu.\nContact\nDr. Yannis Tzanetakis\nitzaneta@uark.edu (preferred contact method)",
    "requirements": "Qualifications: A Ph.D. in plant pathology or a related field is required, with expertise in pathogens and diseases impacting crop plant systems. Postdoctoral experience and previous experience in a land-grant institution is preferred. Strong oral and written communication skills and the ability to conduct independent and collaborative research are required. Preference will be given to candidates with a demonstrated ability to work effectively across disciplines in the fields of plant pathology, disease management, data analytics, and epidemiology. The position is located at the University of Arkansas main campus in Fayetteville, located in the Ozark Mountains in northwest Arkansas. Fayetteville consistently ranks as one of the best college towns in the U.S.",
    "project_details": "com/en-US/UADA_External_Career_Site/job/Fayetteville-AR/Assistant-Professor---Crop-Plant-Pathology_R0081916\nApplication Deadline:\n03/13/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 2/10/2026\nEnding Date:\nafter 3/13/2026\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years\nLocation:\n495 N Campus Walk (Fayetteville, Arkansas)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe Department of Entomology and Plant Pathology of the University of Arkansas System Division of Agriculture and the University of Arkansas, Fayetteville invites applications to fill a 12-month, tenure-track faculty position (80% research, 20% teaching) with an emphasis on pathogens and diseases affecting crop plants. Responsibilities: The successful candidate is expected to develop a robust, extramurally funded research program focused on managing and understanding plant pathogens that impact food or fiber crops of importance to Arkansas. Preferred areas of research specialization could include, but are not limited to epidemiology, population biology, etiology, remote sensing, diagnostics and methods of disease management",
    "contact_info": "",
    "application_deadline": "03/13/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 2/10/2026\nEnding Date:\nafter 3/13/2026\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years\nLocation:\n495 N Campus Walk (Fayetteville, Arkansas)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe Department of Entomology and Plant Pathology of the University of Arkansas System Division of Agriculture and the University of Arkansas, Fayetteville invites applications to fill a 12-month, tenure-track faculty position (80% research, 20% teaching) with an emphasis on pathogens and diseases affecting crop plants",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:32.482033+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Associate Professor or Professor of Plant Biology/ Director of Lake Erie Grape Research and Extension Center (LERGREC)",
    "organization": "Pennsylvania State University (State)",
    "location": "4205 College Drive (Erie, Pennsylvania)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 8/9/2026",
    "published_date": "02/09/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113527",
    "description": "Associate Professor or Professor of Plant Biology/ Director of Lake Erie Grape Research and Extension Center (LERGREC)\nPennsylvania State University (State) | https://www.psu.edu/\nDetails\nPosting:\nhttps://psu.wd1.myworkdayjobs.com/en-US/PSU_Academic/job/Associate-Professor-or-Professor-of-Plant-Biology--Director-of-Lake-Erie-Grape-Research-and-Extension-Center--LERGREC-_REQ_0000075262-1?locations=52f02272e496018b56ce3eacc501b417\nApplication Deadline:\n03/13/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 8/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 8 years\nLocation:\n4205 College Drive (Erie, Pennsylvania)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPOSITION SPECIFICS\nThe School of Science at Penn State Behrend invites applications for an Associate or Full Professor of Plant Biology and Director of the Lake Erie Regional Grape Research and Extension Center (LERGREC) to begin June 2026. Candidates will be faculty in the biology department at Penn State Behrend and will be jointly appointed with the College of Agricultural Sciences at University Park. The ideal candidate will compliment exisiting department strengths, seek external funding, contribute to our core biology curriculum, and join a collaborative academic community that uniquely blends the supportive atmosphere of a small college with the resources of a world-class R1 university. Teaching expectations include instructing courses in biology, plant biology, plant pathology, plant physiology, and genetics. The successful candidate will be expected to maintain a vibrant research program and mentor undergraduate and graduate students. Startup funds and laboratory space, appropriate to a primarily undergraduate institution, are available. Qualified candidates will hold a Ph.D. in Plant Biology, Phytopathology,Viticulture, or a closely related discipline. They must demonstrate an established record of scholarly achievement appropriate for appointment at the rank of Associate or Full Professor, with at least 8 years of experience in research and teaching. The successful candidate should also have proven success in leading research teams, securing external funding, and supervising personnel or programs.\n\nThe Director of the Lake Erie Regional Grape Research and Extension Center (LERGREC) provides strategic and operational leadership for the Center, ensuring excellence in grape research, extension, and outreach. This role oversees day-to-day center operations, including supervising staff, managing budgets, and coordinating the agricultural calendar for vineyard maintenance, seasonal spraying, and harvest activities. The Director serves as the primary liaison between LERGREC and growers, industry partners, and community stakeholders—hosting field days, workshops, and educational programs, while representing the Center at meetings and conferences. In addition, the Director supports research initiatives, fosters collaboration across Penn State campuses and industry, and develops strategic plans to advance the Center’s impact and sustainability including broadening the scope beyond grapes.  \n\nPenn State Behrend is a four-year undergraduate and graduate college of Penn State University with 4,700 students in four schools; science, engineering, business, and humanities and social science. The School of Science offers B.S. degrees in biology, chemistry, mathematics, nursing, physics, and environmental science. It supports research in the traditional science disciplines, as well as supporting and growing, all-campus research interests in addressing women's health issues, energy and sustainability, and polymer science. In particular, the School's research strengths include Great Lakes research (Pennsylvania Sea Grant) and strong collaborations with Magee-Womens Research Institute (Pittsburgh), both with an emphasis on undergraduate research. LERGREC is a 40-acre agricultural and research facility, located about 15 miles east of Erie, that primarily serves the grape-processing industry, which has a strong presence along the Lake Erie coastline in Pennsylvania and New York. Faculty and staff researchers at LERGREC work on10-20 projects every year, most of which focus on vineyard disease and insect pest management. Available instrumentation includes confocal and environmental scanning electron microscopes, real-time PCR, LCMS, NMR, and GCMS plus access to Penn State University’s extensive life sciences core facilities located at the University Park campus.\n\nErie Pennsylvania, a metropolitan area of 280,000 residents, is a major service, tourism, medical, and industrial center on Lake Erie’s Presque Isle Bay and is located two hours from Cleveland, Pittsburgh, and Buffalo. The region offers many cultural, sports, and recreational resources, as well as modest living costs and affordable housing.\nAll applicants must apply online and submit five documents 1) cover letter including leadership experience that speaks to the role as Director, 2) curriculum vitae including names and contact information for three references, 3) copies of graduate and undergraduate transcripts 4) one page teaching philosophy and 5) one-to-two-page research statement summarizing your proposed research, including a brief explanation of its suitability for an undergraduate college. Questions regarding the position can be directed to Dr. Cora MacBeth, Director, School of Science at cem122@psu.edu.\n\nReview of applications will begin March 13, 2026 and continue until the position is filled. Employment will require successful completion of background check(s) in accordance with university policies.\n\nThe Pennsylvania State University is committed to and accountable for advancing equity, respect, and belonging in all its forms. We embrace individual uniqueness, as well as a culture of belonging that supports both broad and specific equity initiatives, leverages the educational and institutional benefits of inclusion in society, and provides opportunities for engagement intended to help all members of the community thrive. We value belonging as a core strength and an essential element of the university’s teaching, research, and service mission.\n  Contact\nLynne E Beaty\n8148987132\nlzb345@psu.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 8 years",
    "project_details": "Associate Professor or Professor of Plant Biology/ Director of Lake Erie Grape Research and Extension Center (LERGREC)\nPennsylvania State University (State) | https://www. com/en-US/PSU_Academic/job/Associate-Professor-or-Professor-of-Plant-Biology--Director-of-Lake-Erie-Grape-Research-and-Extension-Center--LERGREC-_REQ_0000075262-1. locations=52f02272e496018b56ce3eacc501b417\nApplication Deadline:\n03/13/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 8/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 8 years\nLocation:\n4205 College Drive (Erie, Pennsylvania)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPOSITION SPECIFICS\nThe School of Science at Penn State Behrend invites applications for an Associate or Full Professor of Plant Biology and Director of the Lake Erie Regional Grape Research and Extension Center (LERGREC) to begin June 2026",
    "contact_info": "",
    "application_deadline": "03/13/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 8/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 8 years\nLocation:\n4205 College Drive (Erie, Pennsylvania)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPOSITION SPECIFICS\nThe School of Science at Penn State Behrend invites applications for an Associate or Full Professor of Plant Biology and Director of the Lake Erie Regional Grape Research and Extension Center (LERGREC) to begin June 2026",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": true,
    "university_name": "Pennsylvania State University",
    "scraped_at": "2026-02-15T05:16:32.678333+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Postdoctoral Fellow, Winter Limnology",
    "organization": "University of Missouri-Columbia (State)",
    "location": "Columbia, Missouri",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/13/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113778",
    "description": "Postdoctoral Fellow, Winter Limnology\nUniversity of Missouri-Columbia (State) | https://missouri.edu/\nDetails\nApplication Deadline:\n03/15/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat most 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years\nLocation:\nColumbia, Missouri\nTags:\nFaculty / Post-Doc Appointments\nDescription\n The MU Limnology Lab in the School of Natural Resources at the University of Missouri-Columbia (MU) is seeking an enthusiastic post-doctoral candidate (PDF) to join the On Thin Ice project; an NSF funded collaborative Macrosystems project looking at the implications of shorter winters for the future of freshwater phytoplankton phenology and function. \n\nWe are interested in collaborative and keen candidates that have a strong background in winter limnology, cyanobacteria and cyanotoxins, and comparative limnology. A significant portion of this research will be writing manuscripts with data from the multi-year On Thin Ice project. This year-round field-based project combines data across 93 international networked lakes, 23 gradient lakes, and 6 model lakes with high frequency sensor data. The candidate will also need data management and statistical skills, ideally in the R platform. We offer a competitive salary, medical coverage, and opportunities for professional development. \n\nMinimum Qualification: PhD in Biology, Limnology, or a related field by the time of appointment. \n\nCandidates will be evaluated on: ability to work with year-round limnological data from >100 lakes over multiple years. Scientific communication and writing skills and leadership to oversee this collaborative project with many partners are desired. \n\nApplication Process: Apply online at https://hr.missouri.edu/job-openings, Job ID 58657. To apply, please send: 1) cover letter outlining your background, expertise, and interests, 2) a recent CV, and 3) names & contact information of three individuals that can be available to serve as references. \n\nReview of applications will begin March 1, 2026. \n\nContact: Rebecca North northr@missouri.edu with the subject header ‘Thin Ice PDF position’. \n\nThe University of Missouri is an Equal Opportunity Employer. \n\nContact\nRebecca North\nnorthr@missouri.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat most 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years",
    "project_details": "A significant portion of this research will be writing manuscripts with data from the multi-year On Thin Ice project",
    "contact_info": "",
    "application_deadline": "03/15/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat most 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 4 years\nLocation:\nColumbia, Missouri\nTags:\nFaculty / Post-Doc Appointments\nDescription\n The MU Limnology Lab in the School of Natural Resources at the University of Missouri-Columbia (MU) is seeking an enthusiastic post-doctoral candidate (PDF) to join the On Thin Ice project; an NSF funded collaborative Macrosystems project looking at the implications of shorter winters for the future of freshwater phytoplankton phenology and function",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:33.088559+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "REU, Forest Ecology, Clemson University",
    "organization": "Clemson University (State)",
    "location": "Clemson, South Carolina",
    "salary": "$2,000 per month",
    "starting_date": "between 5/18/2026 and 5/25/2026",
    "published_date": "02/13/2026",
    "tags": "Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113757",
    "description": "REU, Forest Ecology, Clemson University\nClemson University (State)\nDetails\nPosting:\nhttps://www.fridleylab.org/join-us\nApplication Deadline:\n03/21/2026\nPublished:\n02/13/2026\nStarting Date:\nbetween 5/18/2026 and 5/25/2026\nEnding Date:\nbetween 8/7/2026 and 8/14/2026\nHours per Week:\n35 - 40\nSalary:\n$2,000 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nClemson, South Carolina\nTags:\nUndergraduate Opportunities\nDescription\nClemson University: The Fridley Lab at Clemson University is seeking two motivated undergraduate students interested in gaining research experience in plant ecology as part of research teams working in the Great Smoky Mountains and Clemson Experimental Forest. Students will assist staff and graduate students in fieldwork in Clemson, SC, as well as several multi-day trips to the Smokies, about two hours from campus. Students must be able and willing to do some hiking and work off trails in humid conditions. Students will also be involved in a variety of laboratory activities related to plant growth trials, which may include sensor building and statistical analysis, pending student interest. Students will be provided with a $6000 stipend for living expenses over the 12-wk duration starting approximately May 18 (start and end dates are flexible). Qualifications and application instructions are at https://www.fridleylab.org/join-us. Deadline: March 20, 2026. \nContact\nJason Fridley\nfridley@clemson.edu (preferred contact method)",
    "requirements": "Clemson University: The Fridley Lab at Clemson University is seeking two motivated undergraduate students interested in gaining research experience in plant ecology as part of research teams working in the Great Smoky Mountains and Clemson Experimental Forest. Students will assist staff and graduate students in fieldwork in Clemson, SC, as well as several multi-day trips to the Smokies, about two hours from campus. Students must be able and willing to do some hiking and work off trails in humid conditions. Students will also be involved in a variety of laboratory activities related to plant growth trials, which may include sensor building and statistical analysis, pending student interest. Students will be provided with a $6000 stipend for living expenses over the 12-wk duration starting approximately May 18 (start and end dates are flexible). Qualifications and application instructions are at https://www.fridleylab.org/join-us. Deadline: March 20, 2026.",
    "project_details": "org/join-us\nApplication Deadline:\n03/21/2026\nPublished:\n02/13/2026\nStarting Date:\nbetween 5/18/2026 and 5/25/2026\nEnding Date:\nbetween 8/7/2026 and 8/14/2026\nHours per Week:\n35 - 40\nSalary:\n$2,000 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nClemson, South Carolina\nTags:\nUndergraduate Opportunities\nDescription\nClemson University: The Fridley Lab at Clemson University is seeking two motivated undergraduate students interested in gaining research experience in plant ecology as part of research teams working in the Great Smoky Mountains and Clemson Experimental Forest",
    "contact_info": "",
    "application_deadline": "03/21/2026\nPublished:\n02/13/2026\nStarting Date:\nbetween 5/18/2026 and 5/25/2026\nEnding Date:\nbetween 8/7/2026 and 8/14/2026\nHours per Week:\n35 - 40\nSalary:\n$2,000 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nClemson, South Carolina\nTags:\nUndergraduate Opportunities\nDescription\nClemson University: The Fridley Lab at Clemson University is seeking two motivated undergraduate students interested in gaining research experience in plant ecology as part of research teams working in the Great Smoky Mountains and Clemson Experimental Forest",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:33.483165+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "WVDNR Bat Ecologist",
    "organization": "West Virginia Division of Natural Resources (State)",
    "location": "Elkins, West Virginia",
    "salary": "$15 to $17 per hour",
    "starting_date": "between 3/16/2026 and 4/3/2026",
    "published_date": "02/13/2026",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113729",
    "description": "WVDNR Bat Ecologist\nWest Virginia Division of Natural Resources (State) | https://wvdnr.gov/\nDetails\nApplication Deadline:\n02/19/2026\nPublished:\n02/13/2026\nStarting Date:\nbetween 3/16/2026 and 4/3/2026\nEnding Date:\nbetween 12/1/2026 and 12/31/2026\nHours per Week:\n40\nSalary:\n$15 to $17 per hour\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nElkins, West Virginia\nDescription\nThe WV Division of Natural Resources (WVDNR) Rare, Threatened, and Endangered Species Program is hiring a temporary, full-time (1,700 hours) Bat Ecologist; health benefits are optionally available for this position.\n This position will work across West Virginia while conducting bat survey work, with a focus on the Allegheny mountains. Duties will include, but are not limited to, conducting bat surveys (mist-net, harp trap, acoustic); conducting bat telemetry studies (roosting and foraging); implementation of White-nose Syndrome response plans; performing public outreach; equipment management and maintenance; invertebrate specimen processing and identification; environmental monitoring; data entry and data QA/QC.\n This position will be based in the Elkins Operations Center but will involve significant travel across West Virginia, including up to week long overnight travel. Travel expenses and field vehicle will be provided.\n\nKey Responsibilities:\n●        Under direct supervision, implement detailed bat monitoring, survey, and research projects.\n●        Data entry and QA/QC.\n Required Qualifications:\n●        Completion of a Masters Degree at an accredited college or university with a major in wildlife management or related field, or currently enrolled in such a program.\n●        Radio telemetry experience or a sincere desire to learn these techniques.\n●        Experience navigating complex terrain using maps, compass, and GPS.\n Preferred Qualifications:\n●        One to two field seasons of experience conducting bat surveys.\n●        Experience handling bats and conducting mist-netting, harp trapping, and acoustic bat surveys.\n●        Experience processing and managing data.\n●        Caving experience, including ability to read cave maps.\n●        Prior usage of Microsoft Office Suite and/or Google Suite, particularly MS Excel and/or Google Sheets.\n●        Experience using camera traps.\n●        Off-road driving experience.\n Special Requirements:\nA current, up-to date rabies vaccine is required for this position.\nA valid driver’s license is required for this position. \nApplicants must be able to traverse steep, uneven terrain (including at night) and carry up to 45 pounds of equipment up to 4 miles.\n Work Conditions and Housing:\nThis is a field-forward position and the incumbent will work outdoors in highly variable weather and topographic conditions as well as in tight subterranean environments. Approximately one month of the appointment will be spent traveling and working continuously on a primarily second or third shift schedule; field housing, travel, and vehicle will be provided. The remainder of the appointment will be spent working out of the Elkins Operations Center. Free, shared bunk housing may be available at the Elkins Operations Center, which includes access to a full kitchen. Uniforms provided. Work weeks generally will be 40 hours. Flex scheduling, but not overtime, is available.\n Application Materials:\nApplicants should include a current resume or CV detailing the applicant’s education and relevant experience, a cover letter, and contact information for three professional references. Applications should be saved as a single PDF document.\n\nContact\nAlexander Silvis\nalexander.silvis@wv.gov (preferred contact method)",
    "requirements": "Hours per Week:\n40\nSalary:\n$15 to $17 per hour\nEducation Required:\nMasters\nExperience Required:\nat least 2 years",
    "project_details": "Key Responsibilities:\n●        Under direct supervision, implement detailed bat monitoring, survey, and research projects",
    "contact_info": "",
    "application_deadline": "02/19/2026\nPublished:\n02/13/2026\nStarting Date:\nbetween 3/16/2026 and 4/3/2026\nEnding Date:\nbetween 12/1/2026 and 12/31/2026\nHours per Week:\n40\nSalary:\n$15 to $17 per hour\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nElkins, West Virginia\nDescription\nThe WV Division of Natural Resources (WVDNR) Rare, Threatened, and Endangered Species Program is hiring a temporary, full-time (1,700 hours) Bat Ecologist; health benefits are optionally available for this position",
    "is_graduate_position": true,
    "grad_confidence": 0.9,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:34.134682+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Visiting Assistant Professor- Environmental Sciences",
    "organization": "University of Toledo (State)",
    "location": "2801 West Bancroft Street (Toledo, Ohio)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 8/17/2026",
    "published_date": "02/13/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113727",
    "description": "Visiting Assistant Professor- Environmental Sciences\nUniversity of Toledo (State) | https://www.utoledo.edu/nsm/envsciences/\nDetails\nPosting:\nhttps://careers.utoledo.edu/en-us/job/500499/visiting-assistant-professor-environmental-sciences\nApplication Deadline:\n03/15/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 8/17/2026\nEnding Date:\nafter 8/15/2027\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\n2801 West Bancroft Street (Toledo, Ohio)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nTitle: Visiting Assistant Professor- Environmental Sciences\n\nDepartment Org: Environmental Sciences - 101250\nEmployee Classification: F3 - Faculty 9 Month Non AAUP\nBargaining Unit: Other Non AAUP\nWork type: Faculty - Temporary\nLocation: Main Campus - Academic Toledo, OH\nCategories: Full-Time, Academic\n\n Job Description:\n\nThe Department of Environmental Sciences at the University of Toledo invites applications for a Visiting Associate Professor position. We seek a committed and dynamic educator with expertise in one or more areas of environmental science, including: Geological/physical sciences (e.g., geology, hydrology, atmospheric science), Ecology or biology (e.g., ecosystem science, conservation biology, environmental microbiology), or Sustainability (e.g., environmental policy, climate change, sustainable development).\n\nThe VAP is expected to do the following: teach undergraduate environmental science courses, including general education and major-specific offerings; integrate experiential and service learning into coursework through fieldwork, community engagement, or applied projects; advise and mentor students, supporting academic and career development; contribute to curriculum development and departmental service; promote welcoming, student-centered learning environments.\n\nMinimum Qualifications:\n\nA Master’s degree in Environmental Science or a closely related field is required\nDemonstrated excellence in undergraduate teaching, especially using active learning and field-based approaches\nExperience or strong interest in service learning, community-based projects, or applied environmental education\nCommitment to fostering student success\n\nPreferred Qualifications:\n\nPh.D. preferred\n\n \nConditions of Employment:\nTo promote the highest levels of health and well-being, the University of Toledo campuses are tobacco-free. Pre-employment health screening requirements for the University of Toledo Health Science Campus Medical Center will include drug and other required health screenings for the position.\n\n Equal Employment Opportunity Statement:\nThe University of Toledo is an equal opportunity employer. The University of Toledo does not discriminate in employment, educational programs, or activities on the basis of race, color, religion, sex, age, ancestry, national origin, sexual orientation, gender identity and expression, military or veteran status, disability, familial status, or political affiliation.\n\nThe University is dedicated to attracting and retaining the best and brightest talent and fostering a culture of respect.\n\nThe University of Toledo provides reasonable accommodation to individuals with disabilities. If you require accommodation to complete this application, or for testing or interviewing, please contact HR Compliance at hrcompliance@utoledo.edu or 419-530-4747 between the hours of 8:30 a.m. and 5 p.m. or apply online for an accommodation request.\n\nComputer access is available at most public libraries and at the Office of Human Resources located in the Center for Administrative Support on the UToledo Main Campus.\nContact\nRicky Becker\n4195304571\nrichard.becker@utoledo.edu (preferred contact method)",
    "requirements": "Title: Visiting Assistant Professor- Environmental Sciences\n\nDepartment Org: Environmental Sciences - 101250\nEmployee Classification: F3 - Faculty 9 Month Non AAUP\nBargaining Unit: Other Non AAUP\nWork type: Faculty - Temporary\nLocation: Main Campus - Academic Toledo, OH\nCategories: Full-Time, Academic\n\n Job Description:\n\nThe Department of Environmental Sciences at the University of Toledo invites applications for a Visiting Associate Professor position. We seek a committed and dynamic educator with expertise in one or more areas of environmental science, including: Geological/physical sciences (e.g., geology, hydrology, atmospheric science), Ecology or biology (e.g., ecosystem science, conservation biology, environmental microbiology), or Sustainability (e.g., environmental policy, climate change, sustainable development).\n\nThe VAP is expected to do the following: teach undergraduate environmental science courses, including general education and major-specific offerings; integrate experiential and service learning into coursework through fieldwork, community engagement, or applied projects; advise and mentor students, supporting academic and career development; contribute to curriculum development and departmental service; promote welcoming, student-centered learning environments.\n\nMinimum Qualifications:\n\nA Master’s degree in Environmental Science or a closely related field is required\nDemonstrated excellence in undergraduate teaching, especially using active learning and field-based approaches\nExperience or strong interest in service learning, community-based projects, or applied environmental education\nCommitment to fostering student success\n\nPreferred Qualifications:\n\nPh.D. preferred\n\n \nConditions of Employment:\nTo promote the highest levels of health and well-being, the University of Toledo campuses are tobacco-free. Pre-employment health screening requirements for the University of Toledo Health Science Campus Medical Center will include drug and other required health screenings for the position.\n\n Equal Employment Opportunity Statement:\nThe University of Toledo is an equal opportunity employer. The University of Toledo does not discriminate in employment, educational programs, or activities on the basis of race, color, religion, sex, age, ancestry, national origin, sexual orientation, gender identity and expression, military or veteran status, disability, familial status, or political affiliation.\n\nThe University is dedicated to attracting and retaining the best and brightest talent and fostering a culture of respect.\n\nThe University of Toledo provides reasonable accommodation to individuals with disabilities. If you require accommodation to complete this application, or for testing or interviewing, please contact HR Compliance at hrcompliance@utoledo.edu or 419-530-4747 between the hours of 8:30 a.m. and 5 p.m. or apply online for an accommodation request.\n\nComputer access is available at most public libraries and at the Office of Human Resources located in the Center for Administrative Support on the UToledo Main Campus.",
    "project_details": "The VAP is expected to do the following: teach undergraduate environmental science courses, including general education and major-specific offerings; integrate experiential and service learning into coursework through fieldwork, community engagement, or applied projects; advise and mentor students, supporting academic and career development; contribute to curriculum development and departmental service; promote welcoming, student-centered learning environments. Minimum Qualifications:\n\nA Master’s degree in Environmental Science or a closely related field is required\nDemonstrated excellence in undergraduate teaching, especially using active learning and field-based approaches\nExperience or strong interest in service learning, community-based projects, or applied environmental education\nCommitment to fostering student success\n\nPreferred Qualifications:\n\nPh",
    "contact_info": "",
    "application_deadline": "03/15/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 8/17/2026\nEnding Date:\nafter 8/15/2027\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nnone\nLocation:\n2801 West Bancroft Street (Toledo, Ohio)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nTitle: Visiting Assistant Professor- Environmental Sciences\n\nDepartment Org: Environmental Sciences - 101250\nEmployee Classification: F3 - Faculty 9 Month Non AAUP\nBargaining Unit: Other Non AAUP\nWork type: Faculty - Temporary\nLocation: Main Campus - Academic Toledo, OH\nCategories: Full-Time, Academic\n\n Job Description:\n\nThe Department of Environmental Sciences at the University of Toledo invites applications for a Visiting Associate Professor position",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.222,
    "discipline_keywords": [
      "environmental policy",
      "community engagement",
      "environmental education"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:34.232027+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Postdoctoral Research Fellow – Gulf Coast Resilience",
    "organization": "Auburn University - College of Forestry, Wildlife & Environment (State)",
    "location": "602 Duncan Dr. (Auburn, Alabama)",
    "salary": "starting at $55,000 per year",
    "starting_date": "after 4/1/2026",
    "published_date": "02/11/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=112004",
    "description": "Postdoctoral Research Fellow – Gulf Coast Resilience\nAuburn University - College of Forestry, Wildlife & Environment (State) | https://cfwe.auburn.edu/\nDetails\nApplication Deadline:\n02/16/2026\nPublished:\n02/11/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\n40\nSalary:\nstarting at $55,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\n602 Duncan Dr. (Auburn, Alabama)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition Description\nThe Collaborative Conservation & Adaptation Planning and the Wetland and Riparian Ecology labs at Auburn University are seeking a full-time Postdoctoral Research Fellow to join the “Building the resilience of Gulf Coast blue economies in a changing world: A multiple case study” research initiative, which has been recommended for funding by Mississippi Alabama Sea Grant (*this post was made in anticipation of receiving final approval from the NOAA grants office). This mixed-methods project will constructively evaluate the long-term impacts of Sea Grant’s Gulf Resilience Community of Practice (CoP) and explore how resilience is understood, experienced, and implemented across a spectrum of coastal economies in Mississippi and Alabama.\n\nThe postdoc will work closely with Dr. Matthew Jurjonas (PI and Assistant Professor, Conservation Social Science) and Dr. Chris Anderson (Co-PI and Professor, Coastal Wetland Ecology) to co-lead project implementation. The position emphasizes community-based fieldwork, qualitative interviewing, focus groups, and comparative case study analysis, with three focal communities who have already expressed support for the project—representing a range of traditional, hybrid, and tourism-based blue economies. In addition, this position will help co-design a workshop at the CoP annual meeting designed to share results, foster dialogue, and strategize new directions for today’s changing coastal resilience context toward the end of the project.\n\nThe position will start in the Spring 2026, and the starting salary is $55,000. In addition, the position includes an annual research and travel budget to support fieldwork, professional development, and dissemination activities.\n\nKey Responsibilities\nDevelop and implement a program evaluation protocol that constructively evaluates the impact, potential opportunities, and future directions of the Resilience CoP.  \nCollaboratively refine and implement a robust qualitative multiple case study design based on Yin’s methodology in three Gulf Coast Communities\nYin, R. K. (2018). Case study research and applications (Vol. 6). Thousand Oaks, CA: Sage.\nFacilitate ongoing coordination with Resilience Extensionists and Gulf Resilience CoP members.\nSupport the design and implementation of a co-produced workshop hosted in conjunction with the Gulf Resilience CoP annual meeting.\nContribute to the development of peer-reviewed publications, a practitioner-focused policy brief, and outreach materials.\nParticipate in regular team meetings, project planning, and stakeholder engagement.\nPresent findings at national and regional conferences (e.g., Gulf of America Alliance, Social Coast Forum, International Association for Society and Natural Resources).\n\nQualifications\nRequired:\nPhD in Environmental Social Science, Human Dimensions, Geography, Sociology, Public Policy, or a related field by the start date.\nDemonstrated experience conducting qualitative research (e.g., interviews, coding, case study design).\nStrong writing skills with a track record of scholarly publication.\nInterest in community resilience, adaptation, and coastal blue economies.\nExperience working with diverse partners, including government agencies, extension, and NGOs.\nInterest in contributing to the CCAP lab’s culture of collaborative community-engaged science. \nPreferred:\nFamiliarity with social-ecological systems frameworks and resilience theory.\nPrior experience with participatory or community-engaged research.\nPrior experience working in coastal communities, the Gulf South, or with Coastal Extension networks.\n\nHow to Apply\nInterested individuals should contact Dr. Matthew Jurjonas at mdj0048@auburn.edu with any questions . All applications must be submitted via AU Employment at https://www.auemployment.com/postings/57889 and include the following: \n1.      A Cover Letter/Statement of Interest (2-page max) detailing research interests and relevant experience for the project focus outlined above. \n2.      A CV/Resume\n3.      A Writing Sample (e.g., thesis chapter, published research paper, or technical report)\n4.      The names and email addresses for three professional references\n\nApplication Deadline: Review of Applications will begin on February 16th, 2026, and continue until the position is filled.\n\nAbout the Collaborative Conservation & Adaptation Planning Lab\nThe Collaborative Conservation & Adaptation Planning Lab focuses on community sustainability, climate justice, and resilience in rural, natural resource-dependent communities. Rooted in participatory research, the lab explores how conservation programs and government interventions impact local communities, examining barriers, justice issues, and unintended consequences. Through immersive fieldwork, stakeholder engagement, and mixed methods such as interviews, focus groups, and surveys, the lab seeks to co-develop research questions and deliver actionable insights for policy and extension efforts. By integrating environmental justice with conservation science, the lab aims to inform equitable resilience strategies, support underserved communities, and enhance sustainability efforts across the Southeastern U.S. and beyond. \n\nAbout Auburn University\nAuburn University, located in Auburn, Alabama, is a public research university with a rich history dating back to its founding in 1856. Recognized for its commitment to academic excellence, Auburn is home to diverse and vibrant campus life, offering a wide array of programs and opportunities for students. The university is dedicated to advancing knowledge through research, scholarship, and outreach, fostering a culture of innovation and discovery. Auburn's picturesque campus is renowned for its beautiful architecture, expansive green spaces, and state-of-the-art facilities, providing an inspiring setting for academic and personal growth. Auburn University is a Land, Sea, and Space Grant institution, one of 17 institutions in the U.S. holding this distinction. \n\nAbout the College of Forestry, Wildlife & Environment\nThe College of Forestry, Wildlife and Environment at Auburn University is a leader in the fields of natural resource management, conservation, and environmental studies. The College is committed to providing high-quality education, conducting cutting-edge research, and engaging in meaningful outreach to address the complex challenges facing our natural world. Faculty in the College work collaboratively on a wide range of projects, with expertise including wildlife ecology and management, forestry, sustainable biomaterials and packaging, parks and recreation management, geospatial and environmental informatics, and environmental conservation and management. The College's interdisciplinary approach ensures that students receive a well-rounded education that prepares them for successful careers in academia, industry, and public service. For more information about the College, visit https://cfwe.auburn.edu.\n\nContact\nMatthew Jurjonas\nmdj0048@auburn.edu (preferred contact method)",
    "requirements": "Position Description\nThe Collaborative Conservation & Adaptation Planning and the Wetland and Riparian Ecology labs at Auburn University are seeking a full-time Postdoctoral Research Fellow to join the “Building the resilience of Gulf Coast blue economies in a changing world: A multiple case study” research initiative, which has been recommended for funding by Mississippi Alabama Sea Grant (*this post was made in anticipation of receiving final approval from the NOAA grants office). This mixed-methods project will constructively evaluate the long-term impacts of Sea Grant’s Gulf Resilience Community of Practice (CoP) and explore how resilience is understood, experienced, and implemented across a spectrum of coastal economies in Mississippi and Alabama.\n\nThe postdoc will work closely with Dr. Matthew Jurjonas (PI and Assistant Professor, Conservation Social Science) and Dr. Chris Anderson (Co-PI and Professor, Coastal Wetland Ecology) to co-lead project implementation. The position emphasizes community-based fieldwork, qualitative interviewing, focus groups, and comparative case study analysis, with three focal communities who have already expressed support for the project—representing a range of traditional, hybrid, and tourism-based blue economies. In addition, this position will help co-design a workshop at the CoP annual meeting designed to share results, foster dialogue, and strategize new directions for today’s changing coastal resilience context toward the end of the project.\n\nThe position will start in the Spring 2026, and the starting salary is $55,000. In addition, the position includes an annual research and travel budget to support fieldwork, professional development, and dissemination activities.\n\nKey Responsibilities\nDevelop and implement a program evaluation protocol that constructively evaluates the impact, potential opportunities, and future directions of the Resilience CoP.  \nCollaboratively refine and implement a robust qualitative multiple case study design based on Yin’s methodology in three Gulf Coast Communities\nYin, R. K. (2018). Case study research and applications (Vol. 6). Thousand Oaks, CA: Sage.\nFacilitate ongoing coordination with Resilience Extensionists and Gulf Resilience CoP members.\nSupport the design and implementation of a co-produced workshop hosted in conjunction with the Gulf Resilience CoP annual meeting.\nContribute to the development of peer-reviewed publications, a practitioner-focused policy brief, and outreach materials.\nParticipate in regular team meetings, project planning, and stakeholder engagement.\nPresent findings at national and regional conferences (e.g., Gulf of America Alliance, Social Coast Forum, International Association for Society and Natural Resources).\n\nQualifications\nRequired:\nPhD in Environmental Social Science, Human Dimensions, Geography, Sociology, Public Policy, or a related field by the start date.\nDemonstrated experience conducting qualitative research (e.g., interviews, coding, case study design).\nStrong writing skills with a track record of scholarly publication.\nInterest in community resilience, adaptation, and coastal blue economies.\nExperience working with diverse partners, including government agencies, extension, and NGOs.\nInterest in contributing to the CCAP lab’s culture of collaborative community-engaged science. \nPreferred:\nFamiliarity with social-ecological systems frameworks and resilience theory.\nPrior experience with participatory or community-engaged research.\nPrior experience working in coastal communities, the Gulf South, or with Coastal Extension networks.\n\nHow to Apply\nInterested individuals should contact Dr. Matthew Jurjonas at mdj0048@auburn.edu with any questions . All applications must be submitted via AU Employment at https://www.auemployment.com/postings/57889 and include the following: \n1.      A Cover Letter/Statement of Interest (2-page max) detailing research interests and relevant experience for the project focus outlined above. \n2.      A CV/Resume\n3.      A Writing Sample (e.g., thesis chapter, published research paper, or technical report)\n4.      The names and email addresses for three professional references\n\nApplication Deadline: Review of Applications will begin on February 16th, 2026, and continue until the position is filled.\n\nAbout the Collaborative Conservation & Adaptation Planning Lab\nThe Collaborative Conservation & Adaptation Planning Lab focuses on community sustainability, climate justice, and resilience in rural, natural resource-dependent communities. Rooted in participatory research, the lab explores how conservation programs and government interventions impact local communities, examining barriers, justice issues, and unintended consequences. Through immersive fieldwork, stakeholder engagement, and mixed methods such as interviews, focus groups, and surveys, the lab seeks to co-develop research questions and deliver actionable insights for policy and extension efforts. By integrating environmental justice with conservation science, the lab aims to inform equitable resilience strategies, support underserved communities, and enhance sustainability efforts across the Southeastern U.S. and beyond. \n\nAbout Auburn University\nAuburn University, located in Auburn, Alabama, is a public research university with a rich history dating back to its founding in 1856. Recognized for its commitment to academic excellence, Auburn is home to diverse and vibrant campus life, offering a wide array of programs and opportunities for students. The university is dedicated to advancing knowledge through research, scholarship, and outreach, fostering a culture of innovation and discovery. Auburn's picturesque campus is renowned for its beautiful architecture, expansive green spaces, and state-of-the-art facilities, providing an inspiring setting for academic and personal growth. Auburn University is a Land, Sea, and Space Grant institution, one of 17 institutions in the U.S. holding this distinction. \n\nAbout the College of Forestry, Wildlife & Environment\nThe College of Forestry, Wildlife and Environment at Auburn University is a leader in the fields of natural resource management, conservation, and environmental studies. The College is committed to providing high-quality education, conducting cutting-edge research, and engaging in meaningful outreach to address the complex challenges facing our natural world. Faculty in the College work collaboratively on a wide range of projects, with expertise including wildlife ecology and management, forestry, sustainable biomaterials and packaging, parks and recreation management, geospatial and environmental informatics, and environmental conservation and management. The College's interdisciplinary approach ensures that students receive a well-rounded education that prepares them for successful careers in academia, industry, and public service. For more information about the College, visit https://cfwe.auburn.edu.",
    "project_details": "Postdoctoral Research Fellow – Gulf Coast Resilience\nAuburn University - College of Forestry, Wildlife & Environment (State) | https://cfwe. (Auburn, Alabama)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition Description\nThe Collaborative Conservation & Adaptation Planning and the Wetland and Riparian Ecology labs at Auburn University are seeking a full-time Postdoctoral Research Fellow to join the “Building the resilience of Gulf Coast blue economies in a changing world: A multiple case study” research initiative, which has been recommended for funding by Mississippi Alabama Sea Grant (*this post was made in anticipation of receiving final approval from the NOAA grants office). In addition, the position includes an annual research and travel budget to support fieldwork, professional development, and dissemination activities",
    "contact_info": "",
    "application_deadline": "02/16/2026\nPublished:\n02/11/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\n40\nSalary:\nstarting at $55,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\n602 Duncan Dr",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.309,
    "discipline_keywords": [
      "natural resources",
      "resource management",
      "forestry",
      "recreation",
      "human dimensions"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:34.328357+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Training Opportunity in Soybean Germplasm Curation Management and Data Science",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Urbana, Illinois",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 4/1/2026",
    "published_date": "02/10/2026",
    "tags": "Faculty / Post-Doc Appointments, Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113609",
    "description": "USDA-ARS Training Opportunity in Soybean Germplasm Curation Management and Data Science\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-MWA-2026-0066\nApplication Deadline:\n04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nUrbana, Illinois\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: A research opportunity is currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), Soybean Maize Germplasm Pathology and Genetics Research Unit, located in Urbana, Illinois.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nResearch Project: This fellowship will focus on germplasm curation, including maintenance, regeneration, distribution, and quality control. Under the guidance of a mentor, the participant will optimize workflows for phenotypic germplasm data collection and seek to improve germplasm use efficiency. The participant will gain experience using multiple databases for inventorying, tracking distributions, and managing phenotypic data to maintain identity preservation of the soybean germplasm collection holdings, and will have opportunities to improve database utilization. Under mentorship, the participant will conduct experiments for phenotypic germplasm evaluation using mobile devices and high-throughput methods such as drones.  Phenotypic evaluation will align agronomic traits with allele frequency using advanced statistics. The participant will have the opportunity to collaborate with the soybean breeding community to define scientific thresholds for duplicate germplasm accessions that supports genetic diversity while removing redundancy. The participant will learn how phenotypic datasets are integrated with genomic data for association analyses, genomic selection, and AI-driven methods, including machine learning and deep learning, to enhance germplasm utilization.\n\nLearning Objectives: During this appointment, the participant will learn or enhance their skills in the following:\n\nApply principles of germplasm management and genetic diversity to real-world soybean genetic resource and breeding challenges.\nGain hands-on experience with mobile and drone-based phenotypic data collection and quality control workflows.\nDevelop skills in data integration for genomic association studies, genomic selection, and AI-driven predictive modeling.\nLearn to implement machine learning and deep learning approaches for optimizing germplasm use efficiency.\nStrengthen scientific communication, collaboration, and confidence through preparation of technical reports and collaborative projects.\nEnhance problem-solving and critical thinking skills while working in a multidisciplinary research environment.\nMentor(s): The mentors for this opportunity are Zhanyou Xu (Zhanyou.Xu@usda.gov), Lilian Miranda (lilian.miranda@usda.gov), and Neha Kothari (neha.kothari@usda.gov). If you have questions about the nature of the research, please contact the mentors.\n\nAnticipated Appointment Start Date: April 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for one year but may be renewed upon recommendation of ARS and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $53,208 – $70,000 annually.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Midwest@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a bachelor's, master's, or doctoral degree in the one of the relevant fields.\n\nPreferred Skills:\n\nExperience in plant science and/or plant breeding, including management of field plot trials, data collection, and database management.\nExperience in large data analyses\nExperience with operation optimization\nExperience with machine learning, image analysis\nExperience with model development and optimization\nExperience with drone flying\nExperience with robots and coding\nKnowledge of plant breeding, genetics, statistics, agronomy, plant physiology, plant pathology, or related field.\nStrong communication skills and academic journal publishing.\n  Contact\nUSDA-ARS-MWA-2026-0066\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "ARS Office/Lab and Location: A research opportunity is currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), Soybean Maize Germplasm Pathology and Genetics Research Unit, located in Urbana, Illinois. The Agricultural Research Service (ARS) is the U",
    "contact_info": "",
    "application_deadline": "04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nUrbana, Illinois\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:34.448391+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Principal Investigator - Cultural Resources Site Investigations",
    "organization": "A.I.S. Inc. (Private)",
    "location": "remote work allowed",
    "salary": "$70,000 to $90,000 per year",
    "starting_date": "after 4/1/2026",
    "published_date": "02/13/2026",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113776",
    "description": "Principal Investigator - Cultural Resources Site Investigations\nA.I.S. Inc. (Private) | https://aisobservers.com/careers/\nDetails\nPosting:\nhttps://aisobservers.com/careers\nApplication Deadline:\n03/13/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\n$70,000 to $90,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nremote work allowed\nTags:\nGraduate Opportunities\nDescription\n A.I.S., Inc. (AIS) is a national scientific services firm supporting maritime activities requiring certification of compliance with environmental regulations as well as collecting data for use by Federal, State, Municipal, and other government agencies along the US coastline. AIS is looking for a Principal Investigator to support Cultural Resources Site Investigations in Massachusetts.\n\nPrimary Function:\nThe Principal Investigator (PI) serves as the senior technical authority responsible for the planning, execution, quality control, and regulatory compliance of cultural resources site investigations conducted under the USDA Natural Resources Conservation Service (NRCS) Massachusetts Blanket Purchase Agreement (BPA).\n The PI is accountable for the scientific validity, professional integrity, and regulatory sufficiency of all deliverables, including Above-Ground Resource Surveys and Phase 1A and Phase 1B Archaeological Investigations performed in compliance with NHPA Section 106, NEPA, Massachusetts Historical Commission (MHC) standards, and NRCS policy.\n\nDuties/Responsibilities:\nProvide senior technical oversight and interdisciplinary team leadership across archaeological, architectural history, and historical research components.\nPerform final quality control and technical review of all deliverables to ensure compliance with NHPA Section 106, NEPA, Secretary of the Interior’s Standards, NRCS policy, and Massachusetts Historical Commission requirements.\nOversee and direct field investigations, including Above-Ground Resource Surveys and Phase 1A and Phase 1B archaeological investigations, to identify, assess, and evaluate cultural resources or the potential for resources.\nDirect the collection, analysis, and interpretation of cultural, archaeological, and geospatial data; formulate defensible findings, recommendations, and solutions for complex regulatory or technical issues.\nServe as the Principal Investigator of record, accountable for the accuracy, validity, and professional integrity of all reports and findings.\nInterface directly with clients, regulatory agencies, and external stakeholders, including NRCS staff, SHPO, and consulting parties, to support project coordination and regulatory review.\nTrain, mentor, and technically guide field staff, crew chiefs, and junior professionals; actively support staff development and adherence to professional standards.\nMaintain current knowledge of federal, state, and local regulations affecting cultural resources management, as well as emerging industry best practices and methodological advances.\nSupport project planning and execution by advising on permitting strategies, field methodologies, schedules, and risk management related to cultural resources compliance.\n\nCompensation: Candidates will be paid an hourly rate to be negotiated, and total compensation will vary depending on candidates’ depth of experience. This is a full–time position. AIS benefits package includes health and dental insurance, vacation, sick and holiday benefits.\n Minimum Qualifications:\nMaster’s degree or Ph.D. in Archaeology, Anthropology, History, Architectural History, or a closely related field.\nMust meet Secretary of the Interior (SOI) Professional Qualification Standards in Archaeology and/or Architectural History as applicable\nMinimum 2 years of progressive experience conducting and managing cultural resources investigations.\n\nPreferred Qualifications:\nExperience leading or contributing to quality control plans (QCPs) and internal peer-review processes for deliverables.\nProficiency with GIS platforms and geospatial analysis tools used in archaeological and cultural resources investigations.\nDemonstrated ability to manage multiple concurrent task orders, balance schedules and resources, and meet strict regulatory deadlines.\nStrong interpersonal skills and experience interfacing with federal clients, SHPO staff, consulting parties, and interdisciplinary technical teams.\n Travel:\nReimbursed at an hourly rate along with compensation for miles accrued on a personal vehicle.\nTravel Estimated: 25%\n Location:\nRemote (must live in Massachusetts)\n Contact:\nIf you would like to apply for this exciting new opening, please visit our Careers Page to submit the required information:\n Resume\nCover letter detailing relevant experience.\n3 professional references (name, email address and phone number)\n All documents must be submitted for your application to be considered. If you have any questions pertaining to this opening, please reach out to our Talent Team or call 774-770-5833.\n\nAn Equal Opportunity Employer\nIt is the policy of A.I.S. to recruit, hire, train, promote, transfer and compensate our employees and provide all other conditions of employment including Company sponsored events without regard to race, color, creed, religion, national origin, age, sex, gender identity, genetic information, marital status, lawful alien status, sexual orientation, physical or mental disability, citizenship status, veteran status or any other status protected by applicable law.\n Must be able to work in the U.S. • VEVRAA Federal Contractor • Request Priority Protected Veteran Referrals • Equal Opportunity Employer \nContact\nWilliam M Byrd\n7747705833\nwilliamb@aisobservers.com (preferred contact method)",
    "requirements": "Provide senior technical oversight and interdisciplinary team leadership across archaeological, architectural history, and historical research components.\nPerform final quality control and technical review of all deliverables to ensure compliance with NHPA Section 106, NEPA, Secretary of the Interior’s Standards, NRCS policy, and Massachusetts Historical Commission requirements.\nOversee and direct field investigations, including Above-Ground Resource Surveys and Phase 1A and Phase 1B archaeological investigations, to identify, assess, and evaluate cultural resources or the potential for resources.\nDirect the collection, analysis, and interpretation of cultural, archaeological, and geospatial data; formulate defensible findings, recommendations, and solutions for complex regulatory or technical issues.\nServe as the Principal Investigator of record, accountable for the accuracy, validity, and professional integrity of all reports and findings.\nInterface directly with clients, regulatory agencies, and external stakeholders, including NRCS staff, SHPO, and consulting parties, to support project coordination and regulatory review.\nTrain, mentor, and technically guide field staff, crew chiefs, and junior professionals; actively support staff development and adherence to professional standards.\nMaintain current knowledge of federal, state, and local regulations affecting cultural resources management, as well as emerging industry best practices and methodological advances.\nSupport project planning and execution by advising on permitting strategies, field methodologies, schedules, and risk management related to cultural resources compliance.",
    "project_details": "Duties/Responsibilities:\nProvide senior technical oversight and interdisciplinary team leadership across archaeological, architectural history, and historical research components",
    "contact_info": "",
    "application_deadline": "03/13/2026\nPublished:\n02/13/2026\nStarting Date:\nafter 4/1/2026\nHours per Week:\nat least 40\nSalary:\n$70,000 to $90,000 per year\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nremote work allowed\nTags:\nGraduate Opportunities\nDescription\n A",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:34.946063+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "USDA-ARS Student Internships in Aquaculture Research",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Leetown, West Virginia",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 3/1/2026",
    "published_date": "02/10/2026",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113610",
    "description": "USDA-ARS Student Internships in Aquaculture Research\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-ARS-NEA-2026-0065\nApplication Deadline:\n04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\n20 - 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nLeetown, West Virginia\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis.\n\nARS Office/Lab and Location: Four student research internship opportunities are currently available with the U.S. Department of Agriculture (USDA), Agricultural Research Service (ARS), National Center for Cool and Cold Water Aquaculture (NCCCWA), located in Leetown, West Virginia.\n\nThe Agricultural Research Service (ARS) is the U.S. Department of Agriculture's chief scientific in-house research agency with a mission to find solutions to agricultural problems that affect Americans every day from field to table. ARS will deliver cutting-edge, scientific tools and innovative solutions for American farmers, producers, industry, and communities to support the nourishment and well-being of all people; sustain our nation’s agroecosystems and natural resources; and ensure the economic competitiveness and excellence of our agriculture. The vision of the agency is to provide global leadership in agricultural discoveries through scientific excellence.\n\nThe National Center for Cool and Cold Water Aquaculture (NCCCWA) is located in Leetown, West Virginia. The mission of the NCCCWA is to enhance the nation's aquaculture production of cool and cold-water fish species by developing improved germplasm and technologies that increase farm efficiency, product quality, and environmental sustainability. Research encompasses genetics, genomics, physiology, aquatic animal health, microbiology, and aquaculture engineering.\n\nResearch Project: The participant will be involved in processes to improve fish health and the efficiency of aquaculture production.\n\nLearning Objectives: The selected participants will receive training and participate in hands-on research activities at the ARS NCCCWA including fish health, microbiology, animal husbandry and welfare, fish hatchery rearing protocols, fish physiology, molecular biology, genetics and genomics.\n\nMentor(s): The mentors for this opportunity are Yniv Palti (yniv.palti@ars.usda.gov), Tim Welch (tim.welch@usda.gov), Beth Cleveland (beth.cleveland@usda.gov) and Mark Hostuttler (mark.hostuttler@usda.gov). If you have questions about the nature of the research, please contact the mentors.\n\nAnticipated Appointment Start Date: March 1, 2026. Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be for six months or less, without renewal.\n\nLevel of Participation: The appointment is part time or full time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $355.60 - $711.20 weekly.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens only.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and ARS. Participants do not become employees of USDA, ARS, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process, please email ORISE.ARS.Northeast@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received an associate's, bachelor's, or master's degree in the one of the relevant fields (life sciences, or agriculture, or medicine). \n\nContact\nUSDA-ARS-NEA-2026-0065\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens only.",
    "project_details": "USDA-ARS Student Internships in Aquaculture Research\nOak Ridge Associated Universities (ORAU) (Private) | https://orise. ARS Office/Lab and Location: Four student research internship opportunities are currently available with the U. Department of Agriculture (USDA), Agricultural Research Service (ARS), National Center for Cool and Cold Water Aquaculture (NCCCWA), located in Leetown, West Virginia",
    "contact_info": "",
    "application_deadline": "04/10/2026\nPublished:\n02/10/2026\nStarting Date:\nafter 3/1/2026\nHours per Week:\n20 - 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nLeetown, West Virginia\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\n *Applications are reviewed on a rolling-basis",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:38.176173+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  },
  {
    "title": "Assistant/Associate Professor of Forest Ecology and Health",
    "organization": "Louisiana Tech University (State)",
    "location": "Louisiana Tech University, School of Ag and Forestry (Ruston, Louisiana)",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 2/9/2026",
    "published_date": "02/09/2026",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=113538",
    "description": "Assistant/Associate Professor of Forest Ecology and Health\nLouisiana Tech University (State) | https://ulsltu.wd503.myworkdayjobs.com/en-US/LATECHCareers/job/Ruston%2C-La/Assistant-Professor-in-Forest-Health-and-Ecology_R-1319?q=r-1319\nDetails\nPosting:\nhttps://ulsltu.wd503.myworkdayjobs.com/en-US/LATECHCareers/job/Ruston%2C-La/Assistant-Professor-in-Forest-Health-and-Ecology_R-1319?q=r-1319\nApplication Deadline:\n08/03/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 2/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nLouisiana Tech University, School of Ag and Forestry (Ruston, Louisiana)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition:   Nine-month, tenure-track appointment, 60% teaching, 35% research, 5% service.  Salary: commensurate with qualifications and experience.  Summer salary may be available.\n\nQualifications:  A Ph.D. in forest ecology, forest health, entomology, plant or tree pathology, or other related discipline. At least one degree in forestry or natural resources management is preferred. Applicant must have a significant interest, experience, and expertise in forest ecology or forest health. Particular experience in ecological aspects of forest entomology and/or pathology is strongly desired. A strong commitment to undergraduate education, teaching, and interacting with students is requisite for the position. A demonstrated ability to conduct research (e.g., design studies, analyze and interpret data, publish manuscripts in professional journals, transfer information to users) is required. A Ph.D. is required, however applicants with considerable progress toward completion of their doctoral degree (A.B.D.) will be considered. Candidate must complete the terminal degree within one year of their initial appointment.  The candidate selected for this position must be able to meet eligibility requirements for work in the United States at the time the appointment is scheduled to begin and continue working legally throughout the term of employment. Excellent written and interpersonal communication skills are required.\nResponsibilities: The successful candidate will be expected to teach, conduct research, and assist in the School’s overall mission. Duties will include (1) a major commitment to undergraduate instruction in courses in forest ecology, forest health, and other areas of expertise as needed or desired, which could include coursework in forest/agricultural pests or pathogens; (2) developing a focused applied research program; (3) seeking and securing external funding; and (4) participation in outreach activities. The successful applicant will be expected to build an externally funded research program and work with clients in the region, as well as in cooperation with Unit and College faculty. The successful candidate will help recruit and advise undergraduate students, direct graduate students, serve on School, College, and University committees, and participate in professional and/or scientific societies.\n\nGeneral Information:  The School of Agricultural Sciences and Forestry offers undergraduate degrees in Forestry (BSF), Geographic Information Science (BS), Agricultural Business (BS), and Animal Science (BS), has 17 faculty members, and 375 undergraduate students.  The BSF is accredited by the Society of American Foresters.  The School is in the College of Applied and Natural Science, which has 66 faculty, 34 staff and 1,665 students.  Louisiana Tech University, which is located in Ruston, Louisiana, has an enrollment of approximately 12,500 students.  Located in northern Louisiana’s rolling hills, the Ruston area (population ~48,000) is a vibrant rural college town, with major airports and other metropolitan services located nearby in Monroe and Shreveport.  For more information about the University, visit www.latech.edu.\n\nApplication Procedures:  Apply at https://ulsltu.wd1.myworkdayjobs.com/LATECHCareers. Attach (1) cover letter, (2) curriculum vitae, (3) university transcripts (unofficial), (4) 1-page statement of teaching philosophy and experience, and (5) a list of three professional references with contact details. Applications will be accepted until the position has been filled. Screening of applicants begins April 1, 2025, and completed applications as of that date will receive full consideration. The anticipated starting date of September 2, 2025, is flexible and may be negotiated. For more information about the position and its responsibilities, contact Dr. Joshua Adams, Forestry Program Chair at adamsj@latech.edu or (318) 257-4457.\n\nLouisiana Tech is an Equal Opportunity/Affirmative Action/ADA Employer and places a high priority on the creation of an environment supportive of ethnic minorities, women, veterans, and persons with disabilities.\n\nPosting Close Date: This position will remain open until filled.\nContact\nJoshua Adams\n318-257-4457\nadamsj@latech.edu (preferred contact method)",
    "requirements": "Position:   Nine-month, tenure-track appointment, 60% teaching, 35% research, 5% service.  Salary: commensurate with qualifications and experience.  Summer salary may be available.\n\nQualifications:  A Ph.D. in forest ecology, forest health, entomology, plant or tree pathology, or other related discipline. At least one degree in forestry or natural resources management is preferred. Applicant must have a significant interest, experience, and expertise in forest ecology or forest health. Particular experience in ecological aspects of forest entomology and/or pathology is strongly desired. A strong commitment to undergraduate education, teaching, and interacting with students is requisite for the position. A demonstrated ability to conduct research (e.g., design studies, analyze and interpret data, publish manuscripts in professional journals, transfer information to users) is required. A Ph.D. is required, however applicants with considerable progress toward completion of their doctoral degree (A.B.D.) will be considered. Candidate must complete the terminal degree within one year of their initial appointment.  The candidate selected for this position must be able to meet eligibility requirements for work in the United States at the time the appointment is scheduled to begin and continue working legally throughout the term of employment. Excellent written and interpersonal communication skills are required.\nResponsibilities: The successful candidate will be expected to teach, conduct research, and assist in the School’s overall mission. Duties will include (1) a major commitment to undergraduate instruction in courses in forest ecology, forest health, and other areas of expertise as needed or desired, which could include coursework in forest/agricultural pests or pathogens; (2) developing a focused applied research program; (3) seeking and securing external funding; and (4) participation in outreach activities. The successful applicant will be expected to build an externally funded research program and work with clients in the region, as well as in cooperation with Unit and College faculty. The successful candidate will help recruit and advise undergraduate students, direct graduate students, serve on School, College, and University committees, and participate in professional and/or scientific societies.\n\nGeneral Information:  The School of Agricultural Sciences and Forestry offers undergraduate degrees in Forestry (BSF), Geographic Information Science (BS), Agricultural Business (BS), and Animal Science (BS), has 17 faculty members, and 375 undergraduate students.  The BSF is accredited by the Society of American Foresters.  The School is in the College of Applied and Natural Science, which has 66 faculty, 34 staff and 1,665 students.  Louisiana Tech University, which is located in Ruston, Louisiana, has an enrollment of approximately 12,500 students.  Located in northern Louisiana’s rolling hills, the Ruston area (population ~48,000) is a vibrant rural college town, with major airports and other metropolitan services located nearby in Monroe and Shreveport.  For more information about the University, visit www.latech.edu.\n\nApplication Procedures:  Apply at https://ulsltu.wd1.myworkdayjobs.com/LATECHCareers. Attach (1) cover letter, (2) curriculum vitae, (3) university transcripts (unofficial), (4) 1-page statement of teaching philosophy and experience, and (5) a list of three professional references with contact details. Applications will be accepted until the position has been filled. Screening of applicants begins April 1, 2025, and completed applications as of that date will receive full consideration. The anticipated starting date of September 2, 2025, is flexible and may be negotiated. For more information about the position and its responsibilities, contact Dr. Joshua Adams, Forestry Program Chair at adamsj@latech.edu or (318) 257-4457.\n\nLouisiana Tech is an Equal Opportunity/Affirmative Action/ADA Employer and places a high priority on the creation of an environment supportive of ethnic minorities, women, veterans, and persons with disabilities.\n\nPosting Close Date: This position will remain open until filled.",
    "project_details": "q=r-1319\nApplication Deadline:\n08/03/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 2/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nLouisiana Tech University, School of Ag and Forestry (Ruston, Louisiana)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition:   Nine-month, tenure-track appointment, 60% teaching, 35% research, 5% service. A demonstrated ability to conduct research (e. Responsibilities: The successful candidate will be expected to teach, conduct research, and assist in the School’s overall mission",
    "contact_info": "",
    "application_deadline": "08/03/2026\nPublished:\n02/09/2026\nStarting Date:\nafter 2/9/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nLouisiana Tech University, School of Ag and Forestry (Ruston, Louisiana)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition:   Nine-month, tenure-track appointment, 60% teaching, 35% research, 5% service",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2026-02-15T05:16:39.839719+00:00",
    "scrape_run_id": "scrape_20260215_051605_24c25639",
    "scraper_version": "2.0"
  }
]