[
  {
    "title": "Master's Level Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep",
    "organization": "University of Idaho (State)",
    "location": "16 Hot Springs Ranch Road (Carmen, Idaho)",
    "salary": "starting at $25,000 per year",
    "starting_date": "between 8/1/2025 and 1/5/2026",
    "published_date": "07/08/2025",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107633",
    "description": "Master's Level Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep\nUniversity of Idaho (State) | https://www.uidaho.edu\nDetails\nApplication Deadline:\n10/01/2025\nPublished:\n07/08/2025\nStarting Date:\nbetween 8/1/2025 and 1/5/2026\nEnding Date:\nbetween 8/1/2027 and 5/15/2028\nHours per Week:\nat most 40\nSalary:\nstarting at $25,000 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\n16 Hot Springs Ranch Road (Carmen, Idaho)\nTags:\nGraduate Opportunities\nDescription\nMS Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep\n Organization: University of Idaho – College of Agriculture and Life Sciences, Nancy M. Cummings Research, Extension and Education Center \nJob title: MS Graduate Research Assistantship: Virtual Herding – Sheep\nSalary: $25,000/year \nStart Date: Fall 2025 or Spring 2026\nLocation: Salmon, ID \nApplication Deadline: Applications will be reviewed until position is filled; preference will be given to applications received by August 18, 2025.\n Dissertation Research Description:\nThis position will be seated in the University of Idaho (UI) College of Agriculture and Life Sciences Department of Animal, Veterinary and Food Sciences; however, will be based at the UI Nancy M. Cummings Research, Extension and Education Center (NMCREEC) near Salmon, Idaho. Research activities will be in collaboration with the USDA-ARS-US Sheep Experiment Station (USSES) near Dubois, Idaho and the Idaho Wild Sheep Foundation. Applicants should be aware that although research activities associated with this position are local to NMCREEC and USSES, coursework will predominantly be completed remotely. As part of a grant funded research project, this position will be responsible for carrying out research in developing, testing, and applying novel domestic sheep-specific virtual/remote monitoring and herding technology for application in remote rangelands. The outcomes of this research will contribute to understanding sheep behavior using virtual herding tools and ultimately provide management solutions for grazing sheep on open ranges; in particular, in areas where habitat overlap conflicts may occur with wild sheep. Through this project, the successful candidate will have the opportunity to work on a uniquely diverse, multidisciplinary project to gain skills and networks in the disciplines of range science, livestock management, agricultural technology, geospatial mapping, and wildlife habitat. Within reason, coursework and additional project objectives will be personalized to fit the student’s interests and career objectives.  The successful candidate may have the opportunity to develop and execute their own relevant research objective(s) that will complement the funded research. Professional development opportunities will include scientific design and implementation, scientific writing for peer-reviewed journals, attending and presenting at scientific and stakeholder meetings, stakeholder engagement and outreach, multidisciplinary training and networking, team leadership and management, and project coordination, among others. \n Position Qualifications:\nThe successful candidate must hold a completed Bachelor’s degree in a related field prior to starting this position. This position will require excellent leadership and communication skills. Applicants must also have excellent interpersonal skills, attention to detail, a strong work ethic, a valid driver’s license, a willingness to conduct field research under rigorous and remote conditions during variable weather conditions, and a willingness to drive to and stay at field site locations. Preference will be given to applicants that demonstrate a passion for the livestock ranching industry, have working knowledge in grazing livestock behavior, and have experience in livestock handling, remote-sensing technologies, geographic mapping (such as ArcGIS or onX) and/or vegetation monitoring. Preference will also be given to applicants with skills in horse riding, backcountry hiking, camping, and survival. Applicants with an established history of publication and/or experience presenting research findings or to stakeholder groups will also be given preference. Experience with any of the following is also beneficial: working/living in rural areas, working on ranching/farming operations and/or as a range technician, and operating ATV/UTVs and 4WD vehicles, and towing trailers.\n Housing:\nIn addition to the stipend, this position offers housing in an on-site dormitory with individual sleeping area and a common living area with other graduate students or seasonal interns/technicians (successful candidate will not be required to stay in the dormitory).  \n Application Instructions:\nTo apply, please send the following materials to Melinda Ellison (ellison@uidaho.edu) with “Sheep GRA” in the subject line: (1) a cover letter, (2) a resume, and (3) contact information for at least 3 references. \n EEO Statement:\nThe University of Idaho (U of I) is an equal opportunity and affirmative action employer committed to assembling a diverse, broadly trained faculty and staff. Women, minorities, people with disabilities, and veterans are strongly encouraged to apply. In compliance with applicable laws and in furtherance of its commitment to fostering an environment that welcomes and embraces diversity, U of I does not discriminate based on race, color, religion, national origin, sex, age, sexual orientation, gender identity/expression, disability, genetic information or status as any protected veteran or military status in its programs or activities, including employment, admissions, and educational programs.\nContact\nMelinda Ellison\n9704851401\nellison@uidaho.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat most 40\nSalary:\nstarting at $25,000 per year\nEducation Required:\nBachelors\nExperience Required:\nnone",
    "project_details": "Master's Level Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep\nUniversity of Idaho (State) | https://www. edu\nDetails\nApplication Deadline:\n10/01/2025\nPublished:\n07/08/2025\nStarting Date:\nbetween 8/1/2025 and 1/5/2026\nEnding Date:\nbetween 8/1/2027 and 5/15/2028\nHours per Week:\nat most 40\nSalary:\nstarting at $25,000 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\n16 Hot Springs Ranch Road (Carmen, Idaho)\nTags:\nGraduate Opportunities\nDescription\nMS Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep\n Organization: University of Idaho – College of Agriculture and Life Sciences, Nancy M. Cummings Research, Extension and Education Center \nJob title: MS Graduate Research Assistantship: Virtual Herding – Sheep\nSalary: $25,000/year \nStart Date: Fall 2025 or Spring 2026\nLocation: Salmon, ID \nApplication Deadline: Applications will be reviewed until position is filled; preference will be given to applications received by August 18, 2025",
    "contact_info": "",
    "application_deadline": "10/01/2025\nPublished:\n07/08/2025\nStarting Date:\nbetween 8/1/2025 and 1/5/2026\nEnding Date:\nbetween 8/1/2027 and 5/15/2028\nHours per Week:\nat most 40\nSalary:\nstarting at $25,000 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\n16 Hot Springs Ranch Road (Carmen, Idaho)\nTags:\nGraduate Opportunities\nDescription\nMS Graduate Research Assistantship: Virtual Monitoring/Herding – Sheep\n Organization: University of Idaho – College of Agriculture and Life Sciences, Nancy M",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:12.972221+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "PhD and MS Assistantships in Forest Soils and Biogeochemistry",
    "organization": "Auburn University (State)",
    "location": "College of Forestry, Wildlife and Environment (auburn, Alabama)",
    "salary": "$23,500 to $26,500 per year",
    "starting_date": "between 1/1/2026 and 6/15/2026",
    "published_date": "07/10/2025",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107680",
    "description": "PhD and MS Assistantships in Forest Soils and Biogeochemistry\nAuburn University (State) | https://cfwe.auburn.edu/profile/?smid=29361\nDetails\nApplication Deadline:\n08/31/2025\nPublished:\n07/10/2025\nStarting Date:\nbetween 1/1/2026 and 6/15/2026\nHours per Week:\nat most 40\nSalary:\n$23,500 to $26,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nCollege of Forestry, Wildlife and Environment (auburn, Alabama)\nTags:\nGraduate Opportunities\nDescription\nOverview \nThe Forest Soils and Biogeochemistry Lab at Auburn University (AU) is seeking one PhD student and one MS student to perform research associated with soil biogeochemistry and forest health in the Southeast region. The two graduate students will work together and supervise undergraduates in the field and laboratory to \n1. Assess soil physicochemical properties and microbial activities under repeated prescribed fires and forest thinning \n2. Analyze existing, multi-decadal vegetation and litter data to explore plant-soil-microbe interactions in a changing environment \n3. Examine the impact of microplastic pollution on soil nutrients and microbes. \n\nThe hired students are expected to join and lead a three-week field campaign in summer 2026. The team will travel to multiple field sites and research stations in the southeast (AL, GA, NC, SC) to collect and pre-process soil and litter samples. Samples will be brought or shipped back to AU for further laboratory analysis. Students are welcome to build their projects within the scope of soil health and nutrient cycling.  \n Responsibilities \n1. Conduct literature reviews and learn/develop experimental protocols \n2. Attend weekly or biweekly lab meetings to share updates and give comments \n3. Generate, organize, and analyze data \n4. Write and publish manuscripts in peer-reviewed scientific journals \n5. Present research findings at local, national, and international conferences \n Minimum Qualifications \n1. BS degree in Forestry, Ecology, Environmental Science, Natural Resources, or a related field; MS degree is required if applying for PhD \n2. Meet admission standards for the Auburn University Graduate School (https://graduate.auburn.edu/); International applicants please visit https://graduate.auburn.edu/prospective-students/general-admission-requirements/ for English language score requirements \n3. Ability to work independently and with others as a team \n Preferred Qualifications \n1. Ability to locate study sites/plots using GPS units and maps \n2. Soil, water, and vegetation sampling experience \n3. Soil geochemical and microbial analysis experience \n4. Quantitative skills and writing experience \n5. Valid driver's license (or ability to obtain one in several months) \n Estimated Start Date and Stipend \nPhD student, January 2026, $26,500 per year + tuition remission and benefits \nMS student, June 2026, $23,500 per year + tuition remission and benefits \nFinancial support is typically provided for four years for PhD and two years for MS, subject to annual evaluation.  \n About Forest Soils and Biogeochemistry Lab \nResearch in the Forest Soils and Biogeochemistry Lab investigates the fate of carbon and other elements in forest soil and its surrounding environment to address soil conservation issues and develop sustainable practices. We integrate field measurements, laboratory experiments, and computational statistics to examine soil biogeochemical responses under warmer climate, shifted precipitation regimes, and disturbances in forest ecosystems. The lab consists of a main laboratory room, a soil texture room, two storage rooms with field equipment, and a shared walk-in refrigerator. The main laboratory room houses a Biological Digital Microscope, a Deionized Water System, a Shimadzu Total Organic Carbon Analyzer, an Electronic Thermostat Hova-Bator Incubator, an Isotemp Programmable Muffle Furnace, a Chloroform fumigation-extraction station, and a brand-new FlashSmart Elemental Analyzer.\n\nVisit Dr. Yang’s profile to learn more about the lab and research activities. Information regarding PhD and MS programs in the college of Forestry, Wildlife and Environment can be found at https://cfwe.auburn.edu/graduate-study/graduate-degrees/. \n To Apply\nPlease email the following materials as a single PDF document to Dr. Yang Yang at yangy@auburn.edu, with the subject line “Potential Graduate Student at AU.” \n1. A cover letter (1 page max) outlining the research interests, relevant experience, and professional goals \n2. Resume/CV and contact information only from three professional references \n3. Unofficial transcripts \n\nApplications will be reviewed on a rolling basis and accepted through August 31, 2025. If selected, the applicant(s) will be invited for a short virtual interview before submitting a complete application. A complete application includes a cover letter, Resume/CV, official transcripts, English language score (International students only), and three letters of recommendation. Please reach out with any questions. \n\nContact\nDr. Yang Yang\nyangy@auburn.edu (preferred contact method)",
    "requirements": "2. Meet admission standards for the Auburn University Graduate School (https://graduate.auburn.edu/); International applicants please visit https://graduate.auburn.edu/prospective-students/general-admission-requirements/ for English language score requirements",
    "project_details": "smid=29361\nDetails\nApplication Deadline:\n08/31/2025\nPublished:\n07/10/2025\nStarting Date:\nbetween 1/1/2026 and 6/15/2026\nHours per Week:\nat most 40\nSalary:\n$23,500 to $26,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nCollege of Forestry, Wildlife and Environment (auburn, Alabama)\nTags:\nGraduate Opportunities\nDescription\nOverview \nThe Forest Soils and Biogeochemistry Lab at Auburn University (AU) is seeking one PhD student and one MS student to perform research associated with soil biogeochemistry and forest health in the Southeast region. The team will travel to multiple field sites and research stations in the southeast (AL, GA, NC, SC) to collect and pre-process soil and litter samples. Present research findings at local, national, and international conferences \n Minimum Qualifications \n1",
    "contact_info": "",
    "application_deadline": "08/31/2025\nPublished:\n07/10/2025\nStarting Date:\nbetween 1/1/2026 and 6/15/2026\nHours per Week:\nat most 40\nSalary:\n$23,500 to $26,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\nCollege of Forestry, Wildlife and Environment (auburn, Alabama)\nTags:\nGraduate Opportunities\nDescription\nOverview \nThe Forest Soils and Biogeochemistry Lab at Auburn University (AU) is seeking one PhD student and one MS student to perform research associated with soil biogeochemistry and forest health in the Southeast region",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.064593+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Wildlife Veterinarian (Assistant/Associate Professor)",
    "organization": "Caesar Kleberg Wildlife Research Institute (State)",
    "location": "Kingsville, Texas",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 1/1/2026",
    "published_date": "07/10/2025",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107667",
    "description": "Wildlife Veterinarian (Assistant/Associate Professor)\nCaesar Kleberg Wildlife Research Institute (State) | https://www.ckwri.tamuk.edu/\nDetails\nPosting:\nhttps://tamus.wd1.myworkdayjobs.com/en-US/TAMUK_External/job/Assistant-Associate-Professor--Wildlife-Veterinary-Science_R-085261\nApplication Deadline:\n09/15/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 1/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nKingsville, Texas\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition Description: \nTenure-track faculty position (rank depending on qualifications) with the Caesar Kleberg Wildlife Research Institute (CKWRI) and the Department of Rangeland and Wildlife Sciences (RWSC) in the Dick and Mary Lewis Kleberg College of Agriculture and Natural Resources at Texas A&M University-Kingsville (TAMUK). The successful candidate will be primarily responsible for managing the CKWRI Ocelot Conservation Facility, a 30,000 square-foot state-of-the-art complex which is currently under construction on the TAMUK campus. Scheduled for completion in May 2026, the facility will support ex situ breeding and rearing of the federally endangered ocelot, with the goal of augmenting the wild ocelot population through release of individuals reared at the facility. Immediately upon starting, the successful candidate will help establish operations, write protocols, review permits, and perform other foundational tasks necessary to ensure the facility’s success. As facility manager, the successful candidate will oversee animal-care staff, manage facility resources, and ensure timely and professional coordination with all agency and private collaborators in support of conservation and research goals. \n In addition, the successful candidate will be expected to provide veterinary support to and collaborate on CKWRI research endeavors, and will be encouraged to develop a research program in wildlife physiology, behavior, and/or health. Acknowledging the substantial work required to manage a new facility and support CKWRI research, this position is being listed at 85% service, however an official research appointment is negotiable depending on candidate interest and experience. The successful candidate will also be expected to teach 1 graduate course in wildlife nutrition or wildlife physiology annually, fulfilling a 15% teaching expectation. Formally, the position will be considered a 9-month appointment consistent with most faculty positions, however summer salary will be supported by the CKWRI to ensure uninterrupted service to the facility and research endeavors.\n Responsibilities:\nOversee the establishment of and operations at the CKWRI Ocelot Conservation Facility on the TAMUK campus.\nWork collaboratively with scientists, graduate students, private landowners, agency personnel, and others towards the goal of ocelot recovery.\nProvide veterinary support to CKWRI research endeavors in collaboration with faculty and students.\nIf a research appointment is negotiated, develop and lead an impactful, extramurally-funded program consistent with the appointment, \nTeach 1 graduate-level course annually to meet the needs of the RWSC Department.\nEngage in professional service to the Department, College, and University as required.\n Qualifications: \nDoctorate in Veterinary Medicine from an AAVMC accredited university; licensed or ability to be licensed in the state of Texas.\nExperience providing veterinary care to wild animals ex situ and in situ.\nExperience in ex situ animal management and care, specifically with carnivores.\nDemonstrated leadership potential, such as managing a team, chairing committees, or leading an initiative.\nAbility to instruct courses in wildlife nutrition and physiology, incorporating effective teaching techniques into classes. Applicants must have successfully completed a minimum of 18 graduate-level hours in wildlife science, animal science, biology, veterinary science, or similar disciplines.\nDemonstrated ability to communicate with students, professionals, lay audiences, and scientists.\n Preference will be given to applicants with:\nExperience in the ex-situ management and care of wild felids.\nExperience with ex-situ breeding programs and reintroductions.\nDemonstrated ability to foster and sustain positive, working relationships with private landowners, scientists, students, and state, federal, and private natural resource organizations.\nDemonstrated potential to attract extramural funding. \nMS or PhD in wildlife science, ecology, biology, animal science, or a related discipline.\nBoard certification by the American College of Zoologic Medicine, the European College of Zoologic Medicine, the American College of Veterinary Preventive Medicine, or related specialty. \nEvidence of innovative and applied biological research, demonstrated by a record of peer-reviewed publications, presentations, and other scholarly materials.\n About CKWRI:\nCKWRI is a privately funded research unit at TAMUK that has provided science-based information for enhancing the conservation and management of Texas wildlife and rangelands for over 40 years. The successful applicant will join an established and award-winning team of ~30 faculty and research staff who work with ~55 M.S. and Ph.D. students to conduct innovative and applied research in partnership with numerous non-government organizations, state and federal agencies, and private landowners across the state. As faculty members of the RWSC Department, CKWRI scientists mentor, educate, and provide hands-on experiences to ~150 undergraduate students, playing a critical role in developing the next generation of wildlife professionals. Faculty and students alike enjoy small class sizes at TAMUK, a small Hispanic-Serving Institution serving ~7,000 students and the oldest, continuously operating public institution of higher learning in South Texas. \n About Kingsville:\nThe University is located in historic Kingsville, a friendly, safe city of 25,000 that is the home of the legendary King Ranch. Corpus Christi (population: ~300,000) and its beaches are just 40 miles to the northeast, and the border with Mexico is 120 miles to the south at Brownsville or 119 miles to the west at Laredo. The region boasts world-class fishing, hunting, and birding, access to the longest, undeveloped barrier island in the world (Padre Island National Seashore), and a friendly, diverse community rich in history and culture.\n Application: \nQualified applicants should submit a (1) cover letter, specifically addressing interest in the position including teaching and research, (2) a detailed vita stating education, experience, and qualifications, (3) copies of transcripts from all colleges attended, and (4) three professional references including names, e-mail addresses, and telephone numbers. Address referrals and questions regarding the position to Ashley Tanner. \nContact\nAshley Tanner\n361-593-3774\nashley.unger@tamuk.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years",
    "project_details": "Wildlife Veterinarian (Assistant/Associate Professor)\nCaesar Kleberg Wildlife Research Institute (State) | https://www. com/en-US/TAMUK_External/job/Assistant-Associate-Professor--Wildlife-Veterinary-Science_R-085261\nApplication Deadline:\n09/15/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 1/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nKingsville, Texas\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition Description: \nTenure-track faculty position (rank depending on qualifications) with the Caesar Kleberg Wildlife Research Institute (CKWRI) and the Department of Rangeland and Wildlife Sciences (RWSC) in the Dick and Mary Lewis Kleberg College of Agriculture and Natural Resources at Texas A&M University-Kingsville (TAMUK). As facility manager, the successful candidate will oversee animal-care staff, manage facility resources, and ensure timely and professional coordination with all agency and private collaborators in support of conservation and research goals",
    "contact_info": "",
    "application_deadline": "09/15/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 1/1/2026\nHours per Week:\nat least 40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nat least 2 years\nLocation:\nKingsville, Texas\nTags:\nFaculty / Post-Doc Appointments\nDescription\nPosition Description: \nTenure-track faculty position (rank depending on qualifications) with the Caesar Kleberg Wildlife Research Institute (CKWRI) and the Department of Rangeland and Wildlife Sciences (RWSC) in the Dick and Mary Lewis Kleberg College of Agriculture and Natural Resources at Texas A&M University-Kingsville (TAMUK)",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.222,
    "discipline_keywords": [
      "wildlife",
      "wild animals",
      "hunting",
      "bird",
      "carnivore"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.153757+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Project Coordinator",
    "organization": "University of Georgia (State)",
    "location": "Rhinelander, Wisconsin",
    "salary": "Commensurate / Negotiable",
    "starting_date": "9/15/2025",
    "published_date": "07/11/2025",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107695",
    "description": "Project Coordinator\nUniversity of Georgia (State) | http://ecology.uga.edu\nDetails\nPosting:\nhttps://www.ugajobsearch.com/postings/438386\nApplication Deadline:\n08/05/2025\nPublished:\n07/11/2025\nStarting Date:\n9/15/2025\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nRhinelander, Wisconsin\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe University of Georgia is hiring a Project Coordinator for a joint research project with U.S. Forest Service to guide a multi-year project studying community assessment metrics, community health, and spatial patterns of biodiversity in freshwater mussels in the Great Lakes region. 1-year with potential for renewal. \n\nApplicants should have PhD and experience with mussels or other freshwater survey work, spatial analytical skills preferred. Will be based out of USFS Northern Research Station in Rhinelander WI. For more information/to apply, https://www.ugajobsearch.com/postings/438386 \n\nStart date 9-15-25, we will begin reviewing applications 7-30-25. \n\nInquiries: Dr. John Wares, jpwares@uga.edu \n\nDr. Rachel Toczydlowski, Rachel.toczydlowski@usda.gov  \n\nContact\nDr. John Wares\njpwares@uga.edu (preferred contact method)",
    "requirements": "Hours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone",
    "project_details": "com/postings/438386\nApplication Deadline:\n08/05/2025\nPublished:\n07/11/2025\nStarting Date:\n9/15/2025\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nRhinelander, Wisconsin\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe University of Georgia is hiring a Project Coordinator for a joint research project with U. Will be based out of USFS Northern Research Station in Rhinelander WI",
    "contact_info": "",
    "application_deadline": "08/05/2025\nPublished:\n07/11/2025\nStarting Date:\n9/15/2025\nHours per Week:\n40\nSalary:\nCommensurate / Negotiable\nEducation Required:\nDoctorate\nExperience Required:\nnone\nLocation:\nRhinelander, Wisconsin\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe University of Georgia is hiring a Project Coordinator for a joint research project with U",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.243107+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Fall Reptile Internship",
    "organization": "Kentucky Reptile Zoo (Private)",
    "location": "200 L & E Railroad (Slade, Kentucky)",
    "salary": "starting at $500 per month",
    "starting_date": "between 8/23/2025 and 9/14/2025",
    "published_date": "07/08/2025",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=91242",
    "description": "Fall Reptile Internship\nKentucky Reptile Zoo (Private) | http://www.kyreptilezoo.org\nDetails\nPosting:\nhttps://www.kyreptilezoo.com/joomla/index.php/internships-hdr/int-info\nApplication Deadline:\n09/10/2025\nPublished:\n07/08/2025\nStarting Date:\nbetween 8/23/2025 and 9/14/2025\nEnding Date:\nbetween 12/15/2025 and 1/7/2026\nHours per Week:\n40\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n200 L & E Railroad (Slade, Kentucky)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nThe Kentucky Reptile Zoo internship program offers college students or recent graduates the chance to receive hands-on training experience at a facility with one of the most extensive and diverse reptile collections in the world. \n\nThe intern will assist in the captive maintenance of the zoo’s reptile collection, including feeding, cleaning, training and record keeping. They will gain hands-on experience with nonvenomous squamates, chelonians and juvenile crocodilians. They will give interpretive talks and interact with the public regularly. They will also maintain the organization and cleaning of equipment and supplies, and perform other duties as assigned.  In addition, the intern will have the option to complete a research project related to the field of herpetology.  The intern will not be involved in the handling of any venomous species.\n\nApplicants must have or be:\n\nA college student or recently graduated college student; former interns have arranged for academic credit with their institutions \nStudents preferably majoring in the biological or natural sciences  \nA valid driver’s license \nPersonal transportation is recommended \nWilling to work weekends, receiving two days off during the week instead \nAn ability to communicate effectively with people \nComfortable handling snakes and other reptiles on a daily basis \nAble to do work such as lifting, bending, stooping, carrying heavy objects, and be willing to do work outdoors in a range of weather conditions\nOrientation to details \nPositive attitude and strong work ethic \nAn interest in reptiles!\nNote: all interns must have a current tetanus shot and also be vaccinated against COVID-19.\n\nIn addition to a stipend of $500/month, interns receive housing with wifi and access to laundry facilities. \nContact\nKat Dale\nkyreptilezoo@kyreptilezoo.org (preferred contact method)",
    "requirements": "Hours per Week:\n40\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "In addition, the intern will have the option to complete a research project related to the field of herpetology",
    "contact_info": "",
    "application_deadline": "09/10/2025\nPublished:\n07/08/2025\nStarting Date:\nbetween 8/23/2025 and 9/14/2025\nEnding Date:\nbetween 12/15/2025 and 1/7/2026\nHours per Week:\n40\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n200 L & E Railroad (Slade, Kentucky)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nThe Kentucky Reptile Zoo internship program offers college students or recent graduates the chance to receive hands-on training experience at a facility with one of the most extensive and diverse reptile collections in the world",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.343861+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Conduct Your Own Research Project in the Field - South Africa",
    "organization": "WildComm Research Stations (Private)",
    "location": "Vivo, Limpopo, South Africa",
    "salary": "none",
    "starting_date": "between 10/2/2025 and 11/6/2025",
    "published_date": "07/11/2025",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107642",
    "description": "Conduct Your Own Research Project in the Field - South Africa\nWildComm Research Stations (Private) | https://wildcomm.org/\nDetails\nApplication Deadline:\n08/21/2025\nPublished:\n07/11/2025\nStarting Date:\nbetween 10/2/2025 and 11/6/2025\nEnding Date:\nbetween 11/27/2025 and 1/22/2026\nHours per Week:\n25 - 45\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nVivo, Limpopo, South Africa\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nAre you a student, postgraduate researcher, academic, or conservationist looking for a supportive, field-based environment to carry out your research? WildComm Research Stations invites researchers from around the world to join our multidisciplinary conservation hub and conduct their own projects within a protected private reserve.\n\nWhat We Offer\nWildComm is situated on a biodiverse private reserve, home to large mammals, birds, and complex savanna ecosystems. We provide a collaborative, research-focused atmosphere with access to on-site research equipment and a team of experienced conservation professionals.\n\nWhether you're conducting undergraduate fieldwork, working on a Master’s thesis, developing a PhD project, or leading a long-term conservation initiative—we welcome your inquiry.\n\nSupport Includes\nOn-site research equipment\nField guidance from experienced researchers and ecologists\nAccess to long-term data and local wildlife monitoring systems\nShared accommodation\n\nTransport:\nYou will be fetched in the nearest town, Louis Trichardt, where you will be assisted by a staff member to do your shopping\nBiweekly trips to town for supplies\n\nIdeal Research Themes\nWildlife health and parasitology\nBehavioural ecology\nMovement ecology and camera trap studies\nPopulation dynamics and genetics\nVegetation \nInterdisciplinary conservation topics\n\nFitness\nFieldwork is physically demanding and conducted on foot in challenging weather conditions. Moderate fitness is recommended, but stamina builds over time.\n\nFlexible Dates and Duration\nWe accept researchers year-round. Project lengths are flexible depending on your goals, from short-term exploratory work to multi-year research initiatives.\n\nConservation Fee\nA monthly fee is required to support:\nConservation research infrastructure and data support\nField logistics, equipment access, accommodation, and transport\nProtection and maintenance of the reserve ecosystem\n\nHow to Join\nEmail your CV, project proposal (if available), and a short letter of interest to applications@wildcomm.org\n\nNot sure if your project fits? Contact us—we’d love to explore it with you.\nContact\nChanelle Becker\n+27 76 261 5365\napplications@wildcomm.org (preferred contact method)",
    "requirements": "Hours per Week:\n25 - 45\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "Conduct Your Own Research Project in the Field - South Africa\nWildComm Research Stations (Private) | https://wildcomm. org/\nDetails\nApplication Deadline:\n08/21/2025\nPublished:\n07/11/2025\nStarting Date:\nbetween 10/2/2025 and 11/6/2025\nEnding Date:\nbetween 11/27/2025 and 1/22/2026\nHours per Week:\n25 - 45\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nVivo, Limpopo, South Africa\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nAre you a student, postgraduate researcher, academic, or conservationist looking for a supportive, field-based environment to carry out your research. WildComm Research Stations invites researchers from around the world to join our multidisciplinary conservation hub and conduct their own projects within a protected private reserve",
    "contact_info": "",
    "application_deadline": "08/21/2025\nPublished:\n07/11/2025\nStarting Date:\nbetween 10/2/2025 and 11/6/2025\nEnding Date:\nbetween 11/27/2025 and 1/22/2026\nHours per Week:\n25 - 45\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nVivo, Limpopo, South Africa\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nAre you a student, postgraduate researcher, academic, or conservationist looking for a supportive, field-based environment to carry out your research? WildComm Research Stations invites researchers from around the world to join our multidisciplinary conservation hub and conduct their own projects within a protected private reserve",
    "is_graduate_position": true,
    "grad_confidence": 0.95,
    "position_type": "Graduate",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.25,
    "discipline_keywords": [
      "wildlife",
      "bird",
      "mammal",
      "population dynamics",
      "wildlife health"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.443525+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "LTE Large Carnivore Research Scientist (Wisconsin)",
    "organization": "Wisconsin Dept of Natural Resources (State)",
    "location": "Wisconsin",
    "salary": "starting at $26.87 per hour",
    "starting_date": "after 8/11/2025",
    "published_date": "07/08/2025",
    "tags": "Faculty / Post-Doc Appointments, Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107596",
    "description": "LTE Large Carnivore Research Scientist (Wisconsin)\nWisconsin Dept of Natural Resources (State)\nDetails\nPosting:\nhttps://wj.wi.gov/psc/wisjobs/CAREERS/HRMS/c/HRS_HRAM_FL.HRS_CG_SEARCH_FL.GBL?Page=HRS_APP_JBPST_FL&Action=U&FOCUS=Applicant&SiteId=1&PostingSeq=1&JobOpeningId=18226\nApplication Deadline:\n07/21/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 8/11/2025\nHours per Week:\nat least 40\nSalary:\nstarting at $26.87 per hour\nEducation Required:\nnone\nExperience Required:\nat least 4 years\nLocation:\nWisconsin\nTags:\nFaculty / Post-Doc Appointments\nGraduate Opportunities\nDescription\nApplicants must be Wisconsin residents or have lived in Wisconsin for at least a year out of the last 5 years. If none of the applicants meet the minimum requirements of the position, the residency requirement will be removed. \n\nThe Office of Applied Science within the Wisconsin Department of Natural Resources (DNR) seeks to hire a scientist and a technician to join our Large Carnivore Team. Our team has an assortment of exciting projects designed to directly inform wildlife management decisions in the state. The position will be based out of Rhinelander, WI and can begin as early as September. Both positions are 6-month, full-time positions with the intention of extending them pending mutual applicant fit and continued funding. Applications must be received by 11:59pm, Central Time, on July 21st to be considered. Please see the full position descriptions, application instructions, and link to apply for the scientist here and technician here.  \n Current projects include: \n·             Evaluation of abatement measures to reduce crop damage by bears \n·             Analysis of wolf collar data \n·             Estimating bear reproductive parameters: cub survival, litter size, and litter frequency \n·             Decision analysis projects, including using value-of-information to inform research projects \n This is a great opportunity for recent graduates. We’ve even hired a few folks for scientist-level positions who had recently finished their PhD and were able to structure the position to be similar to a postdoc. \nContact\nJennifer Price Tack\njennifer.pricetack@wisconsin.gov (preferred contact method)",
    "requirements": "Applicants must be Wisconsin residents or have lived in Wisconsin for at least a year out of the last 5 years. If none of the applicants meet the minimum requirements of the position, the residency requirement will be removed. \n\nThe Office of Applied Science within the Wisconsin Department of Natural Resources (DNR) seeks to hire a scientist and a technician to join our Large Carnivore Team. Our team has an assortment of exciting projects designed to directly inform wildlife management decisions in the state. The position will be based out of Rhinelander, WI and can begin as early as September. Both positions are 6-month, full-time positions with the intention of extending them pending mutual applicant fit and continued funding. Applications must be received by 11:59pm, Central Time, on July 21st to be considered. Please see the full position descriptions, application instructions, and link to apply for the scientist here and technician here.  \n Current projects include: \n·             Evaluation of abatement measures to reduce crop damage by bears \n·             Analysis of wolf collar data \n·             Estimating bear reproductive parameters: cub survival, litter size, and litter frequency \n·             Decision analysis projects, including using value-of-information to inform research projects \n This is a great opportunity for recent graduates. We’ve even hired a few folks for scientist-level positions who had recently finished their PhD and were able to structure the position to be similar to a postdoc.",
    "project_details": "LTE Large Carnivore Research Scientist (Wisconsin)\nWisconsin Dept of Natural Resources (State)\nDetails\nPosting:\nhttps://wj. Current projects include: \n·             Evaluation of abatement measures to reduce crop damage by bears \n·             Analysis of wolf collar data \n·             Estimating bear reproductive parameters: cub survival, litter size, and litter frequency \n·             Decision analysis projects, including using value-of-information to inform research projects \n This is a great opportunity for recent graduates",
    "contact_info": "",
    "application_deadline": "07/21/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 8/11/2025\nHours per Week:\nat least 40\nSalary:\nstarting at $26",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": true,
    "university_name": "University of Wisconsin",
    "scraped_at": "2025-07-15T16:17:13.542711+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "MS Assistantship: Use of private, working harvests as stopover habitat by migratory songbirds in West Virginia; filling in the knowledge gaps",
    "organization": "West Virginia University (State)",
    "location": "West Virginia",
    "salary": "$21,500 per year",
    "starting_date": "before 8/20/2025",
    "published_date": "07/10/2025",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=106330",
    "description": "MS Assistantship: Use of private, working harvests as stopover habitat by migratory songbirds in West Virginia; filling in the knowledge gaps\nWest Virginia University (State) | https://admissions.wvu.edu/academics/majors/wildlife-and-fisheries-resources\nDetails\nPosting:\nhttps://www.davis.wvu.edu/faculty-staff/directory/christopher-lituma\nApplication Deadline:\n07/25/2025\nPublished:\n07/10/2025\nStarting Date:\nbefore 8/20/2025\nHours per Week:\n40 - 60\nSalary:\n$21,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 1 year\nLocation:\nWest Virginia\nTags:\nGraduate Opportunities\nDescription\nThe School of Natural Resources and the Environment at West Virginia University is searching for a Master of Science (MS) student to determine occupancy and abundance of songbirds on recently (3-8 years) harvested forest stands during spring and fall migration on institutional private forests in West Virginia. Understanding how these young forest stands contribute as stopover habitat for migrating songbirds is of critical importance. This project provides a unique opportunity to evaluate use of regenerating forest stands by migrating songbirds in a large and patchily disturbed landscape. The student will determine occupancy and abundance using mist-nets and using Autonomous Recording Units (ARUs). The student will use pre-existing models to identify study areas. This research is in collaboration with National Council for Air and Stream Improvement, Inc., National Alliance of Forest Owners, and Weyerhaeuser Company under the auspices of the Wildlife Conservation Initiative, and Cornell University. \n\nThe student will be working towards an MS in Wildlife and Fisheries Resources at West Virginia University. STARTING DATE: August 2025. The ideal applicant must be able to identify central Appalachian avian species by sight and sound and have extensive experience with mist-netting and handling birds. Applicants should also be familiar with collecting measurements of forest structure, including but not limited to: DBH, canopy cover (using spherical densiometers), Robel pole, Daubenmire frame, etc. Preference will be given to applicants with experience in R statistical packages, GIS, and song file analysis via RavenPro or similar software. Applicants should be comfortable working long days in the field during spring and fall months, ready to travel, and energetic and excited about applied avian conservation research on private working forests. Applicants will also be responsible for hiring and supervising a research technician to assist with research duties. Applicants must have completed a BS in Wildlife Biology, Ecology, or a closely related field. A minimum of 300 combined GRE score (V+Q) or 1100 on the previous scale, and a minimum 3.25 GPA are considered competitive. \n\nTuition waiver is included.\n\nTo Apply: Electronic applications are preferred. To apply send a single file including: 1) a cover letter outlining any relevant mist-netting and bird handling experience, 2) resumé including an unofficial copy of transcripts and GRE scores, and 3) contact information for 3 references to Dr. Chris Lituma; cml0017@mail.wvu.edu\nContact\nChristopher Lituma\n3042937473\ncml0017@mail.wvu.edu (preferred contact method)",
    "requirements": "Hours per Week:\n40 - 60\nSalary:\n$21,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 1 year",
    "project_details": "This research is in collaboration with National Council for Air and Stream Improvement, Inc. Applicants should be comfortable working long days in the field during spring and fall months, ready to travel, and energetic and excited about applied avian conservation research on private working forests. Applicants will also be responsible for hiring and supervising a research technician to assist with research duties",
    "contact_info": "",
    "application_deadline": "07/25/2025\nPublished:\n07/10/2025\nStarting Date:\nbefore 8/20/2025\nHours per Week:\n40 - 60\nSalary:\n$21,500 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 1 year\nLocation:\nWest Virginia\nTags:\nGraduate Opportunities\nDescription\nThe School of Natural Resources and the Environment at West Virginia University is searching for a Master of Science (MS) student to determine occupancy and abundance of songbirds on recently (3-8 years) harvested forest stands during spring and fall migration on institutional private forests in West Virginia",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.194,
    "discipline_keywords": [
      "wildlife",
      "wildlife conservation",
      "bird",
      "avian",
      "migration"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.632262+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Assistant Professor, Vertebrate Ecology",
    "organization": "School of Biological Sciences (State)",
    "location": "205 NE Library Rd (Pullman, Washington)",
    "salary": "$80,000 to $95,000 per year",
    "starting_date": "after 8/16/2026",
    "published_date": "07/09/2025",
    "tags": "Faculty / Post-Doc Appointments",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107661",
    "description": "Assistant Professor, Vertebrate Ecology\nSchool of Biological Sciences (State) | https://sbs.wsu.edu/\nDetails\nPosting:\nhttps://wsu.wd5.myworkdayjobs.com/en-US/WSU_Jobs/job/Pullman-WA/Assistant-Professor_R-13692\nApplication Deadline:\n09/14/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/16/2026\nHours per Week:\nat most 40\nSalary:\n$80,000 to $95,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nat least 1 year\nLocation:\n205 NE Library Rd (Pullman, Washington)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe School of Biological Sciences (SBS) at Washington State University (WSU) invites applications for a permanent, full-time, nine-month, tenure-track Assistant Professor position in Pullman, WA, with a specialty in Vertebrate Ecology. We seek applicants whose research program spans spatial and/or temporal scales, or levels of biological organization. Candidates who apply quantitative and inductive approaches to connect organismal biology with ecological processes are particularly encouraged to apply. Potential research topics of interest include but are not limited to species interactions, broadly defined; physiological ecology; eco-evolutionary dynamics; food webs; and determinants of biodiversity.\nThe undergraduate population in SBS has primary interests in pre-health, so candidates whose research and teaching can connect with these students are encouraged to apply. The successful candidate will also contribute to graduate teaching and training the next generation of biology students in cutting-edge ecological theory and methods.\nIt is anticipated that the successful candidate will begin the appointment on August 16, 2026.\nContact\nJesse Brunner\n509-335-3702\njesse.brunner@wsu.edu (preferred contact method)",
    "requirements": "Hours per Week:\nat most 40\nSalary:\n$80,000 to $95,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nat least 1 year",
    "project_details": "We seek applicants whose research program spans spatial and/or temporal scales, or levels of biological organization. Potential research topics of interest include but are not limited to species interactions, broadly defined; physiological ecology; eco-evolutionary dynamics; food webs; and determinants of biodiversity. The undergraduate population in SBS has primary interests in pre-health, so candidates whose research and teaching can connect with these students are encouraged to apply",
    "contact_info": "",
    "application_deadline": "09/14/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/16/2026\nHours per Week:\nat most 40\nSalary:\n$80,000 to $95,000 per year\nEducation Required:\nDoctorate\nExperience Required:\nat least 1 year\nLocation:\n205 NE Library Rd (Pullman, Washington)\nTags:\nFaculty / Post-Doc Appointments\nDescription\nThe School of Biological Sciences (SBS) at Washington State University (WSU) invites applications for a permanent, full-time, nine-month, tenure-track Assistant Professor position in Pullman, WA, with a specialty in Vertebrate Ecology",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.721892+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Environmental Education Internship",
    "organization": "Florida Keys Wild Bird Rehabilitation Center (Private)",
    "location": "92080 Overseas Hwy (Tavernier, Florida, Florida)",
    "salary": "starting at $500 per month",
    "starting_date": "after 9/29/2025",
    "published_date": "07/10/2025",
    "tags": "Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107683",
    "description": "Environmental Education Internship\nFlorida Keys Wild Bird Rehabilitation Center (Private) | https://www.keepthemflying.org/\nDetails\nPosting:\nhttps://www.keepthemflying.org/internships\nApplication Deadline:\n07/27/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 9/29/2025\nEnding Date:\nafter 1/9/2026\nHours per Week:\n40 - 45\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n92080 Overseas Hwy (Tavernier, Florida, Florida)\nTags:\nUndergraduate Opportunities\nDescription\nFlorida Keys Wild Bird Rehabilitation Center: \nThe mission of the Florida Keys Wild Bird Rehabilitation Center is to rescue, rehabilitate, and release native and migratory wild birds that have been harmed or displaced, to provide or locate a humane shelter for those birds that cannot be released, and to educate the public towards the importance of coexistence with all wild bird species. \n\n\nJob Description:\nHave you ever dreamed of living on an island and working in the field of environmental education? The Florida Keys Wild Bird Center’s Environmental Education Internship program offers a full-time internship program including a $250 bi-weekly stipend and free housing in our shared intern house on-site.  This seasonal position will run from September 29th to mid-January. \n\nJob Summary: \nThe Environmental Education Intern is a supporting role and involves participating in all aspects of education programs and outreach efforts for the Florida Keys Wild Bird Rehabilitation Center in the upper Florida Keys. Education efforts include field trips, public bird releases, afterschool programs, tours of our sanctuary, and all other public educational events for audiences of all ages. Outreach/community efforts include providing content for social media platforms, attending offsite events, tabling events, and other non-profit related events. This position also includes handling our species ambassadors, which can include a raptor, snake, and invertebrates. \n\nThe Environmental Education Intern position is a full-time, stipend, seasonal position lasting 4 months and may include some holidays, weekends, and evening hours. Typically the Environmental Education Intern works a 5-day (Monday through Friday), 40 hour work week with occasional weekend events or programs, not to exceed 40 hours a week. The goal of this position is to provide well-rounded experience to build towards a career with non-profits as well as environmental education and community outreach.\n\n \nEssential Duties/Responsibilities: \n● Work on an independent project approved and supported by the Outreach Coordinator over the course of the internship\n● Assist Outreach Coordinator with running and delivering educational programming on and off site\n● Manage sanctuary gift shop and education table, answer questions and direct visitors\n● Set up and run educational booths at off-site events \n● Assist with development and implementation of educational programs \n● Aid in planning and setup for fundraising events\n● Lead guided tours of the hospital and sanctuary for school groups and guests as scheduled\n● Attend public bird releases\n● Assist in gift shop operations, inventory and greeting guests\n● Respond to the public’s curiosity and questions about the organization (i.e. the mission, sanctuary information, bird advice, bird injuries, etc.)\n● Network with other environmental education organizations to form collaborative efforts\n● Assist with content for social media including pictures, videos and captions\n● Assist with volunteer group programming\n● Represent the FKWBC at events as scheduled \n\nRequirements: \n● At least 21 years of age \n● Currently pursuing or recent graduate with an environmental or education focused degree\nor a related field \n● Ability to lift 50 lbs. and work in hot, humid, and rainy weather conditions\n● Ability to adapt to a changing work schedule to accommodate events that \noccur on weekends \n● Comfortable with handling animals including birds and reptiles   \n● Knowledge of basic biological principles and ability to quickly master Florida Keys ecology \n● Ability to teach to people of all ages \n● Public speaking experience\n● Possess strong communication and interpersonal skills \n● Possess effective time management skills with the ability to plan, organize, and adapt\n● Self-motivated, confident, and disciplined with a strong work ethic and positive attitude\n● Able to respect FKWBC property as smoke- and drug-free zones \n● Valid driver's license with clean driving record \n\nTo Apply: Please send cover letter and resume to outreach@keepthemflying.org with the subject line \"Education Internship - Your Name\"\nApplication review begins July 21st.\n\n\nContact\nSara Read\noutreach@keepthemflying.org (preferred contact method)",
    "requirements": "Hours per Week:\n40 - 45\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "Essential Duties/Responsibilities: \n● Work on an independent project approved and supported by the Outreach Coordinator over the course of the internship\n● Assist Outreach Coordinator with running and delivering educational programming on and off site\n● Manage sanctuary gift shop and education table, answer questions and direct visitors\n● Set up and run educational booths at off-site events \n● Assist with development and implementation of educational programs \n● Aid in planning and setup for fundraising events\n● Lead guided tours of the hospital and sanctuary for school groups and guests as scheduled\n● Attend public bird releases\n● Assist in gift shop operations, inventory and greeting guests\n● Respond to the public’s curiosity and questions about the organization (i",
    "contact_info": "",
    "application_deadline": "07/27/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 9/29/2025\nEnding Date:\nafter 1/9/2026\nHours per Week:\n40 - 45\nSalary:\nstarting at $500 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n92080 Overseas Hwy (Tavernier, Florida, Florida)\nTags:\nUndergraduate Opportunities\nDescription\nFlorida Keys Wild Bird Rehabilitation Center: \nThe mission of the Florida Keys Wild Bird Rehabilitation Center is to rescue, rehabilitate, and release native and migratory wild birds that have been harmed or displaced, to provide or locate a humane shelter for those birds that cannot be released, and to educate the public towards the importance of coexistence with all wild bird species",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.813219+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "USFS Effectiveness of Fire Prevention Programs on Human-Caused Wildfire Ignitions on Tribal Lands",
    "organization": "Oak Ridge Associated Universities (ORAU) (Private)",
    "location": "Durham, North Carolina | remote work allowed",
    "salary": "Commensurate / Negotiable",
    "starting_date": "after 8/1/2025",
    "published_date": "07/11/2025",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107709",
    "description": "USFS Effectiveness of Fire Prevention Programs on Human-Caused Wildfire Ignitions on Tribal Lands\nOak Ridge Associated Universities (ORAU) (Private) | https://orise.orau.gov/index.html\nDetails\nPosting:\nhttps://www.zintellect.com/Opportunity/Details/USDA-USFS-SRS-2025-0067\nApplication Deadline:\n08/29/2025\nPublished:\n07/11/2025\nStarting Date:\nafter 8/1/2025\nHours per Week:\nat least 20\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nDurham, North Carolina\nremote work allowed\nTags:\nGraduate Opportunities\nDescription\n *Applications will be reviewed on a rolling-basis.\n\nUSDA Forest Service Office/Lab and Location: A fellowship opportunity is available with the US Department of Agriculture (USDA) Forest Service (FS) within the Forest Service Southern Research Station (SRS) located in Durham, North Carolina. The opportunity may be remote.\n\nAt the heart of the USDA Forest Service's mission is their purpose. Everything they do is intended to help sustain forests and grasslands for present and future generations. Why? Because their stewardship work supports nature in sustaining life. This is the purpose that drives the agency’s mission and motivates their work across the agency. It’s been there from the agency’s very beginning, and it still drives them. To advance the mission and serve their purpose, the USDA Forest Service balances the short and long-term needs of people and nature by: working in collaboration with communities and our partners; providing access to resources and experiences that promote economic, ecological, and social vitality; connecting people to the land and one another; and delivering world-class science, technology and land management.\n\nThe mission of the United States Forest Service (USFS) Southern Research Station (SRS) is to create science and technology needed to sustain and enhance forest ecosystems and the benefits they provide. The Center for Economics and Social Science (CESS), located within USFS-SRS, includes the Forest Economics and Policy Unit (RWU-4804). The research mission of the unit is to advance the science between natural and human-caused disturbances and economic values, and how those disturbances can be managed to reduce undesired impacts on society and ecosystems.\n\nResearch Project: The Forest Economic and Policy Unit is seeking an ORISE participant to help quantify the economic effectiveness of wildfire prevention programs (and their associated “activities”) at reducing human-caused wildfires on Tribal lands in the United States. The purpose of this experience will be to quantify temporal and spatial effects of fire prevention programs on human ignitions by including individual management practices from a time series dataset. We expect that the participant will use econometric methods to approach this research objective.\n\nLearning Objectives: The ORISE participant will learn about relevant fire prevention programs, fire prevention activities, and associated datasets. In addition, the participant will receive guidance with novel econometric techniques, and receive support with scientific writing.\n\nThe participant will have the opportunity to collaborate and receive mentorship from scientists and mangers in USFS and Bureau of Indian Affairs. The participant will develop scientific writing and econometric skills, as well as increase proficiency using statistical software (such as STATA or R). The mentor will encourage dissemination of results among managers and research groups.  \n\nMentor: The mentor for this opportunity is Sonia Bruck (sonia.bruck@usda.gov). If you have questions about the nature of the research, please contact the mentor.\n\nAnticipated Appointment Start Date: August 2025.  Start date is flexible and will depend on a variety of factors.\n\nAppointment Length: The appointment will initially be until December 30, 2025, but may be extended upon recommendation of USDA Forest Service and is contingent on the availability of funds.\n\nLevel of Participation: The appointment is part time.\n\nParticipant Stipend: The participant will receive a monthly stipend commensurate with educational level and experience. The anticipated stipend range is $3,000-$3,500 per month.\n\nCitizenship Requirements: This opportunity is available to U.S. citizens, Lawful Permanent Residents (LPR), and foreign nationals. Non-U.S. citizen applicants should refer to the Guidelines for Non-U.S. Citizens Details page of the program website for information about the valid immigration statuses that are acceptable for program participation. Foreign national candidates may have a mandatory in-person requirement depending on visa status.\n\nORISE Information: This program, administered by ORAU through its contract with the U.S. Department of Energy (DOE) to manage the Oak Ridge Institute for Science and Education (ORISE), was established through an interagency agreement between DOE and USDA Forest Service. Participants do not become employees of USDA, USDA Forest Service, DOE or the program administrator, and there are no employment-related benefits. Proof of health insurance is required for participation in this program. Health insurance can be obtained through ORISE.\n\nQuestions: Please visit our Program Website. After reading, if you have additional questions about the application process please email ORISE.USFS.SRS@orau.org and include the reference code for this opportunity.\n\nQualifications\nThe qualified candidate should be currently pursuing or have received a master's or postdoctoral degree in the one of the relevant fields (Forestry Economics or Applied Economics). Degree must have been received or be currently pursuing by the start date.\n\nPreferred skills:\n\nExperience with econometric methods, and some knowledge in forestry or wildland fire science.\n  Contact\nUSDA-USFS-SRS-2025-0067\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Citizenship Requirements: This opportunity is available to U.S. citizens, Lawful Permanent Residents (LPR), and foreign nationals. Non-U.S. citizen applicants should refer to the Guidelines for Non-U.S. Citizens Details page of the program website for information about the valid immigration statuses that are acceptable for program participation. Foreign national candidates may have a mandatory in-person requirement depending on visa status.",
    "project_details": "USDA Forest Service Office/Lab and Location: A fellowship opportunity is available with the US Department of Agriculture (USDA) Forest Service (FS) within the Forest Service Southern Research Station (SRS) located in Durham, North Carolina. The mission of the United States Forest Service (USFS) Southern Research Station (SRS) is to create science and technology needed to sustain and enhance forest ecosystems and the benefits they provide. The research mission of the unit is to advance the science between natural and human-caused disturbances and economic values, and how those disturbances can be managed to reduce undesired impacts on society and ecosystems",
    "contact_info": "",
    "application_deadline": "08/29/2025\nPublished:\n07/11/2025\nStarting Date:\nafter 8/1/2025\nHours per Week:\nat least 20\nSalary:\nCommensurate / Negotiable\nEducation Required:\nMasters\nExperience Required:\nat least 2 years\nLocation:\nDurham, North Carolina\nremote work allowed\nTags:\nGraduate Opportunities\nDescription\n *Applications will be reviewed on a rolling-basis",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.216,
    "discipline_keywords": [
      "land management",
      "forest service",
      "forestry",
      "wildfire",
      "agriculture"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.903903+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Research Associate Specialist--Production and Monitoring of Giant Salvinia Weevils",
    "organization": "Louisiana State University (State)",
    "location": "404 Life Sciences Bldg., Baton Rouge, LA 70803, USA (Baton Rouge, Louisiana)",
    "salary": "$42,000 to $55,000 per year",
    "starting_date": "after 8/20/2025",
    "published_date": "07/09/2025",
    "tags": "Graduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107660",
    "description": "Research Associate Specialist--Production and Monitoring of Giant Salvinia Weevils\nLouisiana State University (State) | http://www.lsu.edu\nDetails\nPosting:\nhttps://www.lsuagcenter.com/profiles/amarrero/articles/page1752068756946\nApplication Deadline:\n08/01/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/20/2025\nHours per Week:\nat most 40\nSalary:\n$42,000 to $55,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 1 year\nLocation:\n404 Life Sciences Bldg., Baton Rouge, LA 70803, USA (Baton Rouge, Louisiana)\nTags:\nGraduate Opportunities\nDescription\n(This is a grant-funded, one-year, non-tenure track position. Funding must be available for any continuation of appointment.)\n\nWork Location: Department of Entomology, LSU AgCenter, Baton Rouge, LA.\n\nPosition Description: In the Diaz Laboratory, we strive to give the best career-building opportunities for our team members; this includes involvement with diverse projects on invasive species and biological control, training on field and laboratory techniques, exposure to international cooperation, mentoring research assistants, establishment multidisciplinary projects, hands-on preparation of technical and non-technical publications, among others. We are seeking a candidate to join our team!\n\nThe successful candidate will be responsible for rearing salvinia weevils (Cyrtobagous salviniae) in a greenhouse and open-earthen ponds located in Baton Rouge, LA. Activities will include inoculation of giant salvinia (Salvinia molesta) into the ponds, fertilization of plants, weeding, inoculation of weevils, monitoring of pond conditions, and harvest of weevils. Regular pond maintenance will include occasional herbicide and insecticide applications to reduce pest densities. The associate will follow an established quality-control protocol for the mass rearing operation. Water quality data (pH, conductivity, nitrogen levels) and weevil density (adults and larvae counts) will be collected monthly. The associate will work closely with team leaders of LSU AgCenter and Coastal Wetlands Planning, Protection and Restoration Act (CWPPRA) to coordinate the harvest of weevil-infested salvinia for distribution in coastal parishes. The impact of the biological control program will be monitored at several marshes in coastal Louisiana. The associate will sample several field sites in coastal Louisiana and collect data such as salvinia biomass, submerged aquatic vegetation, water quality, and weevil densities. Monitoring the salvinia control will include the use of drones and satellites. A team of student workers, interns, and graduate students working on salvinia will be available to assist the associate with activities. Therefore, we seek an applicant with experience with managing people, mentoring students, or coordinating projects.\n\nPhysical activities related to this job may include but are not limited to: periodic lifting of 20 lbs., mowing perimeter of ponds, using a backpack sprayer, driving state trucks and boats, wading in waist deep water to collect weevil samples, and harvesting ponds. The successful candidate will prepare quarterly reports and will work closely with collaborators in CWPPRA and USFWS.\n\nFor more information about biological control of giant salvinia and the Diaz Laboratory, please visit: www.lsuagcenter.com/giantsalvinia, or the www.rodrigodiazlab.com, or https://instagram.com/lsubiocontrol.\n\nQualification Requirements: Bachelor’s or Master’s degree in Natural Resources Management or related discipline including Entomology, Ecology, Biology, or Botany. Experience working in wetlands, freshwater habitats, monitoring of water quality, Geographic Information Systems (GIS), Google Earth Engine, drone mapping, boating is preferred. We seek a candidate with good scientific writing and oral communication.\n\nLSU and the AgCenter are dedicated to fostering an environment where our employees feel appreciated for their skills and individual qualifications. If a candidate does not meet the minimum qualifications listed but has other qualifications or substantial experience related to the key responsibilities, we encourage them to apply (per La. RS 42:36).\n\nSalary and Benefits: Salary will be commensurate with education and experience. The LSU AgCenter has an attractive benefits package with a wide variety of benefit options. Benefits offered include retirement, multiple medical insurance options, supplemental insurances (dental, life, long-term disability, accident, vision, long-term care, etc.), Tax Saver Flexible Benefits Plan (saves tax dollars on some child care and medical expenses), university holidays (14 per year, typically includes a week off at Christmas), generous annual (vacation) and sick leave benefits, Employee Assistance Program, and possible educational leave and tuition exemption for coursework at campuses of the LSU System. Specific benefits depend on job category, percent effort and length of employment.\n\nDate Available: Upon completion of selection process.\n\nApplication Deadline: July 30, 2025 or until a suitable candidate is identified.\n\nApplication Procedure: Apply online at LSU AgCenter Careers (or through Workday for internal applicants) by attaching cover letter with resume, transcripts, curriculum vitae and contact information for three references. (Paper, faxed or e-mailed application materials will not be accepted.) For more information contact:\n\nDr. Rodrigo Diaz\nLouisiana State University\nDepartment of Entomology\n404 Life Sciences\nBaton Rouge, LA 70803\nPhone: (225) 578-1835\nEmail: rdiaz@agcenter.lsu.edu\nWebsite: AgCenter website\n\nThe LSU Agricultural Center is a statewide campus of the LSU System and provides equal opportunities in programs and employment. An Equal Opportunity Employer.\nContact\nRodrigo Diaz\n225 578 1835\nrdiaz@lsu.edu (preferred contact method)",
    "requirements": "(This is a grant-funded, one-year, non-tenure track position. Funding must be available for any continuation of appointment.)\n\nWork Location: Department of Entomology, LSU AgCenter, Baton Rouge, LA.\n\nPosition Description: In the Diaz Laboratory, we strive to give the best career-building opportunities for our team members; this includes involvement with diverse projects on invasive species and biological control, training on field and laboratory techniques, exposure to international cooperation, mentoring research assistants, establishment multidisciplinary projects, hands-on preparation of technical and non-technical publications, among others. We are seeking a candidate to join our team!\n\nThe successful candidate will be responsible for rearing salvinia weevils (Cyrtobagous salviniae) in a greenhouse and open-earthen ponds located in Baton Rouge, LA. Activities will include inoculation of giant salvinia (Salvinia molesta) into the ponds, fertilization of plants, weeding, inoculation of weevils, monitoring of pond conditions, and harvest of weevils. Regular pond maintenance will include occasional herbicide and insecticide applications to reduce pest densities. The associate will follow an established quality-control protocol for the mass rearing operation. Water quality data (pH, conductivity, nitrogen levels) and weevil density (adults and larvae counts) will be collected monthly. The associate will work closely with team leaders of LSU AgCenter and Coastal Wetlands Planning, Protection and Restoration Act (CWPPRA) to coordinate the harvest of weevil-infested salvinia for distribution in coastal parishes. The impact of the biological control program will be monitored at several marshes in coastal Louisiana. The associate will sample several field sites in coastal Louisiana and collect data such as salvinia biomass, submerged aquatic vegetation, water quality, and weevil densities. Monitoring the salvinia control will include the use of drones and satellites. A team of student workers, interns, and graduate students working on salvinia will be available to assist the associate with activities. Therefore, we seek an applicant with experience with managing people, mentoring students, or coordinating projects.\n\nPhysical activities related to this job may include but are not limited to: periodic lifting of 20 lbs., mowing perimeter of ponds, using a backpack sprayer, driving state trucks and boats, wading in waist deep water to collect weevil samples, and harvesting ponds. The successful candidate will prepare quarterly reports and will work closely with collaborators in CWPPRA and USFWS.\n\nFor more information about biological control of giant salvinia and the Diaz Laboratory, please visit: www.lsuagcenter.com/giantsalvinia, or the www.rodrigodiazlab.com, or https://instagram.com/lsubiocontrol.\n\nQualification Requirements: Bachelor’s or Master’s degree in Natural Resources Management or related discipline including Entomology, Ecology, Biology, or Botany. Experience working in wetlands, freshwater habitats, monitoring of water quality, Geographic Information Systems (GIS), Google Earth Engine, drone mapping, boating is preferred. We seek a candidate with good scientific writing and oral communication.\n\nLSU and the AgCenter are dedicated to fostering an environment where our employees feel appreciated for their skills and individual qualifications. If a candidate does not meet the minimum qualifications listed but has other qualifications or substantial experience related to the key responsibilities, we encourage them to apply (per La. RS 42:36).\n\nSalary and Benefits: Salary will be commensurate with education and experience. The LSU AgCenter has an attractive benefits package with a wide variety of benefit options. Benefits offered include retirement, multiple medical insurance options, supplemental insurances (dental, life, long-term disability, accident, vision, long-term care, etc.), Tax Saver Flexible Benefits Plan (saves tax dollars on some child care and medical expenses), university holidays (14 per year, typically includes a week off at Christmas), generous annual (vacation) and sick leave benefits, Employee Assistance Program, and possible educational leave and tuition exemption for coursework at campuses of the LSU System. Specific benefits depend on job category, percent effort and length of employment.\n\nDate Available: Upon completion of selection process.\n\nApplication Deadline: July 30, 2025 or until a suitable candidate is identified.\n\nApplication Procedure: Apply online at LSU AgCenter Careers (or through Workday for internal applicants) by attaching cover letter with resume, transcripts, curriculum vitae and contact information for three references. (Paper, faxed or e-mailed application materials will not be accepted.) For more information contact:\n\nDr. Rodrigo Diaz\nLouisiana State University\nDepartment of Entomology\n404 Life Sciences\nBaton Rouge, LA 70803\nPhone: (225) 578-1835\nEmail: rdiaz@agcenter.lsu.edu\nWebsite: AgCenter website\n\nThe LSU Agricultural Center is a statewide campus of the LSU System and provides equal opportunities in programs and employment. An Equal Opportunity Employer.",
    "project_details": "Research Associate Specialist--Production and Monitoring of Giant Salvinia Weevils\nLouisiana State University (State) | http://www. Position Description: In the Diaz Laboratory, we strive to give the best career-building opportunities for our team members; this includes involvement with diverse projects on invasive species and biological control, training on field and laboratory techniques, exposure to international cooperation, mentoring research assistants, establishment multidisciplinary projects, hands-on preparation of technical and non-technical publications, among others",
    "contact_info": "",
    "application_deadline": "08/01/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/20/2025\nHours per Week:\nat most 40\nSalary:\n$42,000 to $55,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 1 year\nLocation:\n404 Life Sciences Bldg",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Fisheries & Aquatic Science",
    "discipline_confidence": 0.18,
    "discipline_keywords": [
      "aquatic",
      "freshwater",
      "pond",
      "coastal",
      "water quality"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:13.995432+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Forest Environmental Planner",
    "organization": "Quinault Indian Nation (Tribal Government)",
    "location": "1214 Aalis Dr (Taholah, Washington)",
    "salary": "$71,000 to $86,000 per year",
    "starting_date": "after 7/8/2025",
    "published_date": "07/08/2025",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=105227",
    "description": "Forest Environmental Planner\nQuinault Indian Nation (Tribal Government) | https://www.quinaultindiannation.com/\nDetails\nPosting:\nhttps://www.quinaultindiannation.com/161/Human-Resources\nApplication Deadline:\n07/31/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 7/8/2025\nHours per Week:\n40\nSalary:\n$71,000 to $86,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\n1214 Aalis Dr (Taholah, Washington)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nJOB SUMMARY\nOversees, develops, and ensures full implementation of the Quinault Indian Reservation (QIR) Forest Management Plan (FMP) and all affiliated documents (Environmental Assessment and Biological Opinion). Works with internal and external agencies to support the whole lifecycle of the forest from seed harvest, tree growing, reforestation, and timber harvest. \n ESSENTIAL FUNCTIONS \nProvides support and communication between Environmental Protection and Forestry departments. \nLeads and coordinates interdisciplinary team to prepare timber sale packages. \nMonitors all National Environmental Policy Act (NEPA) applicable projects and maintains formal documentation for projects related to NEPA. \nLeads, coordinates, and administers archeology contracts related to Section 106 of the National Historic Preservation Act. \nMaintains all federal permits and reports related to the Endangered Species Act and “Biological Opinions” as they relate to Forestry and Environmental Protection. \nWrites and submits necessary reports to the United States Fish and Wildlife Service annually. \nMaintains current and accurate tracking of all information relating to US Fish & Wildlife ESA/Biological Opinion requirements. \nFacilitates development of 10-year Forest Management Plan (FMP).\nFacilitates development of and updates to QIN forest practice regulations.  \nAdvises senior management and Business Committee on all levels of Forestry planning needs and opportunities, reports on program needs and developments on a regular basis.  \nWorks with internal and external groups to develop programs to secure and encourage support in the implementation of relevant programs.\nCollaborates with management, professional, technical, and support staff in the development and implementation of program functions to achieve stated goals and objectives.\nParticipates in and hosts regular meetings to ensure communication between staff and forestry-related activities. \nDevelops and implements policies and procedures relating to the effective operation of assigned area’s operations and ensures the accomplishment of these policies and procedures.\nIdentifies program priorities and targets; devises realistic planning and needs assessment.\nBuilds and maintains relationships with public and/or private entities, agencies, organizations, and the public on matters appropriate to the areas of responsibility; coordinates with other units of the Nation to achieve overall objectives, priorities, and timeliness.\nDevelops techniques and standards for evaluation of program activities; ensures that programs comply with Quinault and other governmental regulations, ordinances, laws, grants, policies, and other guidelines.\nWrites comprehensive and concise verbal and written reports, to assist senior management and the Business Committee, for internal and external use.  \nEstablishes and maintains an effective system of communications within the organization and builds and fosters effective working relationships with others.  \nRepresents the Nation at national, state, and local meetings/conferences to promote and explain the Nation’s objectives.  \nEnhances professional growth and development through participation in seminars, educational workshops, classes, and conferences. \nPrepares and administers contracts for assigned project areas. \nConducts professional field, project, and analytic activities and provides expertise as needed. \nPerforms other duties as required or assigned.\n PREFERRED QUALIFICATION\n·         Master of Science degree in forest management, or related field, and\n·         Two years of experience in forest planning. \n·         PMP certification.\n MINIMUM QUALIFICATIONS\n·         Bachelor of Science degree in forest management, environmental planning, or related field, and\n·         Two (2) years of experience in forest management project management, with one-year natural resources planning experience.\n·         Demonstrated knowledge of National Environmental Policy Act (NEPA). \n·         Valid Washington State driver license is required. Must qualify for QIN insurance.\n\nDESIRED KNOWLEDGE, SKILLS, AND ABILITIES \nKnowledge of:\nTraditional forms of government and tribal customs and traditions.\nApplicable federal, state, tribal laws, regulations, and requirements. \nPolicies, functions, and responsibilities of the Quinault Indian Nation.\nPrinciples and practices of administration, financial, and personnel management.\nPrinciples and practices of forestry, ecology, and silviculture.\nModern forest management trends.\nSources of federal, state, local, and private funding for the Nation’s programs.\n Skill in:\nProviding leadership in the development and delivery of forestry programs. \nOrganization skills and detail oriented. \nBudget development and administration, financial planning, and cost control.\nForest analytics. \nMaintains skills concurrent with industry practices and technology, including GIS. \nThe use of industry-related field equipment and gear. \nOffice software and industry-related applications.\nCorrect English usage, grammar, spelling, and punctuation.\n Ability to:\nServe as technical advisor to senior management. \nEstablish and maintain adequate service levels and cost controls for department services.\nPrepare comprehensive and concise reports and plans.\nCommunicate effectively in written and oral form.\nSpeak persuasively before groups.\nInteract and maintain good working relationships with individuals of varying social and cultural backgrounds.\nAnalyze situations and adopt appropriate courses of action.\nMake solid decisions and exercise independent judgment.\nWork in a fast-paced environment and meet deadlines.  \n\nIf you have any questions regarding the position, please reach out to the hiring manager, Rebecca Rollins, Silviculture and Planning Manager, at rebecca.rollins@quinault.org.\n\nPlease email resume, cover letter, application, copies of certifications and/or diplomas, and any other relevant documents to jobs@quinault.org and cc Rebecca Rollins (rebecca.rollins@quinault.org). \n\nApplications and more information can be found at Human Resources | Quinault Indian Nation, WA\n\nReview of applications will begin 7/15/2025. Position will be posted until filled. \n\nContact\nRebecca Rollins\n3606605961\nrebecca.rollins@quinault.org (preferred contact method)",
    "requirements": "Provides support and communication between Environmental Protection and Forestry departments. \nLeads and coordinates interdisciplinary team to prepare timber sale packages. \nMonitors all National Environmental Policy Act (NEPA) applicable projects and maintains formal documentation for projects related to NEPA. \nLeads, coordinates, and administers archeology contracts related to Section 106 of the National Historic Preservation Act. \nMaintains all federal permits and reports related to the Endangered Species Act and “Biological Opinions” as they relate to Forestry and Environmental Protection. \nWrites and submits necessary reports to the United States Fish and Wildlife Service annually. \nMaintains current and accurate tracking of all information relating to US Fish & Wildlife ESA/Biological Opinion requirements. \nFacilitates development of 10-year Forest Management Plan (FMP).\nFacilitates development of and updates to QIN forest practice regulations.  \nAdvises senior management and Business Committee on all levels of Forestry planning needs and opportunities, reports on program needs and developments on a regular basis.  \nWorks with internal and external groups to develop programs to secure and encourage support in the implementation of relevant programs.\nCollaborates with management, professional, technical, and support staff in the development and implementation of program functions to achieve stated goals and objectives.\nParticipates in and hosts regular meetings to ensure communication between staff and forestry-related activities. \nDevelops and implements policies and procedures relating to the effective operation of assigned area’s operations and ensures the accomplishment of these policies and procedures.\nIdentifies program priorities and targets; devises realistic planning and needs assessment.\nBuilds and maintains relationships with public and/or private entities, agencies, organizations, and the public on matters appropriate to the areas of responsibility; coordinates with other units of the Nation to achieve overall objectives, priorities, and timeliness.\nDevelops techniques and standards for evaluation of program activities; ensures that programs comply with Quinault and other governmental regulations, ordinances, laws, grants, policies, and other guidelines.\nWrites comprehensive and concise verbal and written reports, to assist senior management and the Business Committee, for internal and external use.  \nEstablishes and maintains an effective system of communications within the organization and builds and fosters effective working relationships with others.  \nRepresents the Nation at national, state, and local meetings/conferences to promote and explain the Nation’s objectives.  \nEnhances professional growth and development through participation in seminars, educational workshops, classes, and conferences. \nPrepares and administers contracts for assigned project areas. \nConducts professional field, project, and analytic activities and provides expertise as needed. \nPerforms other duties as required or assigned.",
    "project_details": "Monitors all National Environmental Policy Act (NEPA) applicable projects and maintains formal documentation for projects related to NEPA. Prepares and administers contracts for assigned project areas. Conducts professional field, project, and analytic activities and provides expertise as needed",
    "contact_info": "",
    "application_deadline": "07/31/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 7/8/2025\nHours per Week:\n40\nSalary:\n$71,000 to $86,000 per year\nEducation Required:\nBachelors\nExperience Required:\nat least 2 years\nLocation:\n1214 Aalis Dr (Taholah, Washington)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nJOB SUMMARY\nOversees, develops, and ensures full implementation of the Quinault Indian Reservation (QIR) Forest Management Plan (FMP) and all affiliated documents (Environmental Assessment and Biological Opinion)",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.278,
    "discipline_keywords": [
      "natural resources",
      "forestry",
      "forest management",
      "timber",
      "silviculture"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:14.096127+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "IA Wildlife Management Specialist",
    "organization": "Pheasants Forever and Quail Forever (Federal)",
    "location": "multiple",
    "salary": "starting at $17 per hour",
    "starting_date": "after 7/23/2025",
    "published_date": "07/11/2025",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107702",
    "description": "IA Wildlife Management Specialist\nPheasants Forever and Quail Forever (Federal) | http://www.pheasantsforever.org\nDetails\nPosting:\nhttps://www.pheasantsforever.org/jobs\nApplication Deadline:\n07/22/2025\nPublished:\n07/11/2025\nStarting Date:\nafter 7/23/2025\nHours per Week:\nat least 40\nSalary:\nstarting at $17 per hour\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocations:\nPanora, Iowa\nWallingford, Iowa\nDescription\nTwo positions available\nWork Locations:\nIowa DNR Saylorville Wildlife Unit - Bays Branch Headquarters (Guthrie County)\n3123 200th St, Panora, IA 50216\n\nIowa DNR Prairie Lakes Wildlife Unit (Emmet County)\n2203 Ingham Lake Road, Wallingford, IA 51365\n\nApplication deadline: July 22, 2025\nSalary: $17.00 per hour\nTypical Hours: 7:30 a.m. – 4:00 p.m. – 40 hours per week\n\nAnticipated Start Date: 2-4 weeks post successful job offer\nEnd Date: One year from start date\n\nJOB DESCRIPTION:  These positions are part of a partnership between Pheasants Forever and Iowa Department of Natural Resources. Under the daily direction of Iowa DNR staff, the incumbent will conduct habitat management work on public wildlife areas. The PF Wildlife Management Specialist is expected to perform a variety of semi-skilled maintenance and technical tasks at a wildlife management unit. The employee is expected to display a high level of initiative and commitment towards completing assignments efficiently.  Employees in this position will work with other wildlife unit personnel and be under the general direction of the Wildlife Biologist.  The job duties of this position include general wildlife management activities on State owned wildlife areas within the assigned unit counties.  Overnight travel will occasionally be required on special projects outside of the assigned unit counties. Click here to view a video of what typical job duties may include.\n\nExamples of typical job duties may include:\nPerform general wildlife management activities including:  Wetland management, prairie management, native prairie seeding, food plot development, edge feathering, tree/brush removal, spraying, disking, mowing, etc. using large farm machinery, chainsaws, and other hand tools.\nPrescribed fire implementation for ecological purposes.  This duty will require fire-line construction, fire-line holding, and mop-up activities.  Performance of these tasks will require the employee to periodically work under physically stressful and adverse conditions.  Proficiency in the use of basic wildland firefighting equipment will be needed.          \nWildlife Surveys & Monitoring including:  Waterfowl banding, deer spotlight routes, August roadside surveys, spring bird point counts, fall quail covey counts, chronic wasting disease sampling, etc.  Collecting of biological data occasionally will require early or late in the day work scheduling.\nGeneral area maintenance involving mowing, sign posting, fence building, fence removal, tree/brush control, noxious weed control etc.  These activities require the ability to use simple power equipment; drills, saws, hand tools, chain saws, trimmers, small mowers etc.   \nSpecial assignments may require some overnight travel as part of a crew, to accomplish large scale fence removal, fence building or tree removal projects outside of the assigned unit counties.  These assignments will require the ability to work well with others, work out of doors under all types of weather conditions, and to withstand physically demanding work, i.e., lifting, bending and hauling.             \n\nMINIMUM QUALIFICATIONS:\nCollege graduate with a degree in wildlife biology, animal ecology, or another closely related natural resource field. \nAbility to work outdoors in all weather conditions.\nAble to travel on overnight duties.\nWork with minimal supervision; demonstrate responsible behavior and attention to detail.\nMust have a valid motor vehicle operator’s license.\nAble to work alone or as part of a team, with the public, in all conditions, on weekends, holidays, nights, and evenings as required.\nExhibit honesty and integrity. Follow policy and cooperate with supervisors and co-workers.\nDisplay a high level of initiative, effort and commitment towards completing assignments efficiently. \n\nCAREER ADVANCEMENT BENEFITS:\nWork alongside permanent DNR staff to develop technical skills.\nWork outdoors.\nGreat opportunity to expand your professional network and make lasting connections.\nHigh rate of recruitment from PF Wildlife Specialist positions to permanent positions within DNR, PF and other conservation entities.\nGet a preview of employment within two organizations simultaneously, with opportunities to attend annual staff meetings for both DNR and Pheasants Forever.\nPheasants Forever offers a competitive benefits package. Employee Benefit Package information can be found here:  Employee Benefit Summary pdf\n\nTo Apply: Please include your cover letter, including which location(s) you are interested in, resume and 3 references as part of your application on our recruitment website at www.pheasantsforever.org/jobs.\n\n*Please ensure that you include your location preferences in your cover letter.\n\nSPECIAL REQUIREMENTS:  Must possess or be able to acquire a pesticide applicator’s license and S130-190 basic firefighter training certification, special requirements shall be met within 90 days of hire if not currently possessed. Successful applicant will also be encouraged to obtain a commercial driver’s license, Iowa DNR chainsaw safety certification, and first aid & bloodborne pathogen training.\n\nIf you have additional questions, please contact Bryan Hellyer, IA DNR – Saylorville, bryan.hellyer@dnr.iowa.gov or 319-591-1244 OR Brian Hickman, IA DNR – Prairie Lakes, brian.hickman@dnr.iowa.gov or 712-250-0518. \n\nPheasants Forever, Inc is an Equal Opportunity/Affirmative Action employer.  All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, status as a qualified individual with disability, or any other category that may be protected by law.\nContact\nAlex Wallace\ncontact via the web posting is preferred (see Details section)",
    "requirements": "To Apply: Please include your cover letter, including which location(s) you are interested in, resume and 3 references as part of your application on our recruitment website at www.pheasantsforever.org/jobs.\n\n*Please ensure that you include your location preferences in your cover letter.\n\nSPECIAL REQUIREMENTS:  Must possess or be able to acquire a pesticide applicator’s license and S130-190 basic firefighter training certification, special requirements shall be met within 90 days of hire if not currently possessed. Successful applicant will also be encouraged to obtain a commercial driver’s license, Iowa DNR chainsaw safety certification, and first aid & bloodborne pathogen training.\n\nIf you have additional questions, please contact Bryan Hellyer, IA DNR – Saylorville, bryan.hellyer@dnr.iowa.gov or 319-591-1244 OR Brian Hickman, IA DNR – Prairie Lakes, brian.hickman@dnr.iowa.gov or 712-250-0518. \n\nPheasants Forever, Inc is an Equal Opportunity/Affirmative Action employer.  All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, status as a qualified individual with disability, or any other category that may be protected by law.",
    "project_details": "Overnight travel will occasionally be required on special projects outside of the assigned unit counties. Special assignments may require some overnight travel as part of a crew, to accomplish large scale fence removal, fence building or tree removal projects outside of the assigned unit counties",
    "contact_info": "",
    "application_deadline": "07/22/2025\nPublished:\n07/11/2025\nStarting Date:\nafter 7/23/2025\nHours per Week:\nat least 40\nSalary:\nstarting at $17 per hour\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocations:\nPanora, Iowa\nWallingford, Iowa\nDescription\nTwo positions available\nWork Locations:\nIowa DNR Saylorville Wildlife Unit - Bays Branch Headquarters (Guthrie County)\n3123 200th St, Panora, IA 50216\n\nIowa DNR Prairie Lakes Wildlife Unit (Emmet County)\n2203 Ingham Lake Road, Wallingford, IA 51365\n\nApplication deadline: July 22, 2025\nSalary: $17",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.333,
    "discipline_keywords": [
      "wildlife",
      "animal ecology",
      "wildlife management",
      "deer",
      "waterfowl"
    ],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:14.180645+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "\"I Am Bear Safe Specialist\" -Teton Country",
    "organization": "Wildlife Restoration Foundation (Private)",
    "location": "Victor, Driggs, Tetonia, Idaho",
    "salary": "none",
    "starting_date": "after 8/4/2025",
    "published_date": "07/10/2025",
    "tags": "Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107691",
    "description": "\"I Am Bear Safe Specialist\" -Teton Country\nWildlife Restoration Foundation (Private) | https://www.wildlifeandparks.org/\nDetails\nPosting:\nhttps://www.wildlifeandparks.org/\nApplication Deadline:\n09/30/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 8/4/2025\nHours per Week:\n10 - 16\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nVictor, Driggs, Tetonia, Idaho\nTags:\nUndergraduate Opportunities\nDescription\n\nWildlife Restoration Foundation\n\n\nwww.wildlifeandparks.org \n\n\n BEAR CONSERVATION SPECIALIST\n\n\n Teton Country\n\n\nThe Wildlife Restoration Foundation (WRF) Bear Conservation Specialist-Teton Country position is open to qualified individuals passionate about bears and based near Victor, Driggs, Tetonia, and other towns along the Caribou-Targhee National Forest. The position is unpaid, but stipends are available to cover expenses and to reward accomplishments. The Bear Conservation Specialist (Teton Country) will rapidly gain valuable professional experience by playing an integral role on the WRF team. Work to build WRF’s bear conservation capacity and impact on Teton National Park bears as you contribute and strengthen your conservation knowledge and skills. Gain recognition for your efforts among area partners, on the WRF website, and elsewhere, as you participate in meeting WRF’s mission, which is to increase park wildlife population viability both ex situ and in situ, working closely with National Parks and Forests, zoo partners, and park gateway communities.\n\n\nWRF operates effectively and efficiently and generates resources that enable measurable, boots-on-the-ground conservation results. The WRF Bear Conservation Specialist (Teton Country) will focus on implementation of the “I Am Bear Safe” Project in small towns neighboring Teton National Park’s gateway communities in Montana. The Bear Conservation Specialist (Teton Country) will collaborate with the WRF President, Director of Communications, and other team members in connection to the “I Am Bear Safe” Project.\n\n\n [https://www.wildlifeandparks.org/projects].\n\n\n“I Am Bear Safe”™ (IABS) is a multi-partner Wildlife Coexistence Strategy designed to equip National Park gateway community chambers of commerce and their member businesses (“Park Gateway Partners”) to “train people not to train bears” to get in the trouble they are in now because of human behavior—a situation that is assuring bear demise. Bears are a top attraction at many National Parks and are well-managed within the parks to avoid human interaction. But communities at the park’s edge are not sufficiently prepared or equipped for the increasing pressure of more visitors coupled with rapid development, naïve new residents, and a growing number of recreationists in bear country. Park Gateway Partner (PGP) businesses are the perfect intervention point and receive marketing benefits from participating in the IABS town-based bear stewardship effort. WRF provides customized tools (signage and SWAG) that equip PGPs to effectively intercept park visitors and recreationists and equip them to be bear stewards who act responsibly by securing attractants and following park rules for recreating in bear habitat. The IABS goal is that bears perform their natural behaviors and survive without risk and distraction caused by humans.\n\n\nResponsibilities:\n\nTrack the inventory of IABS materials distributed to PGPs in each town.\nDistribute IABS Toolkit materials to PGPs and redistribution points.\nRecruit new PGPs, as appropriate and assigned.\nField questions and relay PGP concerns to WRF.\nAttend meetings of the chamber of commerce or local partner organization on occasion.\nMail out reward IABS reward magnets to Bear Quiz-takers.\nCome up with novel ideas to make the IABS Project more effective.\n\nEducation & Experience\n\nBachelor’s degree in a relevant subject is required; graduate degree helpful.\nKnowledge and experience specific to grizzly and black bears required.\nExperience working with community-based organizations and/or local businesses.\n\nWRF Bear Conservation Specialists are asked to participate in an initial training then designate 16 hours a week to WRF and agree to work with WRF for 4 months. The Bear Conservation Specialist (Teton Country) Should be a self-starter, ambitious, creative, productive, and dedicated to WRF’s mission. S/he must also exhibit a high degree of professionalism, accountability, and ability to follow instructions and manage time well. S/he should be friendly and approachable, well-spoken, bold, and personable.  The internship is unpaid, but stipends are provided for approved expenses and as results are achieved. \n\n\nThe Bear Conservation Specialist (Teton Country) will report to Julie Anton Randall, WRF President. Hours are flexible within the week, with the exception that PGP deliveries and communications best occur during business hours. Participation in biweekly IABS team meetings and occasional full WRF team meetings by Zoom are required.\n\nPlease send a short (less than one page) cover letter and resume with references to wildliferestorationvolunteer@gmail.com.  Please name the electronic file as follows: [Date]_BCS-Teton-Country_[Your Name].\n\nThank you for your dedication to bears and excitement about being part of the Wildlife Restoration Foundation team in Teton Country!\n\n\n\nContact\nOlivia Kramer\ninfo@wildlifeandparks.org (preferred contact method)",
    "requirements": "Hours per Week:\n10 - 16\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "The WRF Bear Conservation Specialist (Teton Country) will focus on implementation of the “I Am Bear Safe” Project in small towns neighboring Teton National Park’s gateway communities in Montana. The Bear Conservation Specialist (Teton Country) will collaborate with the WRF President, Director of Communications, and other team members in connection to the “I Am Bear Safe” Project. org/projects]",
    "contact_info": "",
    "application_deadline": "09/30/2025\nPublished:\n07/10/2025\nStarting Date:\nafter 8/4/2025\nHours per Week:\n10 - 16\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\nVictor, Driggs, Tetonia, Idaho\nTags:\nUndergraduate Opportunities\nDescription\n\nWildlife Restoration Foundation\n\n\nwww",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:14.270844+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Puget Sound Toxic Contaminants Policy Planner - Environmental Planner 4 - Permanent - *04687-25",
    "organization": "Washington Department of Fish & Wildlife (State)",
    "location": "Olympia, Washington",
    "salary": "$6,259 to $8,415 per month",
    "starting_date": "after 8/16/2025",
    "published_date": "07/09/2025",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107653",
    "description": "Puget Sound Toxic Contaminants Policy Planner - Environmental Planner 4 - Permanent - *04687-25\nWashington Department of Fish & Wildlife (State) | https://wdfw.wa.gov/\nDetails\nPosting:\nhttps://www.governmentjobs.com/careers/washington/jobs/4997908/puget-sound-toxic-contaminants-policy-planner-environmental-planner-4-permane\nApplication Deadline:\n08/03/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/16/2025\nHours per Week:\nat least 40\nSalary:\n$6,259 to $8,415 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nat least 4 years\nLocation:\nOlympia, Washington\nDescription\nTitle- Puget Sound Toxic Contaminants Policy Planner\nClassification- Environmental Planner 4\nJob Status- Full-Time/Permanent\nWDFW Program- Habitat Program – Ecosystems Services Division\nDuty Station- Olympia, Washington – Thurston County\nHybrid/Telework- This position is approved for up to 80% telework, at the discretion of the hiring manager. \n\nLearn more about being a member of Team WDFW!\n\nThis position supports the Washington Department of Fish and Wildlife’s mission by addressing the impacts of toxic contaminants on fish, wildlife, and their habitats - particularly in the Puget Sound region and associated watersheds. \n\nWorking within the Habitat Program's Ecosystem Services Division, the role involves coordinating with monitoring programs, developing resources, and recommending management policies to reduce contaminant impacts in critical habitats. The position collaborates internally to align science with policy and externally with agencies, Tribes, regional partners, and stakeholders to advance WDFW’s habitat conservation and recovery goals.\n\n\nWhat to Expect-\nAmong the varied range of responsibilities held within this role, Toxic Contaminants Policy Plannerwill,\n\nDevelop resources that synthesize and contextualize WDFW research on toxic contaminants in Puget Sound for use by WDFW staff and external partners and decision makers:\nUsing data and reports generated by WDFW scientists, manage the development of synthesis resources (e.g. hot spot maps, guidance documents, synthesis reports) that can be used by internal and external decision makers to reduce the impact of toxic contaminants on Puget Sound habitats and species.\nWork with internal and external partners to identify future resources WDFW could produce that would advance the goal of minimizing the impact of toxic contaminants on fish and wildlife and their habitats.\nWork with agency communications staff to develop communications products that promote newly developed resources to the broader toxic contaminants management communities in the Puget Sound region.\n\nConnect WDFW toxic contaminant monitoring work to other WDFW staff or partners working on ecosystem health, conservation or restoration in the Puget Sound region:\nHelp build relationships with other state, local, and federal agencies, as well as Tribes and other interest groups that monitor toxic contaminants or work on ecosystem health, conservation or restoration in the Puget Sound region.\nWork with internal and external partners to identify current research needs to further WDFW toxic policy aims in the Puget Sound region.\nProvide coordination support (such as leading or attending quarterly partner meetings) to ensure timely communication of research results to necessary partners.\n\nProvide subject matter expertise regarding toxic contaminant policies, management approaches and regulations in Puget Sound habitats (including marine, nearshore, estuarine, and riparian habitats):\nAssist Toxic Contaminants Policy Lead in responding to information requests regarding toxic contaminants in aquatic habitats.\nAssist as a subject matter expert in the development of policies regarding the management of toxic chemicals in the Puget Sound Region. Review proposed policies and management or recovery plans to ensure toxic contaminant impacts are adequately considered.\n \n\nWorking Conditions: \n\nWork setting, including hazards: This is primarily office work, but includes some driving and travel to various locations, primarily in Washington State. Infrequent field work on or near water may include water and tripping hazards. Field hazards would primarily be from proximity to water/tripping hazards (during habitat restoration site visits) or while on a motorized boat (helping document specimen collection). This position may involve working in or near water, including tasks that require navigating, negotiating, and performing duties related to water environments.\n\nSchedule (i.e., hours and days): Generally, 8 a.m. - 5 p.m. Monday- Friday with some evening and weekend work possible.\n\nTravel: Occasional driving and travel to various locations, primarily in Washington State.\n\nCustomer Interactions: Responsible for engaging with agency staff and stakeholders to develop policy tools, which requires good interpersonal and project management skills.\n\n\nQualifications:\n\nRequired Qualifications: \n\nClosely related qualifying experience may be substituted for the required education on a year-by-year basis. \n\nOption 1: A master’s degree or above with major emphasis in land use, urban, regional, environmental, or natural resource planning, landscape architecture, geography, land use or environmental law, public administration with an environmental emphasis, or closely related field with two (2) years of professional experience in land use, urban, regional, environmental, or natural resource planning, and/or program development. \n\nOption 2: Bachelor's degree in natural resource or environmental science, natural resource or environmental planning, or public administration or public policy with an environmental emphasis, or closely related field with at least four (4) years of professional experience in natural resource or environmental science, natural resource or environmental planning, or public administration, or environmental policy, planning, or program development.\n\nOption 3: Associate’s degree in natural resource or environmental science, natural resource or environmental planning, or public administration or public policy with an environmental emphasis, or closely related field with at least six (6) years of professional experience in natural resource or environmental science, natural resource or environmental planning, or public administration, or environmental policy, planning, or program development.\n\nOption 4: One (1) year of experience as an Environmental Planner 3\n\nIn addition to the above requirements the candidate must have experience in/with the following: \nPublic-sector organizational structures and processes, with experience analyzing environmental and natural resource regulations, programs, and planning frameworks.\nTwo (2) or more years of experience successfully facilitating group meetings, stakeholder discussions, or interagency workgroups, including applying project management methodologies to guide planning efforts.\nAbility to work productively with partners who may have separate programmatic or departmental goals and are not co-located.\nStrong verbal and written communication skills, including demonstrated success conveying complex scientific, policy, or planning concepts to diverse, non-technical audiences.\nTime management and organizational skills, with the ability to manage multiple long-term projects or planning initiatives simultaneously.\nApplying critical thinking and systems-level analysis to address complex natural resource planning challenges.\nDeveloping planning products, reports, or decision-support tools that synthesize complex environmental data for use by policy makers, land managers, or environmental health professionals.\nInterpersonal and leadership skills, including the ability to recognize and integrate diverse perspectives, communicate assertively and respectfully, and remain mission- and service-oriented in a dynamic work environment.\n\n\nPreferred Qualifications:\nIn addition to the required qualifications, our ideal applicant will possess one or more of the following:\nTwo (2) or more years of experience with federal, state, or local programs such as the Comprehensive Environmental Response, Compensation, and Liability Act, Model Toxics Control Act, etc., researching, monitoring, reporting, reducing, or regulating toxic contaminants.\nTwo (2) or more years of experience with partnering with local, state, and federal governmental agencies, tribes, and the public regarding habitat protection and restoration.\nNegotiation and conflict resolution skills, including experience mediating, or facilitating environmental conflicts.\nExperience with fish, wildlife, and habitat conservation or restoration projects in Washington State and the natural resource laws, policies, and programs that govern this work.\nDemonstrated ability to lead an interdisciplinary project team to achieve desired and productive outcomes.\nExperience using any of the following tools in environmental science or natural resources management contexts:\nMicrosoft Office programs (including Word, Excel, and PowerPoint)\nArcGIS Online or other online mapping tools\nSimple scripts in R, Python, or a similar code language to create visual representations of large amounts of data.\n \n\nYour application should include the following:\nA completed online application showcasing how your qualifications align with the job requirements.\nAn up-to-date resume.\nA cover letter detailing your interest in the position, your relevant skills and experience, and why you are the ideal candidate.\nAt least three professional references with current contact information.\n \n\nSupplemental information:\n\nIn addition to pay and other special employee programs, there are other benefits that WDFW employees may be eligible for. Click the “Benefits” tab at the top of this announcement to learn more.\n\nImportant Note: \nAll new employees must complete an Employment Eligibility Verification Form (I-9 Form) on their first day of work. If hired for this or any position at WDFW, you will be required to provide documentation proving you are eligible to work in the United States. For a list of acceptable documents, please use the following link:  https://www.uscis.gov/i-9-central/form-i-9-acceptable-documents\n\nUnion - WAFWP:\nThis position is in the bargaining unit represented by the Washington Association of Fish & Wildlife Professionals and is subject to the terms of the Collective Bargaining Agreement between the State of Washington, Department of Fish & Wildlife, and the Washington Association of Fish & Wildlife Professionals.\n\nVeteran and Military Spouse Preference Notice: \nPer RCW 73.16.010 Veterans and qualifying spouses who meet the minimum qualifications of a position are eligible for preference during the initial application review stage. To receive this benefit, please do the following: \nNotify us of your veteran or military spouse status by email at RecruitmentTeam@dfw.wa.gov. \nVeterans only – Attach a copy of your DD214 (Member 4 copy), NGB 22 or USDVA signed verification of service letter.\nPlease redact any PII (personally identifiable information) data such as social security numbers.\nSubject line must include recruitment number, position, and spouse/veteran (example: 2024-1234 – Biologist 1 – Veteran)\nInclude your name as it appears on your application in careers.wa.gov.\n\nDiversity, Equity, and Inclusion Employer\n\nAs part of WDFW’s efforts to advance respectful and inclusive work environments, the Agency expects inclusivity as part of our professional interactions and communications.  Therefore, we want to ensure that all individuals feel welcome, are treated fairly and respectfully.  All staff are empowered to fully contribute to serving their work unit, Agency, and the citizens of Washington.\n\nThe Department of Fish and Wildlife is an equal opportunity employer.  We strive to create a working environment that includes and respects cultural, racial, ethnic, sexual orientation and gender identity diversity.  Women, racial and ethnic minorities, persons of disability, persons over 40 years of age, disabled and Vietnam era veterans and people of all sexual orientations and gender identities are encouraged to apply.\n\nRequest an accommodation: Persons needing accommodation in the application process or this announcement in an alternative format please contact Jayme Chase by phone 360-902-2278 or email Jayme.Chase@dfw.wa.gov, or the Telecommunications Device for the Deaf (TDD) at 800-833-6388.\n\nTechnical Difficulties: If you are having technical difficulties creating, accessing, or completing your application, please call NEOGOV toll-free at (855) 524-5627 or support@neogov.com. \n\nOther questions: If you have other questions regarding this position, please reach out to diana.humes@dfw.wa.gov\n\nFollow us on social media: LinkedIn | Facebook | Instagram \nContact\nRecruitment Team\ncontact via the web posting is preferred (see Details section)",
    "requirements": "In addition to the above requirements the candidate must have experience in/with the following:",
    "project_details": "What to Expect-\nAmong the varied range of responsibilities held within this role, Toxic Contaminants Policy Plannerwill,\n\nDevelop resources that synthesize and contextualize WDFW research on toxic contaminants in Puget Sound for use by WDFW staff and external partners and decision makers:\nUsing data and reports generated by WDFW scientists, manage the development of synthesis resources (e. Work with internal and external partners to identify current research needs to further WDFW toxic policy aims in the Puget Sound region. Provide coordination support (such as leading or attending quarterly partner meetings) to ensure timely communication of research results to necessary partners",
    "contact_info": "",
    "application_deadline": "08/03/2025\nPublished:\n07/09/2025\nStarting Date:\nafter 8/16/2025\nHours per Week:\nat least 40\nSalary:\n$6,259 to $8,415 per month\nEducation Required:\nSome Undergraduate\nExperience Required:\nat least 4 years\nLocation:\nOlympia, Washington\nDescription\nTitle- Puget Sound Toxic Contaminants Policy Planner\nClassification- Environmental Planner 4\nJob Status- Full-Time/Permanent\nWDFW Program- Habitat Program – Ecosystems Services Division\nDuty Station- Olympia, Washington – Thurston County\nHybrid/Telework- This position is approved for up to 80% telework, at the discretion of the hiring manager",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Natural Resource Management",
    "discipline_confidence": 0.317,
    "discipline_keywords": [
      "natural resources",
      "environmental policy",
      "environmental law",
      "stakeholder"
    ],
    "is_big10_university": true,
    "university_name": "University of Washington",
    "scraped_at": "2025-07-15T16:17:14.351782+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Sea Turtle Care Center Intern",
    "organization": "South Carolina Aquarium (Private)",
    "location": "100 Aquarium Wharf (Charleston, South Carolina)",
    "salary": "none",
    "starting_date": "between 10/1/2025 and 10/10/2025",
    "published_date": "07/09/2025",
    "tags": "Graduate Opportunities, Undergraduate Opportunities",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107485",
    "description": "Sea Turtle Care Center Intern\nSouth Carolina Aquarium (Private) | https://www.scaquarium.org\nDetails\nPosting:\nhttps://scaquarium.org/careers/\nApplication Deadline:\n08/10/2025\nPublished:\n07/09/2025\nStarting Date:\nbetween 10/1/2025 and 10/10/2025\nEnding Date:\nbetween 2/20/2026 and 2/28/2026\nHours per Week:\n30 - 40\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n100 Aquarium Wharf (Charleston, South Carolina)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nExtend your academic knowledge with a hands-on internship at the South Carolina Aquarium Sea Turtle Care Center\nLocated along the pristine harbor in the heart of historic Charleston, the South Carolina Aquarium has been inspiring visitors for over twenty years. From our over 5,000 animals to our award-winning education team, from the Sea Turtle Care Center™ to our conservation programs protecting local species, visitors are struck with awe and inspiration as they journey through all our exhibits, representing the mountains to the sea of South Carolina.\n\nAbout the South Carolina Aquarium\nWe are a nonprofit 501(c)(3) organization and an accredited member of the Association of Zoos and Aquariums with a mission to inspire conservation of the natural world by exhibiting and caring for animals, by excelling in education and research and by providing an exceptional visitor experience.\n\n\nApplication Instructions and Key Dates\nInternship duration: October 1, 2025 - February 28, 2026\n* Start and end date are slightly flexible\nApplications will be accepted beginning July 10 - August 10, 2025   \nSelected applicants will be notified by September 30, 2025\n\nDescription\nSea Turtle Care Center Interns have the opportunity to learn about and participate in the rescue, rehabilitation, and release of native sea turtle species. Interns will assist staff in all aspects of the daily care of sick and injured sea turtles, occasional medical procedures, and educational programs. The overall goal of our internship program is to help interns learn the ins and outs of sea turtle rehabilitation to help prepare for a career in the field. \n\nPrimary Duties\nPerform general patient care: feedings, tank maintenance, and water changes\nMaintain general cleanliness and inventory of hospital and supplies\nAssist with medical procedures\nDetailed record keeping\nAssist in miscellaneous projects as needed\nPerform informal and formal educational programs related to the Sea Turtle Care Center\n\nWinter Season Specifications\nThe Sea Turtle Care Center is the only sea turtle hospital in the state of South Carolina. Winter is our slower season in regard to local strandings. If tank space allows, we assist northern sea turtle rehabilitation facilities by taking several cold stun patients.  This allows for the opportunity to learn how to admit a higher number of turtles at one time and to learn valuable hands-on knowledge of a common cause of stranding every winter throughout the country. While local releases are not possible during this time of year due to colder waters, it is possible that you will get the chance to participate in a release in Florida.\n\nCommitment & Qualifications\nLength of internship: 5 months\nHours per week: 32-40 hours on average. Will require flexible hours such as long days, weekend shifts, occasional late night/early morning work, and holiday coverage.\nEducation level: Recent college graduate or college senior with a background in biology, zoology, animal science, or related field. \n\nNecessary Additional Skills\nDemonstrates interest in environmental conservation, rehabilitation or wildlife biology\nWillingness to interact professionally with the public and other staff\nAbility to work with a team and independently \nMust be able to demonstrate initiative and be detail oriented\n\nPhysical Requirements\nOften requires walking, standing, and bending. Regularly requires stooping, crouching, climbing ladders/steps, carrying up to 50 lbs., sitting, kneeling, pushing/pulling, working with tools and working in tight spaces. \n\nCompensation & Benefits\nAt this time, the South Carolina Aquarium does not provide compensation or housing. We know how difficult it is to commit to an unpaid internship, but we try our best to incorporate as many learning opportunities as possible and to work with you. Our desired schedule is working four days with three consecutive days off. \n\nWe offer professional development workshops in order to help you become a more competitive job candidate.  \n\nA reciprocity pass to local attractions and aquarium tickets are provided, as is a membership to the Aquarium.\nContact\nAmy Kovach\n843-577-3474\nakovach@scaquarium.org (preferred contact method)",
    "requirements": "Hours per Week:\n30 - 40\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone",
    "project_details": "About the South Carolina Aquarium\nWe are a nonprofit 501(c)(3) organization and an accredited member of the Association of Zoos and Aquariums with a mission to inspire conservation of the natural world by exhibiting and caring for animals, by excelling in education and research and by providing an exceptional visitor experience",
    "contact_info": "",
    "application_deadline": "08/10/2025\nPublished:\n07/09/2025\nStarting Date:\nbetween 10/1/2025 and 10/10/2025\nEnding Date:\nbetween 2/20/2026 and 2/28/2026\nHours per Week:\n30 - 40\nSalary:\nnone\nEducation Required:\nSome Undergraduate\nExperience Required:\nnone\nLocation:\n100 Aquarium Wharf (Charleston, South Carolina)\nTags:\nGraduate Opportunities\nUndergraduate Opportunities\nDescription\nExtend your academic knowledge with a hands-on internship at the South Carolina Aquarium Sea Turtle Care Center\nLocated along the pristine harbor in the heart of historic Charleston, the South Carolina Aquarium has been inspiring visitors for over twenty years",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": true,
    "university_name": "Indiana University",
    "scraped_at": "2025-07-15T16:17:14.453078+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Landscape Conservation Section Manager - Environmental Planner 5 - Permanent - *04670-25",
    "organization": "Washington Department of Fish & Wildlife (State)",
    "location": "Olympia, Washington",
    "salary": "$6,906 to $9,292 per month",
    "starting_date": "after 8/1/2025",
    "published_date": "07/08/2025",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107622",
    "description": "Landscape Conservation Section Manager - Environmental Planner 5 - Permanent - *04670-25\nWashington Department of Fish & Wildlife (State) | https://wdfw.wa.gov/\nDetails\nPosting:\nhttps://www.governmentjobs.com/careers/washington/jobs/4997208/landscape-conservation-section-manager-environmental-planner-5-permanent-0\nApplication Deadline:\n07/22/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 8/1/2025\nHours per Week:\nat least 40\nSalary:\n$6,906 to $9,292 per month\nEducation Required:\nBachelors\nExperience Required:\nat least 5 years\nLocation:\nOlympia, Washington\nDescription\nTitle- Landscape Conservation Section Manager\nClassification- Environmental Planner 5\nJob Status- Full-Time - Permanent\nWDFW Program- Wildlife Program\nDuty Station- Olympia, Washington – Thurston County\n\nLearn more about being a member of Team WDFW!\n\nLead the development and implementation of complex environmental resource plans and policies focused on landscape-level conservation to support Washington’s at-risk species and ecosystems.\n\nEnvision yourself applying your expertise in biodiversity conservation, habitat connectivity, and collaborative landscape strategies, while guiding a dedicated team to advance agency goals and drive meaningful conservation outcomes.\n\n\nWhat to Expect-\nAmong the varied range of responsibilities held within this role, the Landscape Conservation Section Manager will, \n\nSupport the implementation of the State Wildlife Action Plan to conserve Washington’s Species of Greatest Conservation Need (SGCN) and Important Habitats (IH), with a focus on landscape efforts in Washington’s prairies, forests, and shrubsteppe habitats:\nLead Wildlife Program engagement in and implementation of, landscape-scale habitat restoration and protection programs, including Washington Shrubsteppe Restoration and Resiliency Initiative and South Puget Sound Sentinel Landscape. \nSupport the continued advancement, utilization, and integration of relevant SGCN wildlife science into landscape scale conservation planning, range-wide recovery planning and implementation of on-the-ground actions.\nWork with the Lands Division on wildlife area, recreation, restoration and other programmatic planning, ensuring that conservation of SGCN and IH is achieved through management of WDFW lands. \n\nStatewide Land Strategy and Policy:\nSupport development and implementation of WDFW habitat protection (e.g., easements, fee-title acquisition) priorities and strategy to advance SWAP and species recovery objectives.\nCollaborate with Lands Division to support the Lands 20/20 process. \nProvide technical and policy direction to Agency staff and external partners to facilitate landscape-scale habitat protection and restoration planning and implementation.\n\nDivision Administration and Leadership:\nDirect the strategy and set objectives for the Landscape Conservation Section, which may include project development, applying for grants, coordination of external partnerships, budget setting and approval, and contract administration.\nWork with Division Manager, Assistant Division Manager, and other Section Managers to create, support, communicate, and implement Division vision and priorities both within the Department and with external partners.\nRepresents WDFW at the policy-level on state and national committees and panels focused on collaborative landscape conservation efforts to facilitate implementation of on-the-ground priority actions. \nServe as the Diversity Division liaison to Lands Division to ensure alignment of cross-programmatic conservation objectives on WDFW lands.\n\nStaff Supervision and Guidance:\nResponsible for direct supervision of up to six (6) personnel that are focused on habitat protection, habitat restoration, and large-scale collaborations. \nEnsure that the work of the Landscape Conservation Section is coordinated with and integrates into other relevant WDFW work units within both headquarters and the regions.\n Working Conditions: \n\nWork Setting, including hazards: Work is performed primarily in an office environment, with exposure to hazards mostly limited to those commonly found in government office environments. Time may be spent outdoors engaged in wildlife and habitat conservation activities on the ground. May work in inclement weather, over difficult terrain including slippery rocks, steep banks, and sticky mud.\n\nSchedule: This position is full-time, working 40 hours per week. The standard work schedule is Monday through Friday, 8:00 A.M. to 5:00 P.M., with potential for occasional evening or weekend work as needed. Alternative schedules may be considered based on business needs.\n\nTravel Requirements: Local or regional travel is required to meet with regional staff, attend committee meetings, evaluate properties, conduct general business, or attend or provide training.\n\nCustomer Interactions: Frequent contact with internal staff, including some contact with those who may be angry, distraught, or frustrated. Frequent contact with partners (state, federal and NGO).\n\n\nQualifications:\n\nRequired Qualifications: \n\nOption 1: A master’s degree or above with major emphasis in landscape ecology, conservation biology, wildlife science, wildlife management, land use, urban, regional, environmental, or natural resource planning, geography, land use or environmental law, public administration with an environmental emphasis, or closely related field with five (5) years of professional experience in leading landscape conservation and restoration strategies and a minimum of three (3) years of supervision experience.\n\nOption 2: A Bachelor’s degree with major emphasis in landscape ecology, conservation biology, wildlife science, wildlife management, land use, urban, regional, environmental, or natural resource planning, geography, land use or environmental law, public administration with an environmental emphasis, or closely related field with seven (7) years of professional experience in leading landscape conservation and restoration strategies and a minimum of three (3) years of supervision experience.\n\nOption 3: Eleven (11) years of professional experience in leading landscape conservation and restoration strategies and a minimum of three (3) years of supervision experience.\n\nCertifications/Licenses:\nValid Driver’s License.\n\nSpecial Requirements/Conditions of Employment:\nSuccessful completion of agency training and/or certification per supervisory direction, position need, and training availability.\n\n Preferred Qualifications:\nIn addition to the required qualifications, our ideal applicant will possess some or all the following:\n\nFour (4) or more years of supervisory experience, including supervision of high-level professionals\nFive (5) years of professional experience leading high-level employees in conservation & restoration\n\nExperience with:\nCoordinating and leading small groups, creating a cooperative and productive environment in which to resolve problems or develop and implement plans.\nAnalyzing data, policy, preparing reports, and applying laws and policies.\nThe presentation, facilitation, training, public speaking, and/or technical writing of complex information\nPartnering with clients, customers, and stakeholders\nConflict resolution and relationship management\nApplying and demonstrating interpersonal skills, emotional intelligence, ability to lead change, ability to produce results, and the ability to build coalitions\nAdvancing habitat protection projects such as through conservation easements and fee-title acquisition.\nArcGIS, including data management and spatial analyses\n\nFamiliarity with: \nLaws regulations, and policies such as those associated with the Endangered Species Act, National Environmental Policy Act, National Historic Preservation Act, State Environmental Policy Act, and State Growth Management Act, and federal Farm Bill.\n \n\nYour application should include the following:\nA completed online application showcasing how your qualifications align with the job requirements.\nAn up-to-date resume.\nA cover letter detailing your interest in the position, your relevant skills and experience, and why you are the ideal candidate.\nAt least three professional references with current contact information.\n \n\nSupplemental Information\n\nIn addition to pay and other special employee programs, there are other benefits that WDFW employees may be eligible for. Click the “Benefits” tab at the top of this announcement to learn more.\n\nImportant Note: \nAll new employees must complete an Employment Eligibility Verification Form (I-9 Form) on their first day of work. If hired for this or any position at WDFW, you will be required to provide documentation proving you are eligible to work in the United States. For a list of acceptable documents, please use the following link:  https://www.uscis.gov/i-9-central/form-i-9-acceptable-documents\n\nVeteran and Military Spouse Preference Notice: \nPer RCW 73.16.010 Veterans and qualifying spouses who meet the minimum qualifications of a position are eligible for preference during the initial application review stage. To receive this benefit, please do the following: \nNotify us of your veteran or military spouse status by email at Elizabeth.Bullard@dfw.wa.gov. \nVeterans only – Attach a copy of your DD214 (Member 4 copy), NGB 22 or USDVA signed verification of service letter.\nPlease redact any PII (personally identifiable information) data such as social security numbers.\nSubject line must include recruitment number, position, and spouse/veteran (example: 2024-1234 – Biologist 1 – Veteran)\nInclude your name as it appears on your application in careers.wa.gov.\n\nDiversity, Equity, and Inclusion Employer\n\nAs part of WDFW’s efforts to advance respectful and inclusive work environments, the Agency expects inclusivity as part of our professional interactions and communications.  Therefore, we want to ensure that all individuals feel welcome, are treated fairly and respectfully.  All staff are empowered to fully contribute to serving their work unit, Agency, and the citizens of Washington.\n\nThe Department of Fish and Wildlife is an equal opportunity employer.  We strive to create a working environment that includes and respects cultural, racial, ethnic, sexual orientation and gender identity diversity.  Women, racial and ethnic minorities, persons of disability, persons over 40 years of age, disabled and Vietnam era veterans and people of all sexual orientations and gender identities are encouraged to apply.\n\nRequest an accommodation: Persons needing accommodation in the application process or this announcement in an alternative format please contact Jayme Chase by phone 360-902-2278 or email Jayme.Chase@dfw.wa.gov, or the Telecommunications Device for the Deaf (TDD) at 800-833-6388.\n\nTechnical Difficulties: If you are having technical difficulties creating, accessing, or completing your application, please call NEOGOV toll-free at (855) 524-5627 or support@neogov.com. \n\nOther questions: If you have other questions regarding this position, please reach out to Elizabeth.Bullard@dfw.wa.gov and reference job #2025-04670.\n\nFollow us on social media:  LinkedIn | Facebook | Instagram\nContact\nRecruitment Team\ncontact via the web posting is preferred (see Details section)",
    "requirements": "Travel Requirements: Local or regional travel is required to meet with regional staff, attend committee meetings, evaluate properties, conduct general business, or attend or provide training.",
    "project_details": "Division Administration and Leadership:\nDirect the strategy and set objectives for the Landscape Conservation Section, which may include project development, applying for grants, coordination of external partnerships, budget setting and approval, and contract administration. The presentation, facilitation, training, public speaking, and/or technical writing of complex information\nPartnering with clients, customers, and stakeholders\nConflict resolution and relationship management\nApplying and demonstrating interpersonal skills, emotional intelligence, ability to lead change, ability to produce results, and the ability to build coalitions\nAdvancing habitat protection projects such as through conservation easements and fee-title acquisition",
    "contact_info": "",
    "application_deadline": "07/22/2025\nPublished:\n07/08/2025\nStarting Date:\nafter 8/1/2025\nHours per Week:\nat least 40\nSalary:\n$6,906 to $9,292 per month\nEducation Required:\nBachelors\nExperience Required:\nat least 5 years\nLocation:\nOlympia, Washington\nDescription\nTitle- Landscape Conservation Section Manager\nClassification- Environmental Planner 5\nJob Status- Full-Time - Permanent\nWDFW Program- Wildlife Program\nDuty Station- Olympia, Washington – Thurston County\n\nLearn more about being a member of Team WDFW!\n\nLead the development and implementation of complex environmental resource plans and policies focused on landscape-level conservation to support Washington’s at-risk species and ecosystems",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Wildlife & Natural Resources",
    "discipline_confidence": 0.289,
    "discipline_keywords": [
      "wildlife",
      "wildlife management",
      "habitat",
      "ecosystem",
      "biodiversity"
    ],
    "is_big10_university": true,
    "university_name": "University of Washington",
    "scraped_at": "2025-07-15T16:17:14.534077+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Biological Science Technician (Wildlife)",
    "organization": "USDA Wildlife Services (Federal)",
    "location": "Fort Benning, Georgia",
    "salary": "$38,121 to $61,805 per year",
    "starting_date": "between 9/8/2025 and 10/6/2025",
    "published_date": "07/11/2025",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107697",
    "description": "Biological Science Technician (Wildlife)\nUSDA Wildlife Services (Federal)\nDetails\nApplication Deadline:\n07/28/2025\nPublished:\n07/11/2025\nStarting Date:\nbetween 9/8/2025 and 10/6/2025\nHours per Week:\nat least 40\nSalary:\n$38,121 to $61,805 per year\nEducation Required:\nHigh School Diploma\nExperience Required:\nat least 1 year\nLocation:\nFort Benning, Georgia\nDescription\nVACANCY ANNOUNCEMENT\n OPEN DATE:                       07/14/25\n             CLOSING DATE:                07/28/25          \n                                                         \n\n |  | United States Department of Agriculture   Animal and Plant Health Inspection Service   Wildlife Services   Georgia State Office  200 Phoenix Rd Athens, GA 30605 Ph: (706) 546-5637 Fax: (706) 316-9248   An Equal Opportunity Employer      \nPOSITION TITLE:              Biological Science Technician (Wildlife)\n TYPE OF POSITION:         13 Month Term Appointment with possibility for Benefits, Excepted Service, (may be extended up to 4 years))\n              WORK SCHEDULE:           Full-Time\n ANNOUNCEMENT:            GA-25-01\n SERIES/GRADE:                 GS-0404-04- 05 or 06 depending on qualifications\n FULL PERFORMANCE\nLEVEL:                                   GS-404-06\n LOCATION:                         Fort Benning, GA\n                                                            (Relocation expenses will not be paid)\n SALARY:                               04-$38,121-$49,563 per year\n                                                05-$42,651-$55,441 per year\n                                                06-$47,544-$61,805 per year\n                                                             WHO MAY APPLY:\nMust be a U.S. Citizen\nMust be 18 years old\nIf you are a male born after December 31, 1959, and are at least 18 years of age, civil service employment law (5 U.S.C. 3328) requires that you must be registered with the Selective Service System, unless you meet certain exemptions (proof of registration and/or exemption required).  Website: http://www.sss.gov.\n REQUIRED DOCUMENTS:\nResume that includes:\n1) Personal information such as name, address, contact information\n2) Education\n3) Detailed work experience related to this position as described in the announcement including \n§   Work schedule including hours per week \n§   Dates of employment; \n§   Title, series, grade (if applicable)\n4) All supervisors' phone numbers and if they may be contacted\n5) Other qualifications\n Transcripts (if qualifying on education, education must have been obtained from an accredited institution. Education completed in a foreign institution must include an evaluation by an organization that specializes in interpretation of foreign education programs that it was deemed equivalent to an accredited U.S. education program, see: Foreign Education Evaluation. All transcripts must be in English or include an English translation.)\n DD-214 (Member 4 copy)\nVA letter required for applicable Veteran preference, if applies. \n\nCurrent active-duty members must submit a certification that they are expected to be discharged or released from active duty under honorable conditions not later than 120 days after the date the certification is submitted. \n HOW TO APPLY: Additional materials not listed above (i.e. position descriptions, training certificates, etc.) may not be considered.  Applicants who do not submit the required items listed above may not be considered.  Applications with all supporting documents must be submitted to the contact office and must be RECEIVED by the CLOSING DATE of this announcement.\n Interested individuals should send a resume, transcripts, veteran documentation (if applicable) to the address listed here:\n              CONTACT OFFICE:\n Luke Harvard\nUSDA/APHIS Wildlife Services\nSouth GA District Supervisor\n(229) 403-2263\nluke.b.harvard@usda.gov\n    DUTIES:\nResponsible for organizing and conducting direct control operations to reduce wildlife damage within a geographical area or technical/subject area of program involvement.\n Inspects and surveys areas and, as necessary, will revise existing WDM programs in close consultation with higher-level management.\n Uses WDM tools/devices which may include some or all of the following depending on need in assigned area: firearms; foothold, body-grip, cage traps; foot snares; neck snares; chemical control methods; pyrotechnics; noise cannons/exploders; drop nets; rocket/cannon nets; various other scaring devices.\n Assists Wildlife Biologists by correctly identifying current, and forecasting future damage, problems and relating them to the damage-causing species.\n Independently determines and selects the most effective means of control for individual situations.\n Modifies or adapts established damage control techniques as necessary to meet local conditions and address specific environmental, economic or political considerations.\n Assists in the negotiation of cooperative service agreements with landowners, lessees, or administrators to accomplish the goals outlined for the WS program.\n Enters data into established WDM database/system of record. Uses data to prepare and submit routine reports regarding daily, weekly or monthly activities, observations, and events. \n Assists in conducting demonstrations and training for others, including other cooperators or other interested groups, on WDM methods, procedures, and program objectives.\n Complies with restrictions and mitigation measures established through consultation with relevant Federal and State agencies.\n Carries out duties in accordance with program decisions made in compliance with the National Environmental Policy Act (NEPA) and Endangered Species Act (ESA) under guidance and oversight by supervisor.\n Performs other duties, as required. \n   MINIMUM ELIGIBLITY REQUIREMENTS:\nTo qualify, applicants MUST meet all minimum qualification requirements, except Medical Requirements, by the closing date of the announcement.\n  QUALIFICATIONS REQUIRED:\n For the GS-4 Grade Level:  \nApplicants must have 6 months of general experience and 6 months of specialized experience (equivalent to the GS-03 level) that may have been obtained in the private or public (local, county, state, Federal) sectors which demonstrates:\n Identifying North American wildlife species.\n Experience in the principles of wildlife ecology and management in support of a wildlife management program.\n Experience in preparing baits and setting traps in accordance with standard procedures.\n Experience keeping routine and basic records of daily activities and observations.\n OR\nEducation Substitution at the GS-4 Grade Level:   Successful completion of 2 years of study that included at least 12 semester hours in any combination of courses such as biology, chemistry, statistics, entomology, animal husbandry, botany, physics, agriculture, or mathematics.  At least 6 semester hours of courses must be in wildlife.\n OR \nCombination of Education and Experience at the GS-4 Grade Level: \nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements. The total percentages must equal at least 100 percent to qualify for that grade level.\n For the GS-5 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-4 level) that may have been obtained in the private or public (local, county, state, federal) sectors which demonstrate experience in:\n Experience in wildlife damage mitigation methods and techniques.\n Experience using lethal and non-lethal animal control techniques.\n Conducting basic computer operations for record keeping, data analysis, report writing and correspondence.\n OR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major study, or at least 24 semester hours, in any combination of scientific or technical courses such as biology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics, with at least 6 semester hours in wildlife.\n OR\nCombination of Education and Experience at the GS-5 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements.  The total percentages must equal at least 100 percent to qualify for that grade level.\n For the GS-6 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-5 level) that may have been obtained in the private or public (local, county, state, federal) sectors which demonstrates experience in:\n Dealing with human-wildlife conflicts and principles of wildlife damage management.\n The requirements of the Migratory Bird Treaty Act (MBTA), Endangered Species Act, and National Environment Policy Act.\n Conducting wildlife damage assessments, counts and abundance surveys.\n The use of firearms, traps, snares, pesticides, immobilizing drugs, pyrotechnics, electronic harassment devices, and other non-lethal control tools.\n Creating/maintaining public contacts to formulate assistance strategies that incorporate technical assistance and operational control techniques.\n OR\nSuccessfully completed 1 year of graduate education (18 semester hours) in wildlife.\n OR\nCombination of Education and Experience at the GS-6 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements.  The total percentages must equal at least 100 percent to qualify for that grade level.\n \nHOW YOU WILL BE EVALUATED\n\n\nApplicants who meet basic minimum qualifications may be referred to the hiring manager for selection.  Qualified candidates eligible for veterans’ preference will receive referral and selection priority over non-veterans.\n\nOTHER REQUIREMENTS: \n ·        Must obtain or have a valid state driver’s license.  Operation of Government-owned or leased vehicles is required. (if this applies)\n·        As a condition of employment, appropriate security clearance is required for this position.\n·        Direct Deposit: Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution. \n·        Successfully pass the E-Verify employment verification check. To learn more about E- Verify, including your rights and responsibilities, visit https://www.e-verify.gov/. \n·        Position is subject to random and applicant drug testing.\n·        Must demonstrate a respect for safety in all operations, including the operation of motor vehicles, firearms, control devices, and equipment.\n·        Occasional travel may be required \n·        Initial trial period may be required\n·        In order to perform the essential duties of this position, you must have the legal and physical ability to possess and discharge firearms. You must be able to pass a government background check and meet any additional requirements to carry and use firearms. A background check will include answering questions about where you’ve lived, worked, went to school, and any military history or police records. Selection and retention in this position is contingent on a successfully adjudicated FBI National Criminal History Check (fingerprint check).\n  Emergency Response – APHIS is an emergency response agency.  This means that all Agency employees may be asked or assigned to participate in rotating temporary duty assignments to support emergency programs at some time during their careers with APHIS.  It is difficult to predict the frequency with which such emergency situations may occur – and could range from several emergencies in a year to none over the course of many years.  In the event that you are called upon to support an emergency program, this may require irregular working hours, including overtime, and may include duties other than those specified in your official position description.  While some emergency program support assignments may be able to be performed at the employee’s current duty station, in other cases employees may be asked to go on-site to a temporary duty state location.  In addition, it may be necessary for employees to participate in multiple rotations to an emergency program assignment.  Attempts will be made to keep disruption to the employee to a minimum.\n See this link: https://www.usajobs.gov//Help/working-in-government/fair-and-transparent/signature-false-statements/\n NOTE: APPLICANTS FOR THIS POSITION WILL BE REQUIRED TO SUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE PRIOR TO APPOINTMENT. APPOINTMENT TO THE POSITION WILL BE CONTINGENT UPON A NEGATIVE DRUG TEST RESULT. INCUMBENTS OF THIS POSITION WILL BE REQUIRED TO SUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE ON AN ONGOING BASIS AFTER APPOINTMENT, AS DIRECTED. \n Carrying a firearm is a condition of employment – In the passing of the Lautenberg Amendment, Congress passed legislation which prohibits anyone who has been convicted of a misdemeanor crime of domestic violence from possessing a firearm or ammunition. If selected you will be required to sign the form, “Inquiry for Positions Requiring Possession of Firearms,” certifying that you meet this criteria.\n\nThe United States government does not discriminate in employment on the basis of race, color, religion, sex, pregnancy, national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service or other non-merit factor.\n\n\nReasonable Accommodation Policy- \n\n\nFederal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a Case-by-Case basis. \n\n\nA reasonable accommodation is any change in the workplace or the way things are customarily done that provides an equal employment opportunity to an individual with a disability. Under the Rehabilitation Act of 1973 the Equal Employment Opportunity Commission (EEOC) must provide reasonable accommodations: \n\nAn applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.\nAn employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.\nAn employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.\n Under the Fair Chance Act, agencies are not allowed to request information about an applicant’s criminal history until a conditional offer of employment has been made, except as allowed for access to classified information; assignment to national security duties or positions; acceptance or retention in the armed forces; or recruitment of a Federal law enforcement officer.  An applicant may submit a complaint or any other information related to an organization’s alleged noncompliance with the Fair Chance Act.  The complaint must be submitted within 30 calendar days of the date of the alleged noncompliance.  To make a Fair Chance Act inquiry or complaint, send an email with the appropriate information to MRP.Fairchance@usda.gov subject line: Fair Chance Act.\n Relocation costs will not be paid for this position.\n More than one position may be selected from this announcement.\n  Contact\nLuke Harvard\n2294032263\nluke.b.harvard@usda.gov (preferred contact method)",
    "requirements": "VACANCY ANNOUNCEMENT\n OPEN DATE:                       07/14/25\n             CLOSING DATE:                07/28/25          \n                                                         \n\n |  | United States Department of Agriculture   Animal and Plant Health Inspection Service   Wildlife Services   Georgia State Office  200 Phoenix Rd Athens, GA 30605 Ph: (706) 546-5637 Fax: (706) 316-9248   An Equal Opportunity Employer      \nPOSITION TITLE:              Biological Science Technician (Wildlife)\n TYPE OF POSITION:         13 Month Term Appointment with possibility for Benefits, Excepted Service, (may be extended up to 4 years))\n              WORK SCHEDULE:           Full-Time\n ANNOUNCEMENT:            GA-25-01\n SERIES/GRADE:                 GS-0404-04- 05 or 06 depending on qualifications\n FULL PERFORMANCE\nLEVEL:                                   GS-404-06\n LOCATION:                         Fort Benning, GA\n                                                            (Relocation expenses will not be paid)\n SALARY:                               04-$38,121-$49,563 per year\n                                                05-$42,651-$55,441 per year\n                                                06-$47,544-$61,805 per year\n                                                             WHO MAY APPLY:\nMust be a U.S. Citizen\nMust be 18 years old\nIf you are a male born after December 31, 1959, and are at least 18 years of age, civil service employment law (5 U.S.C. 3328) requires that you must be registered with the Selective Service System, unless you meet certain exemptions (proof of registration and/or exemption required).  Website: http://www.sss.gov.\n REQUIRED DOCUMENTS:\nResume that includes:\n1) Personal information such as name, address, contact information\n2) Education\n3) Detailed work experience related to this position as described in the announcement including \n§   Work schedule including hours per week \n§   Dates of employment; \n§   Title, series, grade (if applicable)\n4) All supervisors' phone numbers and if they may be contacted\n5) Other qualifications\n Transcripts (if qualifying on education, education must have been obtained from an accredited institution. Education completed in a foreign institution must include an evaluation by an organization that specializes in interpretation of foreign education programs that it was deemed equivalent to an accredited U.S. education program, see: Foreign Education Evaluation. All transcripts must be in English or include an English translation.)\n DD-214 (Member 4 copy)\nVA letter required for applicable Veteran preference, if applies. \n\nCurrent active-duty members must submit a certification that they are expected to be discharged or released from active duty under honorable conditions not later than 120 days after the date the certification is submitted. \n HOW TO APPLY: Additional materials not listed above (i.e. position descriptions, training certificates, etc.) may not be considered.  Applicants who do not submit the required items listed above may not be considered.  Applications with all supporting documents must be submitted to the contact office and must be RECEIVED by the CLOSING DATE of this announcement.\n Interested individuals should send a resume, transcripts, veteran documentation (if applicable) to the address listed here:\n              CONTACT OFFICE:\n Luke Harvard\nUSDA/APHIS Wildlife Services\nSouth GA District Supervisor\n(229) 403-2263\nluke.b.harvard@usda.gov\n    DUTIES:\nResponsible for organizing and conducting direct control operations to reduce wildlife damage within a geographical area or technical/subject area of program involvement.\n Inspects and surveys areas and, as necessary, will revise existing WDM programs in close consultation with higher-level management.\n Uses WDM tools/devices which may include some or all of the following depending on need in assigned area: firearms; foothold, body-grip, cage traps; foot snares; neck snares; chemical control methods; pyrotechnics; noise cannons/exploders; drop nets; rocket/cannon nets; various other scaring devices.\n Assists Wildlife Biologists by correctly identifying current, and forecasting future damage, problems and relating them to the damage-causing species.\n Independently determines and selects the most effective means of control for individual situations.\n Modifies or adapts established damage control techniques as necessary to meet local conditions and address specific environmental, economic or political considerations.\n Assists in the negotiation of cooperative service agreements with landowners, lessees, or administrators to accomplish the goals outlined for the WS program.\n Enters data into established WDM database/system of record. Uses data to prepare and submit routine reports regarding daily, weekly or monthly activities, observations, and events. \n Assists in conducting demonstrations and training for others, including other cooperators or other interested groups, on WDM methods, procedures, and program objectives.\n Complies with restrictions and mitigation measures established through consultation with relevant Federal and State agencies.\n Carries out duties in accordance with program decisions made in compliance with the National Environmental Policy Act (NEPA) and Endangered Species Act (ESA) under guidance and oversight by supervisor.\n Performs other duties, as required. \n   MINIMUM ELIGIBLITY REQUIREMENTS:\nTo qualify, applicants MUST meet all minimum qualification requirements, except Medical Requirements, by the closing date of the announcement.\n  QUALIFICATIONS REQUIRED:\n For the GS-4 Grade Level:  \nApplicants must have 6 months of general experience and 6 months of specialized experience (equivalent to the GS-03 level) that may have been obtained in the private or public (local, county, state, Federal) sectors which demonstrates:\n Identifying North American wildlife species.\n Experience in the principles of wildlife ecology and management in support of a wildlife management program.\n Experience in preparing baits and setting traps in accordance with standard procedures.\n Experience keeping routine and basic records of daily activities and observations.\n OR\nEducation Substitution at the GS-4 Grade Level:   Successful completion of 2 years of study that included at least 12 semester hours in any combination of courses such as biology, chemistry, statistics, entomology, animal husbandry, botany, physics, agriculture, or mathematics.  At least 6 semester hours of courses must be in wildlife.\n OR \nCombination of Education and Experience at the GS-4 Grade Level: \nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements. The total percentages must equal at least 100 percent to qualify for that grade level.\n For the GS-5 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-4 level) that may have been obtained in the private or public (local, county, state, federal) sectors which demonstrate experience in:\n Experience in wildlife damage mitigation methods and techniques.\n Experience using lethal and non-lethal animal control techniques.\n Conducting basic computer operations for record keeping, data analysis, report writing and correspondence.\n OR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major study, or at least 24 semester hours, in any combination of scientific or technical courses such as biology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics, with at least 6 semester hours in wildlife.\n OR\nCombination of Education and Experience at the GS-5 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements.  The total percentages must equal at least 100 percent to qualify for that grade level.\n For the GS-6 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-5 level) that may have been obtained in the private or public (local, county, state, federal) sectors which demonstrates experience in:\n Dealing with human-wildlife conflicts and principles of wildlife damage management.\n The requirements of the Migratory Bird Treaty Act (MBTA), Endangered Species Act, and National Environment Policy Act.\n Conducting wildlife damage assessments, counts and abundance surveys.\n The use of firearms, traps, snares, pesticides, immobilizing drugs, pyrotechnics, electronic harassment devices, and other non-lethal control tools.\n Creating/maintaining public contacts to formulate assistance strategies that incorporate technical assistance and operational control techniques.\n OR\nSuccessfully completed 1 year of graduate education (18 semester hours) in wildlife.\n OR\nCombination of Education and Experience at the GS-6 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience to meet total qualification requirements.  The total percentages must equal at least 100 percent to qualify for that grade level.\n \nHOW YOU WILL BE EVALUATED\n\n\nApplicants who meet basic minimum qualifications may be referred to the hiring manager for selection.  Qualified candidates eligible for veterans’ preference will receive referral and selection priority over non-veterans.\n\nOTHER REQUIREMENTS: \n ·        Must obtain or have a valid state driver’s license.  Operation of Government-owned or leased vehicles is required. (if this applies)\n·        As a condition of employment, appropriate security clearance is required for this position.\n·        Direct Deposit: Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution. \n·        Successfully pass the E-Verify employment verification check. To learn more about E- Verify, including your rights and responsibilities, visit https://www.e-verify.gov/. \n·        Position is subject to random and applicant drug testing.\n·        Must demonstrate a respect for safety in all operations, including the operation of motor vehicles, firearms, control devices, and equipment.\n·        Occasional travel may be required \n·        Initial trial period may be required\n·        In order to perform the essential duties of this position, you must have the legal and physical ability to possess and discharge firearms. You must be able to pass a government background check and meet any additional requirements to carry and use firearms. A background check will include answering questions about where you’ve lived, worked, went to school, and any military history or police records. Selection and retention in this position is contingent on a successfully adjudicated FBI National Criminal History Check (fingerprint check).\n  Emergency Response – APHIS is an emergency response agency.  This means that all Agency employees may be asked or assigned to participate in rotating temporary duty assignments to support emergency programs at some time during their careers with APHIS.  It is difficult to predict the frequency with which such emergency situations may occur – and could range from several emergencies in a year to none over the course of many years.  In the event that you are called upon to support an emergency program, this may require irregular working hours, including overtime, and may include duties other than those specified in your official position description.  While some emergency program support assignments may be able to be performed at the employee’s current duty station, in other cases employees may be asked to go on-site to a temporary duty state location.  In addition, it may be necessary for employees to participate in multiple rotations to an emergency program assignment.  Attempts will be made to keep disruption to the employee to a minimum.\n See this link: https://www.usajobs.gov//Help/working-in-government/fair-and-transparent/signature-false-statements/\n NOTE: APPLICANTS FOR THIS POSITION WILL BE REQUIRED TO SUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE PRIOR TO APPOINTMENT. APPOINTMENT TO THE POSITION WILL BE CONTINGENT UPON A NEGATIVE DRUG TEST RESULT. INCUMBENTS OF THIS POSITION WILL BE REQUIRED TO SUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE ON AN ONGOING BASIS AFTER APPOINTMENT, AS DIRECTED. \n Carrying a firearm is a condition of employment – In the passing of the Lautenberg Amendment, Congress passed legislation which prohibits anyone who has been convicted of a misdemeanor crime of domestic violence from possessing a firearm or ammunition. If selected you will be required to sign the form, “Inquiry for Positions Requiring Possession of Firearms,” certifying that you meet this criteria.\n\nThe United States government does not discriminate in employment on the basis of race, color, religion, sex, pregnancy, national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service or other non-merit factor.\n\n\nReasonable Accommodation Policy- \n\n\nFederal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a Case-by-Case basis. \n\n\nA reasonable accommodation is any change in the workplace or the way things are customarily done that provides an equal employment opportunity to an individual with a disability. Under the Rehabilitation Act of 1973 the Equal Employment Opportunity Commission (EEOC) must provide reasonable accommodations: \n\nAn applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.\nAn employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.\nAn employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.\n Under the Fair Chance Act, agencies are not allowed to request information about an applicant’s criminal history until a conditional offer of employment has been made, except as allowed for access to classified information; assignment to national security duties or positions; acceptance or retention in the armed forces; or recruitment of a Federal law enforcement officer.  An applicant may submit a complaint or any other information related to an organization’s alleged noncompliance with the Fair Chance Act.  The complaint must be submitted within 30 calendar days of the date of the alleged noncompliance.  To make a Fair Chance Act inquiry or complaint, send an email with the appropriate information to MRP.Fairchance@usda.gov subject line: Fair Chance Act.\n Relocation costs will not be paid for this position.\n More than one position may be selected from this announcement.",
    "project_details": "OR\nEducation Substitution at the GS-4 Grade Level:   Successful completion of 2 years of study that included at least 12 semester hours in any combination of courses such as biology, chemistry, statistics, entomology, animal husbandry, botany, physics, agriculture, or mathematics. OR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major study, or at least 24 semester hours, in any combination of scientific or technical courses such as biology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics, with at least 6 semester hours in wildlife",
    "contact_info": "",
    "application_deadline": "07/28/2025\nPublished:\n07/11/2025\nStarting Date:\nbetween 9/8/2025 and 10/6/2025\nHours per Week:\nat least 40\nSalary:\n$38,121 to $61,805 per year\nEducation Required:\nHigh School Diploma\nExperience Required:\nat least 1 year\nLocation:\nFort Benning, Georgia\nDescription\nVACANCY ANNOUNCEMENT\n OPEN DATE:                       07/14/25\n             CLOSING DATE:                07/28/25          \n                                                         \n\n |  | United States Department of Agriculture   Animal and Plant Health Inspection Service   Wildlife Services   Georgia State Office  200 Phoenix Rd Athens, GA 30605 Ph: (706) 546-5637 Fax: (706) 316-9248   An Equal Opportunity Employer      \nPOSITION TITLE:              Biological Science Technician (Wildlife)\n TYPE OF POSITION:         13 Month Term Appointment with possibility for Benefits, Excepted Service, (may be extended up to 4 years))\n              WORK SCHEDULE:           Full-Time\n ANNOUNCEMENT:            GA-25-01\n SERIES/GRADE:                 GS-0404-04- 05 or 06 depending on qualifications\n FULL PERFORMANCE\nLEVEL:                                   GS-404-06\n LOCATION:                         Fort Benning, GA\n                                                            (Relocation expenses will not be paid)\n SALARY:                               04-$38,121-$49,563 per year\n                                                05-$42,651-$55,441 per year\n                                                06-$47,544-$61,805 per year\n                                                             WHO MAY APPLY:\nMust be a U",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:14.615541+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  },
  {
    "title": "Biological Science Technician (Wildlife)",
    "organization": "US Dept. of Ag. Wildlife Services (Federal)",
    "location": "2535 Fox Hill Rd, State College, PA 16803, USA (State College, Pennsylvania)",
    "salary": "$40,332 to $58,445 per year",
    "starting_date": "between 8/24/2025 and 9/7/2025",
    "published_date": "07/10/2025",
    "tags": "N/A",
    "url": "https://jobs.rwfm.tamu.edu/view-job/?id=107671",
    "description": "Biological Science Technician (Wildlife)\nUS Dept. of Ag. Wildlife Services (Federal) | https://my.aphis.usda.gov/myportal/myaphis/programs/wildlife-services\nDetails\nApplication Deadline:\n07/17/2025\nPublished:\n07/10/2025\nStarting Date:\nbetween 8/24/2025 and 9/7/2025\nHours per Week:\nat least 40\nSalary:\n$40,332 to $58,445 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\n2535 Fox Hill Rd, State College, PA 16803, USA (State College, Pennsylvania)\nDescription\nOPEN DATE:  July 10, 2025\nCLOSING DATE:  July 17, 2025\nPOSITION TITLE:  Biological Science Technician (Wildlife)\nTYPE OF POSITION:  13 Month Term Appointment with possibility for Benefits,\nExcepted Service, (may be extended up to 4 years)\nWORK SCHEDULE: Full time\nANNOUNCEMENT #:  PA-CD-2025-04\nSERIES/GRADE:  GS-0404-5/6\nFULL PERFORMANCE LEVEL:  GS-0404-6\nLOCATION:  State College, PA (State College Regional Airport)  (Relocation expenses will not be paid)\nSALARY: $40,332 – $58,445 per year\n\nWHO MAY APPLY:\n Must be a U.S. Citizen\n Must be 18 years old\n If you are a male born after December 31, 1959 and are at least 18 years of age, civil service\nemployment law (5 U.S.C. 3328) requires that you must be registered with the Selective\nService System, unless you meet certain exemptions (proof of registration and/or exemption\nrequired). Website: http://www.sss.gov.\n\nREQUIRED DOCUMENTS:\nResume that includes:\n1) Personal information such as name, address, contact information\n2) Education\n3) Detailed work experience related to this position as described in the\nannouncement including\n Work schedule including hours per week\n Dates of employment;\n Title, series, grade (if applicable)\n4) All supervisors' phone numbers and if they may be contacted\n5) Other qualifications\nTranscripts (if qualifying on education, education must have been obtained from an\naccredited institution. Education completed in a foreign institution must include an\nevaluation by an organization that specializes in interpretation of foreign education programs\nthat it was deemed equivalent to an accredited U.S. education program, see: Foreign\nEducation Evaluation. All transcripts must be in English or include an English translation.)\nDD-214 (Member 4 copy)\nVA letter required for applicable Veteran preference, if applies.\nCurrent active duty members must submit a certification that they are expected to be\ndischarged or released from active duty under honorable conditions not later than 120 days\nafter the date the certification is submitted.\n\nHOW TO APPLY: Additional materials not listed above (i.e. position descriptions, training\ncertificates, etc.) may not be considered. Applicants who do not submit the required items listed\nabove may not be considered. Applications with all supporting documents must be submitted to the\ncontact office and must be RECEIVED by the CLOSING DATE of this announcement.\nInterested individuals should send a resume, transcripts, veteran documentation (if applicable) to the\naddress listed here:\nCONTACT OFFICE:\nUSDA APHIS Wildlife Services\nPO Box 60827\nHarrisburg, PA 17106\nAttn: Tony Roland\nEmail: Tony.c.roland@usda.gov\nPhone (724) 263-9232\n\nSummary:\nThe primary duties of this position will be to continue a long-term integrated wildlife damage\nmanagement program at State College Regional Airport and surrounding area to reduce bird strikes\nand resolve damage from a variety of species including Canada geese, European starling, cottontail\nrabbits, woodchucks and white-tailed deer.  Duties include continuous monthly wildlife monitoring\nsurveys, presentations, non-lethal & lethal management of wildlife as well as sampling wildlife for\ndiseases including avian influenza and chronic wasting disease.\n\nDUTIES:\nResponsible for organizing and conducting direct control operations to reduce wildlife damage\nwithin a geographical area or technical/subject area of program involvement.\nInspects and surveys areas and, as necessary, will revise existing WDM programs in close\nconsultation with higher-level management.\nUses WDM tools/devices which may include some or all of the following depending on need in\nassigned area: firearms; foothold, body-grip, cage traps; foot snares; neck snares; chemical control\nmethods; pyrotechnics; noise cannons/exploders; drop nets; rocket/cannon nets; various other\nscaring devices.\nAssists Wildlife Biologists by correctly identifying current, and forecasting future damage,\nproblems and relating them to the damage-causing species.\nIndependently determines and selects the most effective means of control for individual situations.\nModifies or adapts established damage control techniques as necessary to meet local conditions and\naddress specific environmental, economic or political considerations.\nAssists in the negotiation of cooperative service agreements with landowners, lessees, or\nadministrators to accomplish the goals outlined for the WS program.\nEnters data into established WDM database/system of record. Uses data to prepare and submit\nroutine reports regarding daily, weekly or monthly activities, observations, and events.\nAssists in conducting demonstrations and training for others, including other cooperators or other\ninterested groups, on WDM methods, procedures, and program objectives.\nComplies with restrictions and mitigation measures established through consultation with relevant\nFederal and State agencies.\nCarries out duties in accordance with program decisions made in compliance with the National\nEnvironmental Policy Act (NEPA) and Endangered Species Act (ESA) under guidance and\noversight by supervisor.\nPerforms other duties, as required.\n\nMINIMUM ELIGIBLITY REQUIREMENTS:\nTo qualify, applicants MUST meet all minimum qualification requirements, except Medical\nRequirements, by the closing date of the announcement.\n\nQUALIFICATIONS REQUIRED:\nFor the GS-5 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-4 level) that may\nhave been obtained in the private or public (local, county, state, federal) sectors which demonstrate\nexperience in:\nExperience in wildlife damage mitigation methods and techniques.\nExperience using lethal and non-lethal animal control techniques.\nConducting basic computer operations for record keeping, data analysis, report writing and\ncorrespondence.\nOR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major\nstudy, or at least 24 semester hours, in any combination of scientific or technical courses such as\nbiology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics,\nwith at least 6 semester hours in wildlife.\nOR\nCombination of Education and Experience at the GS-5 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience\nto meet total qualification requirements. The total percentages must equal at least 100 percent to\nqualify for that grade level.\n\nFor the GS-6 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-5 level) that may\nhave been obtained in the private or public (local, county, state, federal) sectors which demonstrates\nexperience in:\nDealing with human-wildlife conflicts and principles of wildlife damage management at airports.\nThe requirements of the Migratory Bird Treaty Act (MBTA), Endangered Species Act, and National\nEnvironment Policy Act.\nConducting wildlife damage assessments, counts and abundance surveys.\nThe use of firearms, traps, snares, pesticides, immobilizing drugs, pyrotechnics, electronic\nharassment devices, and other non-lethal control tools.\nCreating/maintaining public contacts to formulate assistance strategies that incorporate technical\nassistance and operational control techniques.\nOR\nSuccessfully completed 1 year of graduate education (18 semester hours) in wildlife.\nOR\nCombination of Education and Experience at the GS-6 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience\nto meet total qualification requirements. The total percentages must equal at least 100 percent to\nqualify for that grade level.\n\nHOW YOU WILL BE EVALUATED\nApplicants who meet basic minimum qualifications may be referred to the hiring manager for\nselection. Qualified candidates eligible for veterans’ preference will receive referral and selection\npriority over non-veterans.\n\nOTHER REQUIREMENTS:\n Must obtain or have a valid state driver’s license. Operation of Government-owned or leased\nvehicles is required. (if this applies)\n As a condition of employment, appropriate security clearance is required for this position.\n Direct Deposit: Per Public Law 104-134 all Federal employees are required to have federal\npayments made by direct deposit to their financial institution.\n Successfully pass the E-Verify employment verification check. To learn more about E- Verify,\nincluding your rights and responsibilities, visit https://www.e-verify.gov/.\n Position is subject to random and applicant drug testing.\n Must demonstrate a respect for safety in all operations, including the operation of motor vehicles,\nfirearms, control devices, and equipment.\n Occasional travel may be required\n Initial trial period may be required\nIf, after reviewing your resume and/or supporting documentation, a determination is made that you\nhave inflated your qualifications and/or experience, you may be found ineligible. Providing inaccurate\ninformation on Federal documents could be grounds for non-selection or disciplinary action up to\nincluding removal from the Federal service.\n In order to perform the essential duties of this position, you must have the legal and physical\nability to possess and discharge firearms. You must be able to pass a government background\ncheck and meet any additional requirements to carry and use firearms. A background check will\ninclude answering questions about where you’ve lived, worked, went to school, and any military\nhistory or police records. Selection and retention in this position is contingent on a successfully\nadjudicated FBI National Criminal History Check (fingerprint check).\nEmergency Response – APHIS is an emergency response agency. This means that all Agency\nemployees may be asked or assigned to participate in rotating temporary duty assignments to support\nemergency programs at some time during their careers with APHIS. It is difficult to predict the\nfrequency with which such emergency situations may occur – and could range from several\nemergencies in a year to none over the course of many years. In the event that you are called upon\nto support an emergency program, this may require irregular working hours, including overtime, and\nmay include duties other than those specified in your official position description. While some\nemergency program support assignments may be able to be performed at the employee’s current duty\nstation, in other cases employees may be asked to go on-site to a temporary duty state location. In\naddition, it may be necessary for employees to participate in multiple rotations to an emergency\nprogram assignment. Attempts will be made to keep disruption to the employee to a minimum.\nSee this link: https://www.usajobs.gov//Help/working-in-government/fair-andtransparent/\nsignature-false-statements/\n\nNOTE: APPLICANTS FOR THIS POSITION WILL BE REQUIRED TO SUBMIT TO\nURINALYSIS TO SCREEN FOR ILLEGAL DRUG USE PRIOR TO APPOINTMENT.\nAPPOINTMENT TO THE POSITION WILL BE CONTINGENT UPON A NEGATIVE\nDRUG TEST RESULT. INCUMBENTS OF THIS POSITION WILL BE REQUIRED TO\nSUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE ON AN ONGOING\nBASIS AFTER APPOINTMENT, AS DIRECTED.\n\nCarrying a firearm is a condition of employment – In the passing of the Lautenberg Amendment,\nCongress passed legislation which prohibits anyone who has been convicted of a misdemeanor crime\nof domestic violence from possessing a firearm or ammunition. If selected you will be required to\nsign the form, “Inquiry for Positions Requiring Possession of Firearms,” certifying that you meet this\ncriteria.\nThe United States government does not discriminate in employment on the basis of race,\ncolor, religion, sex, pregnancy, national origin, political affiliation, sexual orientation, marital\nstatus, disability, genetic information, age, membership in an employee organization,\nretaliation, parental status, military service or other non-merit factor.\nReasonable Accommodation Policy-\nFederal agencies must provide reasonable accommodation to applicants with disabilities\nwhere appropriate. Applicants requiring reasonable accommodation for any part of the\napplication and hiring process should contact the hiring agency directly. Determinations\non requests for reasonable accommodation will be made on a Case-by-Case basis.\nA reasonable accommodation is any change in the workplace or the way things are\ncustomarily done that provides an equal employment opportunity to an individual with a\ndisability. Under the Rehabilitation Act of 1973 the Equal Employment Opportunity\nCommission (EEOC) must provide reasonable accommodations:\n An applicant with a disability needs an accommodation to have an equal\nopportunity to apply for a job.\n An employee with a disability needs an accommodation to perform the essential\njob duties or to gain access to the workplace.\n An employee with a disability needs an accommodation to receive equal access to\nbenefits, such as details, training, and office-sponsored events.\nUnder the Fair Chance Act, agencies are not allowed to request information about an\napplicant’s criminal history until a conditional offer of employment has been made, except\nas allowed for access to classified information; assignment to national security duties or\npositions; acceptance or retention in the armed forces; or recruitment of a Federal law\nenforcement officer. An applicant may submit a complaint or any other information\nrelated to an organization’s alleged noncompliance with the Fair Chance Act. The\ncomplaint must be submitted within 30 calendar days of the date of the alleged\nnoncompliance. To make a Fair Chance Act inquiry or complaint, send an email with the\nappropriate information to MRP.Fairchance@usda.gov subject line: Fair Chance Act.\nRelocation costs will not be paid for this position.\nMore than one position may be selected from this announcement.\nContact\nTony Roland\n724-263-9232\ntony.c.roland@usda.gov (preferred contact method)",
    "requirements": "OPEN DATE:  July 10, 2025\nCLOSING DATE:  July 17, 2025\nPOSITION TITLE:  Biological Science Technician (Wildlife)\nTYPE OF POSITION:  13 Month Term Appointment with possibility for Benefits,\nExcepted Service, (may be extended up to 4 years)\nWORK SCHEDULE: Full time\nANNOUNCEMENT #:  PA-CD-2025-04\nSERIES/GRADE:  GS-0404-5/6\nFULL PERFORMANCE LEVEL:  GS-0404-6\nLOCATION:  State College, PA (State College Regional Airport)  (Relocation expenses will not be paid)\nSALARY: $40,332 – $58,445 per year\n\nWHO MAY APPLY:\n Must be a U.S. Citizen\n Must be 18 years old\n If you are a male born after December 31, 1959 and are at least 18 years of age, civil service\nemployment law (5 U.S.C. 3328) requires that you must be registered with the Selective\nService System, unless you meet certain exemptions (proof of registration and/or exemption\nrequired). Website: http://www.sss.gov.\n\nREQUIRED DOCUMENTS:\nResume that includes:\n1) Personal information such as name, address, contact information\n2) Education\n3) Detailed work experience related to this position as described in the\nannouncement including\n Work schedule including hours per week\n Dates of employment;\n Title, series, grade (if applicable)\n4) All supervisors' phone numbers and if they may be contacted\n5) Other qualifications\nTranscripts (if qualifying on education, education must have been obtained from an\naccredited institution. Education completed in a foreign institution must include an\nevaluation by an organization that specializes in interpretation of foreign education programs\nthat it was deemed equivalent to an accredited U.S. education program, see: Foreign\nEducation Evaluation. All transcripts must be in English or include an English translation.)\nDD-214 (Member 4 copy)\nVA letter required for applicable Veteran preference, if applies.\nCurrent active duty members must submit a certification that they are expected to be\ndischarged or released from active duty under honorable conditions not later than 120 days\nafter the date the certification is submitted.\n\nHOW TO APPLY: Additional materials not listed above (i.e. position descriptions, training\ncertificates, etc.) may not be considered. Applicants who do not submit the required items listed\nabove may not be considered. Applications with all supporting documents must be submitted to the\ncontact office and must be RECEIVED by the CLOSING DATE of this announcement.\nInterested individuals should send a resume, transcripts, veteran documentation (if applicable) to the\naddress listed here:\nCONTACT OFFICE:\nUSDA APHIS Wildlife Services\nPO Box 60827\nHarrisburg, PA 17106\nAttn: Tony Roland\nEmail: Tony.c.roland@usda.gov\nPhone (724) 263-9232\n\nSummary:\nThe primary duties of this position will be to continue a long-term integrated wildlife damage\nmanagement program at State College Regional Airport and surrounding area to reduce bird strikes\nand resolve damage from a variety of species including Canada geese, European starling, cottontail\nrabbits, woodchucks and white-tailed deer.  Duties include continuous monthly wildlife monitoring\nsurveys, presentations, non-lethal & lethal management of wildlife as well as sampling wildlife for\ndiseases including avian influenza and chronic wasting disease.\n\nDUTIES:\nResponsible for organizing and conducting direct control operations to reduce wildlife damage\nwithin a geographical area or technical/subject area of program involvement.\nInspects and surveys areas and, as necessary, will revise existing WDM programs in close\nconsultation with higher-level management.\nUses WDM tools/devices which may include some or all of the following depending on need in\nassigned area: firearms; foothold, body-grip, cage traps; foot snares; neck snares; chemical control\nmethods; pyrotechnics; noise cannons/exploders; drop nets; rocket/cannon nets; various other\nscaring devices.\nAssists Wildlife Biologists by correctly identifying current, and forecasting future damage,\nproblems and relating them to the damage-causing species.\nIndependently determines and selects the most effective means of control for individual situations.\nModifies or adapts established damage control techniques as necessary to meet local conditions and\naddress specific environmental, economic or political considerations.\nAssists in the negotiation of cooperative service agreements with landowners, lessees, or\nadministrators to accomplish the goals outlined for the WS program.\nEnters data into established WDM database/system of record. Uses data to prepare and submit\nroutine reports regarding daily, weekly or monthly activities, observations, and events.\nAssists in conducting demonstrations and training for others, including other cooperators or other\ninterested groups, on WDM methods, procedures, and program objectives.\nComplies with restrictions and mitigation measures established through consultation with relevant\nFederal and State agencies.\nCarries out duties in accordance with program decisions made in compliance with the National\nEnvironmental Policy Act (NEPA) and Endangered Species Act (ESA) under guidance and\noversight by supervisor.\nPerforms other duties, as required.\n\nMINIMUM ELIGIBLITY REQUIREMENTS:\nTo qualify, applicants MUST meet all minimum qualification requirements, except Medical\nRequirements, by the closing date of the announcement.\n\nQUALIFICATIONS REQUIRED:\nFor the GS-5 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-4 level) that may\nhave been obtained in the private or public (local, county, state, federal) sectors which demonstrate\nexperience in:\nExperience in wildlife damage mitigation methods and techniques.\nExperience using lethal and non-lethal animal control techniques.\nConducting basic computer operations for record keeping, data analysis, report writing and\ncorrespondence.\nOR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major\nstudy, or at least 24 semester hours, in any combination of scientific or technical courses such as\nbiology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics,\nwith at least 6 semester hours in wildlife.\nOR\nCombination of Education and Experience at the GS-5 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience\nto meet total qualification requirements. The total percentages must equal at least 100 percent to\nqualify for that grade level.\n\nFor the GS-6 Grade Level:\nApplicants must have one year of specialized experience (equivalent to the GS-5 level) that may\nhave been obtained in the private or public (local, county, state, federal) sectors which demonstrates\nexperience in:\nDealing with human-wildlife conflicts and principles of wildlife damage management at airports.\nThe requirements of the Migratory Bird Treaty Act (MBTA), Endangered Species Act, and National\nEnvironment Policy Act.\nConducting wildlife damage assessments, counts and abundance surveys.\nThe use of firearms, traps, snares, pesticides, immobilizing drugs, pyrotechnics, electronic\nharassment devices, and other non-lethal control tools.\nCreating/maintaining public contacts to formulate assistance strategies that incorporate technical\nassistance and operational control techniques.\nOR\nSuccessfully completed 1 year of graduate education (18 semester hours) in wildlife.\nOR\nCombination of Education and Experience at the GS-6 Grade Level:\nApplicants may have combinations of successfully completed education and specialized experience\nto meet total qualification requirements. The total percentages must equal at least 100 percent to\nqualify for that grade level.\n\nHOW YOU WILL BE EVALUATED\nApplicants who meet basic minimum qualifications may be referred to the hiring manager for\nselection. Qualified candidates eligible for veterans’ preference will receive referral and selection\npriority over non-veterans.\n\nOTHER REQUIREMENTS:\n Must obtain or have a valid state driver’s license. Operation of Government-owned or leased\nvehicles is required. (if this applies)\n As a condition of employment, appropriate security clearance is required for this position.\n Direct Deposit: Per Public Law 104-134 all Federal employees are required to have federal\npayments made by direct deposit to their financial institution.\n Successfully pass the E-Verify employment verification check. To learn more about E- Verify,\nincluding your rights and responsibilities, visit https://www.e-verify.gov/.\n Position is subject to random and applicant drug testing.\n Must demonstrate a respect for safety in all operations, including the operation of motor vehicles,\nfirearms, control devices, and equipment.\n Occasional travel may be required\n Initial trial period may be required\nIf, after reviewing your resume and/or supporting documentation, a determination is made that you\nhave inflated your qualifications and/or experience, you may be found ineligible. Providing inaccurate\ninformation on Federal documents could be grounds for non-selection or disciplinary action up to\nincluding removal from the Federal service.\n In order to perform the essential duties of this position, you must have the legal and physical\nability to possess and discharge firearms. You must be able to pass a government background\ncheck and meet any additional requirements to carry and use firearms. A background check will\ninclude answering questions about where you’ve lived, worked, went to school, and any military\nhistory or police records. Selection and retention in this position is contingent on a successfully\nadjudicated FBI National Criminal History Check (fingerprint check).\nEmergency Response – APHIS is an emergency response agency. This means that all Agency\nemployees may be asked or assigned to participate in rotating temporary duty assignments to support\nemergency programs at some time during their careers with APHIS. It is difficult to predict the\nfrequency with which such emergency situations may occur – and could range from several\nemergencies in a year to none over the course of many years. In the event that you are called upon\nto support an emergency program, this may require irregular working hours, including overtime, and\nmay include duties other than those specified in your official position description. While some\nemergency program support assignments may be able to be performed at the employee’s current duty\nstation, in other cases employees may be asked to go on-site to a temporary duty state location. In\naddition, it may be necessary for employees to participate in multiple rotations to an emergency\nprogram assignment. Attempts will be made to keep disruption to the employee to a minimum.\nSee this link: https://www.usajobs.gov//Help/working-in-government/fair-andtransparent/\nsignature-false-statements/\n\nNOTE: APPLICANTS FOR THIS POSITION WILL BE REQUIRED TO SUBMIT TO\nURINALYSIS TO SCREEN FOR ILLEGAL DRUG USE PRIOR TO APPOINTMENT.\nAPPOINTMENT TO THE POSITION WILL BE CONTINGENT UPON A NEGATIVE\nDRUG TEST RESULT. INCUMBENTS OF THIS POSITION WILL BE REQUIRED TO\nSUBMIT TO URINALYSIS TO SCREEN FOR ILLEGAL DRUG USE ON AN ONGOING\nBASIS AFTER APPOINTMENT, AS DIRECTED.\n\nCarrying a firearm is a condition of employment – In the passing of the Lautenberg Amendment,\nCongress passed legislation which prohibits anyone who has been convicted of a misdemeanor crime\nof domestic violence from possessing a firearm or ammunition. If selected you will be required to\nsign the form, “Inquiry for Positions Requiring Possession of Firearms,” certifying that you meet this\ncriteria.\nThe United States government does not discriminate in employment on the basis of race,\ncolor, religion, sex, pregnancy, national origin, political affiliation, sexual orientation, marital\nstatus, disability, genetic information, age, membership in an employee organization,\nretaliation, parental status, military service or other non-merit factor.\nReasonable Accommodation Policy-\nFederal agencies must provide reasonable accommodation to applicants with disabilities\nwhere appropriate. Applicants requiring reasonable accommodation for any part of the\napplication and hiring process should contact the hiring agency directly. Determinations\non requests for reasonable accommodation will be made on a Case-by-Case basis.\nA reasonable accommodation is any change in the workplace or the way things are\ncustomarily done that provides an equal employment opportunity to an individual with a\ndisability. Under the Rehabilitation Act of 1973 the Equal Employment Opportunity\nCommission (EEOC) must provide reasonable accommodations:\n An applicant with a disability needs an accommodation to have an equal\nopportunity to apply for a job.\n An employee with a disability needs an accommodation to perform the essential\njob duties or to gain access to the workplace.\n An employee with a disability needs an accommodation to receive equal access to\nbenefits, such as details, training, and office-sponsored events.\nUnder the Fair Chance Act, agencies are not allowed to request information about an\napplicant’s criminal history until a conditional offer of employment has been made, except\nas allowed for access to classified information; assignment to national security duties or\npositions; acceptance or retention in the armed forces; or recruitment of a Federal law\nenforcement officer. An applicant may submit a complaint or any other information\nrelated to an organization’s alleged noncompliance with the Fair Chance Act. The\ncomplaint must be submitted within 30 calendar days of the date of the alleged\nnoncompliance. To make a Fair Chance Act inquiry or complaint, send an email with the\nappropriate information to MRP.Fairchance@usda.gov subject line: Fair Chance Act.\nRelocation costs will not be paid for this position.\nMore than one position may be selected from this announcement.",
    "project_details": "OR\nSuccessful completion of a full 4-year course of study leading to a bachelor’s degree with major\nstudy, or at least 24 semester hours, in any combination of scientific or technical courses such as\nbiology, chemistry, entomology, animal husbandry, botany, physics, agriculture, or mathematics,\nwith at least 6 semester hours in wildlife",
    "contact_info": "",
    "application_deadline": "07/17/2025\nPublished:\n07/10/2025\nStarting Date:\nbetween 8/24/2025 and 9/7/2025\nHours per Week:\nat least 40\nSalary:\n$40,332 to $58,445 per year\nEducation Required:\nBachelors\nExperience Required:\nnone\nLocation:\n2535 Fox Hill Rd, State College, PA 16803, USA (State College, Pennsylvania)\nDescription\nOPEN DATE:  July 10, 2025\nCLOSING DATE:  July 17, 2025\nPOSITION TITLE:  Biological Science Technician (Wildlife)\nTYPE OF POSITION:  13 Month Term Appointment with possibility for Benefits,\nExcepted Service, (may be extended up to 4 years)\nWORK SCHEDULE: Full time\nANNOUNCEMENT #:  PA-CD-2025-04\nSERIES/GRADE:  GS-0404-5/6\nFULL PERFORMANCE LEVEL:  GS-0404-6\nLOCATION:  State College, PA (State College Regional Airport)  (Relocation expenses will not be paid)\nSALARY: $40,332 – $58,445 per year\n\nWHO MAY APPLY:\n Must be a U",
    "is_graduate_position": false,
    "grad_confidence": 0.9,
    "position_type": "Professional",
    "discipline": "Unknown",
    "discipline_confidence": 0.0,
    "discipline_keywords": [],
    "is_big10_university": false,
    "university_name": "",
    "scraped_at": "2025-07-15T16:17:14.697329+00:00",
    "scrape_run_id": "scrape_20250715_161625_89beb326",
    "scraper_version": "2.0"
  }
]